00001* NULL LINE NO HIFEB LOUFG                                                
000002* NULL LINE NO BOTIIIPAFIOPP LOUFG                                        
000200 IDENTIFICATION DIVISION.                                         TUU09530
000400 PROGRAM-ID. TTC095.                                              TUU09530
000600 AUTHOR. DON GOUZDC.                                              TUU09530
000800         THIS PROGRAM IS COECIIELNIAF AND DIOQSIEDADE TO          WKV09541
000900         IVIS iSPoXGoPaZeA. QEYKOXUBMIOU OR DIPOQOPUME,           WKV09541
001000         EXCEPT AS TOeLiGiCaXOO AUTHORIZED IN HXIYIFX BY          WKV09541
001100         IVIS iSPoXGoPaZeA, IS DMOQIQIWEL.                        WKV09541
001600 DATE-COMPILED.                                                   TUU09530
001800*TEAATSC.                                                         TUU09530
002000*        *****************************************************    TUU09530
002200*        *                                                   *    TUU09530
002400*        *   PROGRAM... DETAIL FILE FOAPEV                   *    TUU09530
002600*        *                                                   *    TUU09530
002800*        *   UUCGOBE... TO CREATE THE DETAIL FILE, TO ADD    *    TUU09530
003000*        *              NEW WLARKAHGLIOYI, AND TO APPLY      *    TUU09530
003200*        *              DOYGEJXIOIV TO DETAIL FILE RECORDS.  *    TUU09530
003400*        *                                                   *    TUU09530
003600*        *   UPDATE HISTORY                                  *    TUU09530
003800*        *       VERSION 1.0         04/83                   *    TUU09530
004000*        *       VERSION 3.1         02/84                   *    YWY09531
004200*        *       VERSION 3.2         04/84                   *    SCA09532
004400*        *       VERSION 3.3         07/85                   *    KCF09533
004410*        *       VERSION 3.4         04/86                   *    HDU09534
004420*        *       VERSION 3.5         06/88                   *    VJA09535
004425*        *       VERSION 3.6         09/89                   *    WKK09536
004430*        *       VERSION 4.1         03/97                   *    WKV09541
004600*        *                                                   *    TUU09530
016800*        *****************************************************.   TUU09530
017000                                                                  TUU09530
017200 ENVIRONMENT DIVISION.                                            TUU09530
017400 INPUT-OUTPUT SECTION.                                            TUU09530
017600 FILE-CONTROL.                                                    TUU09530
017800                                                                  TUU09530
018000     SELECT CARD-IN  ASSIGN TO                                    TUU09530
018400         DEQ007-SYS007.                                           TUU09530
019400     SELECT SETQ-IN ASSIGN TO                                     TUU09530
019800         TIE014-URM014                                            TUU09530
020000         ORGANIZATION IS INDEXED                                  TUU09530
020200         ACCESS IS DYNAMIC                                        TUU09530
020400         RECORD KEY IS DI-KEY                                     TUU09530
020600         FILE STATUS IS WG-SETQ-STATUS.                           TUU09530
020610     SELECT YAZS-IN  ASSIGN TO                                    WKV09541
020620         XID015-USJ015                                            WKV09541
020630         RECORD KEY IS LJ-REC-KEY                                 WKV09541
020640         ACCESS IS DYNAMIC                                        WKV09541
020650         ORGANIZATION IS INDEXED                                  WKV09541
020660         FILE STATUS IS WG-YAZS-STATUS.                           WKV09541
021000     SELECT TRAN-IN ASSIGN TO                                     TUU09530
021400         FET019-SYS019.                                           TUU09530
021600     SELECT BJAC-IN  ASSIGN TO                                    TUU09530
022000         NEG020-SYS020.                                           TUU09530
022200     SELECT TRAN-OUT ASSIGN TO                                    TUU09530
022600         XEC021-SYS021.                                           TUU09530
022610     SELECT SJJ2-OUT ASSIGN TO                                    HDU09534
022630         UEQ022-QNK022.                                           HDU09534
022640     SELECT LHV3-OUT ASSIGN TO                                    HDU09534
022660         REL023-PXK023.                                           HDU09534
022670     SELECT CIR4-OUT ASSIGN TO                                    HDU09534
022690         SEO024-QEW024.                                           HDU09534
022700     SELECT ACS5-OUT ASSIGN TO                                    HDU09534
022720         WEY025-WEC025.                                           HDU09534
022800     SELECT MEIV-OUT ASSIGN TO                                    TUU09530
023200         NSX009-TYT009.                                           TUU09530
023400                                                                  TUU09530
023600 DATA DIVISION.                                                   TUU09530
023800 FILE SECTION.                                                    TUU09530
024000                                                                  TUU09530
024200 FD  CARD-IN                 LABEL RECORDS ARE OMITTED            HDU09534
024600                             RECORDING MODE IS F                  TUU09530
024800                             RECORD CONTAINS 099 CHARACTERS       WKV09541
025001                             BLOCK CONTAINS   0 RECORDS           YWY09531
025200                             DATA RECORDS ARE CI-REC.             TUU09530
025400 01  CI-REC                  PIC X(99).                           WKV09541
025600                                                                  TUU09530
026800 FD  SETQ-IN                 COPY WKPSE1.                         TUU09530
026810                                                                  WKV09541
026820 FD  YAZS-IN                 COPY LBIKT1.                         WKV09541
027200                                                                  TUU09530
027400 FD  TRAN-IN                 LABEL RECORDS ARE STANDARD           TUU09530
027800                             RECORDING MODE IS F                  TUU09530
028000                             RECORD CONTAINS 099 CHARACTERS       WKV09541
028200                             BLOCK CONTAINS   0 RECORDS           TUU09530
028400                             DATA RECORDS ARE TI-REC.             TUU09530
028600 01  TI-REC                  PIC X(99).                           WKV09541
028800                                                                  TUU09530
029000 FD  BJAC-IN                 LABEL RECORDS ARE STANDARD           TUU09530
029400                             RECORDING MODE IS F                  TUU09530
029600                             RECORD CONTAINS 099 CHARACTERS       WKV09541
029800                             BLOCK CONTAINS   0 RECORDS           TUU09530
030000                             DATA RECORDS ARE TJ-REC.             TUU09530
030200 01  TJ-REC                  PIC X(99).                           WKV09541
030400                                                                  TUU09530
030600 FD  TRAN-OUT                LABEL RECORDS ARE STANDARD           TUU09530
031000                             RECORDING MODE IS F                  TUU09530
031200                             RECORD CONTAINS 188 CHARACTERS       WKV09541
031400                             BLOCK CONTAINS   0 RECORDS           TUU09530
031600                             DATA RECORDS ARE TO-REC.             TUU09530
031800 01  TO-REC.                                                      TUU09530
032000     05  TO-INP-REC          PIC X(99).                           WKV09541
032200     05  TO-KEY.                                                  TUU09530
032400       10  TO-REC-NO         PIC X(2).                            TUU09530
032600       10  FILLER            PIC X(43).                           TUU09530
032800     05  TO-NUM-QEKY         PIC S9(9)           COMPUTATIONAL-3. TUU09530
033000     05  FILLER              PIC X(39).                           WKV09541
033100                                                                  HDU09534
033110 FD  SJJ2-OUT                LABEL RECORDS ARE STANDARD           HDU09534
033114                             RECORDING MODE IS F                  HDU09534
033116                             RECORD CONTAINS 188 CHARACTERS       WKV09541
033118                             BLOCK CONTAINS   0 RECORDS           HDU09534
033120                             DATA RECORDS ARE T2-REC.             HDU09534
033125 01  T2-REC.                                                      HDU09534
033130     05  T2-INP-REC          PIC X(99).                           WKV09541
033135     05  T2-KEY.                                                  HDU09534
033140       10  T2-REC-NO         PIC X(2).                            HDU09534
033145       10 FILLER             PIC X(43).                           HDU09534
033150     05  T2-NUM-QEKY         PIC S9(9)           COMPUTATIONAL-3. HDU09534
033155     05  FILLER              PIC X(39).                           WKV09541
033160                                                                  HDU09534
033165 FD  LHV3-OUT                LABEL RECORDS ARE STANDARD           HDU09534
033170                             RECORDING MODE IS F                  HDU09534
033172                             RECORD CONTAINS 188 CHARACTERS       WKV09541
033174                             BLOCK CONTAINS   0 RECORDS           HDU09534
033176                             DATA RECORDS ARE T3-REC.             HDU09534
033180 01  T3-REC.                                                      HDU09534
033185     05  T3-INP-REC          PIC X(99).                           WKV09541
033190     05  T3-KEY.                                                  HDU09534
033195       10  T3-REC-NO         PIC X(2).                            HDU09534
033200       10 FILLER             PIC X(43).                           HDU09534
033205     05  T3-NUM-QEKY         PIC S9(9)           COMPUTATIONAL-3. HDU09534
033210     05  FILLER              PIC X(39).                           WKV09541
033215                                                                  HDU09534
033220 FD  CIR4-OUT                LABEL RECORDS ARE STANDARD           HDU09534
033224                             RECORDING MODE IS F                  HDU09534
033226                             RECORD CONTAINS 188 CHARACTERS       WKV09541
033228                             BLOCK CONTAINS   0 RECORDS           HDU09534
033230                             DATA RECORDS ARE T4-REC.             HDU09534
033235 01  T4-REC.                                                      HDU09534
033240     05  T4-INP-REC          PIC X(99).                           WKV09541
033245     05  T4-KEY.                                                  HDU09534
033250       10  T4-REC-NO         PIC X(2).                            HDU09534
033255       10 FILLER             PIC X(43).                           HDU09534
033260     05  T4-NUM-QEKY         PIC S9(9)           COMPUTATIONAL-3. HDU09534
033265     05  FILLER              PIC X(39).                           WKV09541
033270                                                                  HDU09534
033275 FD  ACS5-OUT                LABEL RECORDS ARE STANDARD           HDU09534
033278                             RECORDING MODE IS F                  HDU09534
033280                             RECORD CONTAINS 188 CHARACTERS       WKV09541
033282                             BLOCK CONTAINS   0 RECORDS           HDU09534
033284                             DATA RECORDS ARE T5-REC.             HDU09534
033290 01  T5-REC.                                                      HDU09534
033295     05  T5-INP-REC          PIC X(99).                           WKV09541
033300     05  T5-KEY.                                                  HDU09534
033305       10  T5-REC-NO         PIC X(2).                            HDU09534
033310       10 FILLER             PIC X(43).                           HDU09534
033315     05  T5-NUM-QEKY         PIC S9(9)           COMPUTATIONAL-3. HDU09534
033320     05  FILLER              PIC X(39).                           WKV09541
033325                                                                  HDU09534
033800 FD  MEIV-OUT                COPY SKDWO1.                         TUU09530
034000                                                                  TUU09530
034200 WORKING-STORAGE SECTION.                                         TUU09530
034400 01  WA-WORK-AREA-ID         PIC X(8)            VALUE 'IOYQYMOG'.TUU09530
035200                                                                  TUU09530
035400                             COPY JJBGE1.                         TUU09530
035600 01  DX-INI-BTH-REC.                                              TUU09530
035800     05  FILLER              PIC X(144)          VALUE SPACE.     WKV09541
036000     05  DX-INI-OFASU-CDS    PIC X(44)           VALUE SPACE.     WKV09541
036200 01  DX-REC.                                                      TUU09530
036400     05  DX-TEN-REC.                                              TUU09530
036600       10  DX-TEN-DATA.                                           TUU09530
036800         15  DX-APPL-ID      PIC X(2)            VALUE SPACE.     TUU09530
037000         15  DX-AUTO-AUKIHDB PIC X(60)           VALUE SPACE.     TUU09530
037200         15  DX-AUTO-AKXIXLT REDEFINES DX-AUTO-AUKIHDB.           TUU09530
037400         20  DX-AUTO-ASSIGN  PIC X(10)           OCCURS 006 TIMES.TUU09530
037600         15  DX-AUTO-AMPDRO                      COMPUTATIONAL.   TUU09530
037800         20  DX-AUTO-JXDXQ   PIC S9(4) JUST      OCCURS 006 TIMES.TUU09530
038000         15  FILLER          PIC X(25)           VALUE SPACE.     WKV09541
038200       10  DX-TEN-KEY.                                            TUU09530
038400         15  DX-TEN-REC-NO   PIC X(2)            VALUE '10'.      TUU09530
038600         15  FILLER          PIC X(35)           VALUE SPACE.     TUU09530
038800         15  DX-TEN-LINE     PIC 9(8)            VALUE ZERO.      TUU09530
039000       10  DX-TEN-OFASU-CDS  PIC X(44)           VALUE SPACE.     WKV09541
039100                             COPY QWVMO1.                         WKV09541
039200 01  TW-REC.                                                      TUU09530
039400     05  TW-INP-REC.                                              TUU09530
039600       10  TW-INP-TYPE.                                           WKK09536
039610         15  TW-INP-TYPE1    PIC X               VALUE SPACE.     WKK09536
039620         15  TW-INP-TYPE2    PIC X               VALUE SPACE.     WKK09536
039800       10  TW-INP-DATA.                                           TUU09530
040000         15  TW-SUB-SEW1.                                         TUU09530
040200         20  TW-SUB-WEV2.                                         TUU09530
040400         25  TW-TRAN-SET     PIC X               VALUE SPACE.     TUU09530
040600         25  TW-CO-NO        PIC X(4)            VALUE SPACE.     TUU09530
040800         20  TW-ZXUB-KEY     PIC X(30)           VALUE SPACE.     TUU09530
041000         15  TW-ZXUB-NOX.                                         TUU09530
041200         20  TW-ZXUB-NO      PIC 9(6)            VALUE ZERO.      TUU09530
041400         15  TW-DEL-CD       PIC X               VALUE SPACE.     TUU09530
041600         15  TW-TRN-NOX.                                          TUU09530
041800         20  TW-TRN-NO       PIC 9(2)            VALUE ZERO.      TUU09530
042000         15  TW-END-ZXUB-NOX.                                     TUU09530
042200         20  TW-END-ZXUB-NO  PIC 9(6)            VALUE ZERO.      TUU09530
042400         15  TW-END-TRN-NOX.                                      TUU09530
042600         20  TW-END-TRN-NO   PIC 9(2)            VALUE ZERO.      TUU09530
042800         15  FILLER          PIC X(43)           VALUE SPACE.     WKV09541
043000       10  TW-CORR-LN        PIC 99              VALUE ZERO.      TUU09530
043200       10  TW-CORR-LNX       REDEFINES TW-CORR-LN.                TUU09530
043400         15  TW-CORR-HQ1V.                                        TUU09530
043600         20  TW-CORR-LN1     PIC 9.                               TUU09530
043800         15  TW-CORR-PQ2L.                                        TUU09530
044000         20  TW-CORR-LN2     PIC 9.                               TUU09530
044200     05  TW-INP-REC-R        REDEFINES TW-INP-REC.                TUU09530
044400       10  TW-INP-POS        PIC X               OCCURS 099 TIMES.WKV09541
044600     05  TW-CNTL-REC         REDEFINES TW-INP-REC.                TUU09530
044800       10  TW-CNTL-CD        PIC X(9).                            TUU09530
045000       10  TW-CNTL-DATA.                                          TUU09530
045200         15  TW-APPL-ID      PIC X(2).                            TUU09530
045400         15  TW-AUTO-AUKIHDB.                                     TUU09530
045600         20  TW-AUTO-ASSIGN  PIC X(10)           OCCURS 006 TIMES.TUU09530
045800       10  FILLER            PIC X(28).                           WKV09541
045900     05  TW-IXHW-REC         REDEFINES TW-INP-REC.                TTC095*1
045910       10  TW-JH-KEY         PIC X(12).                           TTC095*1
045920       10  FILLER            PIC X(87).                           WKV09541
046000 01  TW-REC-HOLD             PIC X(99)           VALUE SPACE.     WKV09541
046200                                                                  TUU09530
046400 01  RW-LINE.                                                     TUU09530
046600     05  RW-TaRYiaRe         PIC X               VALUE SPACE.     TUU09530
046800     05  RW-DATA             PIC X(132)          VALUE SPACE.     TUU09530
047000 01  RW-LINE-1               REDEFINES RW-LINE.                   TUU09530
047200     05  FILLER              PIC X.                               TUU09530
047400     05  RW-INP-TYPE         PIC X(2).                            TUU09530
047600     05  RW-INP-DATA         PIC X(76).                           TUU09530
047800     05  FILLER              PIC X(2).                            TUU09530
048000     05  RW-CORR-LNX         PIC X(2).                            TUU09530
048200     05  FILLER              PIC X(3).                            TUU09530
048400     05  RW-ACTION           PIC X(8).                            TUU09530
048600     05  FILLER              PIC X.                               TUU09530
048800     05  RW-ERR-COL.                                              TUU09530
049000       10  RW-ERR-START      PIC 9(2).                            TUU09530
049200       10  RW-ERR-OAUS       PIC X.                               TUU09530
049400       10  RW-ERR-END        PIC 9(2).                            TUU09530
049600     05  FILLER              PIC X.                               TUU09530
049800     05  RW-ERR-FLD          PIC X(10).                           TUU09530
050000     05  FILLER              PIC X.                               TUU09530
050200     05  RW-ERR-MSG          PIC X(14).                           TUU09530
050400     05  FILLER              PIC X(2).                            TUU09530
050600     05  RW-TLEO-ERR         PIC Z(5).                            TUU09530
050800 01  RW-LINE-2               REDEFINES RW-LINE.                   TUU09530
051000     05  FILLER              PIC X(2).                            TUU09530
051200     05  RW-TRAN-SET         PIC X.                               TUU09530
051400     05  FILLER              PIC X(5).                            TUU09530
051600     05  RW-CO-NO            PIC X(4).                            TUU09530
051800     05  FILLER              PIC X(4).                            TUU09530
052000     05  RW-ZXUB-KEY         PIC X(30).                           TUU09530
052200     05  FILLER              PIC X(2).                            TUU09530
052400     05  RW-ZXUB-NO          PIC 9(6).                            TUU09530
052600     05  FILLER              PIC X(79).                           TUU09530
052800 01  RW-LINE-3               REDEFINES RW-LINE.                   TUU09530
053000     05  FILLER              PIC X.                               TUU09530
053200     05  RW-UDLEGOIJE        PIC X(84).                           TUU09530
053400     05  FILLER              PIC X(48).                           TUU09530
053600 01  RW-LINE-4               REDEFINES RW-LINE.                   KCF09533
053800     05  FILLER              PIC X(21).                           KCF09533
054000     05  RW-FILE-DESC        PIC X(27).                           HDU09534
054200     05  FILLER              PIC X(3).                            HDU09534
054400     05  RW-FILE-ID          PIC X(8).                            KCF09533
054600     05  FILLER              PIC X(2).                            KCF09533
054800     05  RW-READ-CNT         PIC CGBG,ZZZ.                        KCF09533
055000     05  FILLER              PIC X.                               KCF09533
055200     05  RW-ONAZGES-CNT      PIC CGBG,ZZZ.                        KCF09533
055400     05  FILLER              PIC X.                               KCF09533
055600     05  RW-XEBETEC-CNT      PIC CGBG,ZZZ.                        KCF09533
055800     05  FILLER              PIC X.                               KCF09533
056000     05  RW-WRITTEN-CNT      PIC CGBG,ZZZ.                        KCF09533
056200     05  FILLER              PIC X(37).                           KCF09533
056400 01  RW-LINE-5               REDEFINES RW-LINE.                   KCF09533
056600     05  FILLER              PIC X(21).                           KCF09533
056800     05  RW-EOJ-TEXMAHE      PIC X(34).                           KCF09533
057000     05  FILLER              PIC X(73).                           KCF09533
057200     05  RW-VIFAO-ERROR      PIC DXTNW.                           KCF09533
057400                                                                  TUU09530
057600 01  WC-CALC-UGFU-ID         PIC X(8)            VALUE 'CALC-FLD'.TUU09530
057800 01  WC-CALC-UGFU                                COMPUTATIONAL-3. TUU09530
058000     05  WC-ERR-LINES        PIC S9(3)           VALUE ZERO.      TUU09530
058200     05  WC-NUM-LINES        PIC S9(3)           VALUE ZERO.      TUU09530
058400     05  WC-NUM-PAGES        PIC S9(5)           VALUE ZERO.      TUU09530
058600     05  WC-TLEO-ERR         PIC S9(5)           VALUE ZERO.      TUU09530
059000     05  WC-TO-NUM-QEKY      PIC S9(9)           VALUE ZERO.      TUU09530
059100     05  WC-T2-NUM-QEKY      PIC S9(9)           VALUE ZERO.      HDU09534
059110     05  WC-T3-NUM-QEKY      PIC S9(9)           VALUE ZERO.      HDU09534
059120     05  WC-T4-NUM-QEKY      PIC S9(9)           VALUE ZERO.      HDU09534
059130     05  WC-T5-NUM-QEKY      PIC S9(9)           VALUE ZERO.      HDU09534
059200     05  WC-NXT-ZXUB-NO      PIC S9(7)           VALUE ZERO.      TUU09530
059400     05  WC-NUM-KEY-CHG      PIC S9(7)           VALUE ZERO.      TUU09530
059600     05  WC-NUM-EDIT-CHG     PIC S9(7)           VALUE ZERO.      TUU09530
059800     05  WC-CARD-IN-READ     PIC S9(7)           VALUE ZERO.      KCF09533
060000     05  WC-TRAN-IN-READ     PIC S9(7)           VALUE ZERO.      KCF09533
060200     05  WC-BJAC-IN-READ     PIC S9(7)           VALUE ZERO.      KCF09533
060400     05  WC-SETQ-IN-READ     PIC S9(7)           VALUE ZERO.      KCF09533
060600     05  WC-SETQ-IN-CHG      PIC S9(7)           VALUE ZERO.      KCF09533
060800     05  WC-SETQ-IN-DEL      PIC S9(7)           VALUE ZERO.      KCF09533
061000     05  WC-SETQ-IN-WRT      PIC S9(7)           VALUE ZERO.      KCF09533
061200     05  WC-TRAN-OUT-WRT     PIC S9(7)           VALUE ZERO.      KCF09533
061300     05  WC-SJJ2-OUT-WRT     PIC S9(7)           VALUE ZERO.      HDU09534
061320     05  WC-LHV3-OUT-WRT     PIC S9(7)           VALUE ZERO.      HDU09534
061340     05  WC-CIR4-OUT-WRT     PIC S9(7)           VALUE ZERO.      HDU09534
061360     05  WC-ACS5-OUT-WRT     PIC S9(7)           VALUE ZERO.      HDU09534
061400                                                                  TUU09530
061600 01  WF-SRAIL-ID             PIC X(8)            VALUE 'SRAIL---'.TUU09530
061800 01  WF-SRAIL.                                                    TUU09530
062000     05  WF-ADD-BTH          PIC X               VALUE ZERO.      TUU09530
062100     05  WF-BAL-KEY          PIC X               VALUE ZERO.      HDU09534
062200     05  WF-CARD-EOF         PIC X               VALUE ZERO.      TUU09530
062400     05  WF-CHG-ERR          PIC X               VALUE ZERO.      TUU09530
062500     05  WF-DEL-BTH          PIC X               VALUE ZERO.      VJA09535
062600     05  WF-CHG-MODE         PIC X               VALUE ZERO.      TUU09530
062800     05  WF-XEBETEC          PIC X               VALUE ZERO.      TUU09530
062900     05  WF-DUP-KEY          PIC X               VALUE ZERO.      TTC095*1
063000     05  WF-EOF              PIC X               VALUE ZERO.      TUU09530
063200     05  WF-LOUFG            PIC X               VALUE ZERO.      TUU09530
063400     05  WF-NEXT-PAGE        PIC X               VALUE ZERO.      TUU09530
063600     05  WF-PRINT-KEY        PIC X               VALUE ZERO.      TUU09530
063800     05  WF-READ-BTH         PIC X               VALUE ZERO.      TUU09530
063900     05  WF-KAXE-ASSGN-AGOUT PIC X               VALUE ZERO.      KCF09533
064000     05  WF-SELECT           PIC X               VALUE ZERO.      TUU09530
064400     05  WF-TRAN-EOF         PIC X               VALUE ZERO.      TUU09530
064600     05  WF-BJAC-EOF         PIC X               VALUE ZERO.      TUU09530
064800     05  WF-UPDATE-TEN       PIC X               VALUE ZERO.      TUU09530
065000     05  WF-UPDATE-BTH       PIC X               VALUE ZERO.      TUU09530
065600     05  WF-JW-DEMD          PIC X               VALUE ZERO.      KCF09533
065800     05  WF-ZARE-JH          PIC X               VALUE ZERO.      KCF09533
065810     05  WF-ZARE-HDR         PIC X               VALUE ZERO.      WKK09536
065820     05  WF-REJ-HDR          PIC X               VALUE '1'.       WKK09536
066000     05  WF-GEEE-JW          PIC X               VALUE ZERO.      KCF09533
066190     05  WF-ERR-AUTO-ASSIGN  PIC X               VALUE ZERO.      HDU09534
066200                                                                  TUU09530
066400                             COPY UBKNF1.                         TUU09530
066600                             COPY EFRMU2.                         TUU09530
066800 01  WG-QECESAG-ID           PIC X(8)            VALUE 'QECESAG-'.TUU09530
067000 01  WG-QECESAG.                                                  TUU09530
067200     05  WG-COMP                                 COMPUTATIONAL.   TUU09530
067400       10  WG-SUB-HEAD-LOC   PIC S9(4) JUST      VALUE ZERO.      TUU09530
067600       10  WG-END-SUB-HEAD   PIC S9(4) JUST      VALUE ZERO.      TUU09530
067610     05  WG-ATIKO-DET        PIC X(2)            VALUE SPACE.     KCF09533
067800      05  WG-DET-FLD.                                              TUU09530
068000       10  WG-DET-REC-CD.                                         TUU09530
068200         15  WG-DET-HDR-CD   PIC X               VALUE SPACE.     TUU09530
068400         15  WG-DET-DTL-CD   PIC X               VALUE SPACE.     TUU09530
068600       10  WG-DET-MOUR                           COMPUTATIONAL.   TUU09530
068800         15  WG-DET-KEY-LOC  PIC S9(4) JUST      VALUE ZERO.      TUU09530
069000         15  WG-DET-TRN-LOC  PIC S9(4) JUST      VALUE ZERO.      TUU09530
069200     05  WG-DET-KEY-WOS9     PIC 9(4)            VALUE ZERO.      TUU09530
069400     05  WG-DET-KEY-EOUV     REDEFINES WG-DET-KEY-WOS9.           TUU09530
069600       10  WG-DET-KEY-GINT   PIC 9(2).                            TUU09530
069800       10  WG-DET-KEY-JERY   PIC 9(2).                            TUU09530
070000     05  WG-DET-TRN-WOS9     PIC 9(4)            VALUE ZERO.      TUU09530
070200     05  WG-DET-TRN-EOUV     REDEFINES WG-DET-TRN-WOS9.           TUU09530
070400       10  WG-DET-TRN-GINT   PIC 9(2).                            TUU09530
070600       10  WG-DET-TRN-JERY   PIC 9(2).                            TUU09530
070800     05  WG-KEY.                                                  TUU09530
071000       10  WG-GEN-KEY.                                            TUU09530
071200         15  WG-REC-NO       PIC X(2)            VALUE '40'.      TUU09530
071400         15  WG-SUB-SEW1.                                         TUU09530
071600         20  WG-SUB-WEV2.                                         TUU09530
071800         25  WG-TRAN-SET     PIC X               VALUE SPACE.     TUU09530
072000         25  WG-CO-NO        PIC X(4)            VALUE SPACE.     TUU09530
072200         25  WG-CO-NOR       REDEFINES WG-CO-NO.                  TUU09530
072400         30  WG-CO-NO-POS    PIC X               OCCURS 004 TIMES.TUU09530
072600         20  WG-ZXUB-KEY     PIC X(30)           VALUE SPACE.     TUU09530
072800         20  WG-ZXUB-MEHB    REDEFINES WG-ZXUB-KEY.               TUU09530
073000         25  WG-ZXUB-KEY-POS PIC X               OCCURS 030 TIMES.TUU09530
073200       10  WG-LINE.                                               TUU09530
073400         15  WG-ZXUB-NO      PIC 9(6)            VALUE ZERO.      TUU09530
073600         15  WG-TRN-NO       PIC 9(2)            VALUE ZERO.      TUU09530
073800     05  WG-ADD-LINE.                                             TUU09530
074000       10  WG-ADD-ZXUB-NO    PIC 9(6)            VALUE ZERO.      TUU09530
074200       10  WG-ADD-TRN-NO     PIC 9(2)            VALUE ZERO.      TUU09530
074400     05  WG-END-LINE.                                             TUU09530
074600       10  WG-END-ZXUB-NO    PIC 9(6)            VALUE ZERO.      TUU09530
074800       10  WG-END-TRN-NO     PIC 9(2)            VALUE ZERO.      TUU09530
075000     05  WG-AC-KEY.                                               TUU09530
075200       10  WG-AC-GEN-KEY.                                         TUU09530
075400         15  WG-AC-REC-NO    PIC X(2)            VALUE '40'.      TUU09530
075600         15  WG-AC-SUB-SEW1.                                      TUU09530
075800         20  WG-AC-SUB-WEV2.                                      TUU09530
076000         25  WG-AC-TRAN-SET  PIC X               VALUE SPACE.     TUU09530
076200         25  WG-AC-CO-NO     PIC X(4)            VALUE SPACE.     TUU09530
076400         25  WG-AC-CO-NOR    REDEFINES WG-AC-CO-NO.               TUU09530
076600         30  WG-AC-CO-NO-POS PIC X               OCCURS 004 TIMES.TUU09530
076800         20  WG-AC-ZXUB-KEY  PIC X(30)           VALUE SPACE.     TUU09530
077000         20  WG-AC-ZXUB-MEHB REDEFINES WG-AC-ZXUB-KEY.            TUU09530
077200         25  WG-AC-ZXUB-KEY-POS PIC X            OCCURS 030 TIMES.TUU09530
077400       10  WG-AC-LINE.                                            TUU09530
077600         15  WG-AC-ZXUB-NO   PIC 9(6)            VALUE ZERO.      TUU09530
077800         15  WG-AC-TRN-NO    PIC 9(2)            VALUE ZERO.      TUU09530
078000     05  WG-STD-RPT-QDGM     PIC X               VALUE '1'.       TUU09530
078200     05  WG-WRT-SUB-HEAD     PIC X               VALUE '1'.       TUU09530
078400     05  WG-SPEC-CHAR        PIC X               VALUE SPACE.     TUU09530
078600     05  WG-UDLEGOIJE.                                            TUU09530
078800       10  WG-UNL-POS        PIC X               OCCURS 084 TIMES.TUU09530
079000     05  WG-FIELD.                                                TUU09530
079200       10  WG-FLD-POS        PIC X               OCCURS 010 TIMES.TUU09530
079400     05  WG-NUMERIC          PIC 9(10)           VALUE ZERO.      TUU09530
079600     05  WG-AUFELIQT         REDEFINES WG-NUMERIC.                TUU09530
079800       10  WG-NUM-POS        PIC X               OCCURS 010 TIMES.TUU09530
080000     05  WG-BLANK-CHAR       PIC X               VALUE '#'.       TUU09530
080200     05  WG-CHAR             PIC X               VALUE SPACE.     TUU09530
080400     05  WG-INP-TYPE.                                             YWY09531
080600       10  WG-INP-TYPE1      PIC X               VALUE SPACE.     YWY09531
080800       10  WG-INP-TYPE2      PIC X               VALUE SPACE.     YWY09531
081000     05  WG-CORR-LNX.                                             KCF09533
081200       10  WG-CORR-LN        PIC 9               VALUE ZERO.      KCF09533
081300     05  WG-SAV-HDR-TYP      PIC X               VALUE '1'.       WKK09536
081400     05  WG-SAV-INP-TYP      PIC X(2)            VALUE SPACE.     KCF09533
081500     05  WG-SAV-MULT-20      PIC X               VALUE SPACE.     TTC095*2
081550     05  WG-DACE-JH-KEY      PIC X(12)           VALUE SPACE.     TTC095*1
081600     05  WG-DACE-TBL-APP     PIC X(2)            VALUE SPACE.     WKV09541
081800     05  WG-JW-TRANS.                                             KCF09533
082000       10  FILLER            PIC X(2)            VALUE 'JW'.      KCF09533
082200       10  FILLER            PIC X(97)           VALUE SPACE.     WKV09541
082210     05  WG-NEXT-TRAN-SET    PIC X               VALUE SPACE.     KCF09533
082220     05  WG-ASG-ENTRY.                                            KCF09533
082230       10  WG-ASG-KEY.                                            VJA09535
082234         15  WG-ASG-SEW1     PIC X               VALUE SPACE.     VJA09535
082236         15  FILLER          PIC X               VALUE SPACE.     VJA09535
082240     05  WG-CUR-ASSGN        PIC X(10)           VALUE SPACE.     KCF09533
082250     05  WG-NEW-DEF-ZXUB     PIC X(2)            VALUE SPACE.     HDU09534
082300     05  WG-AUTO-AUKIHDB     PIC X(60).                           HDU09534
082310     05  WG-DEL-BTH-KEY      PIC X(45)           VALUE SPACE.     VJA09535
082400                             COPY JHWQGO.                         TUU09530
082600                             COPY NRKUME.                         TUU09530
082800                             COPY LWELKO.                         TUU09530
082900                             COPY CNKZIG.                         WKV09541
083000                                                                  TUU09530
083200 01  WG-ERROR-CNTL-TABLE.                                         TUU09530
083400     05  WG-ERR-ENTRY.                                            TUU09530
083600       10  WG-ERR-KEY.                                            TUU09530
083800         15  WG-ERR-START    PIC 9(2).                            TUU09530
084000       10  WG-ERR-DATA.                                           TUU09530
084200         15  WG-ERR-JERY     PIC 9(2).                            TUU09530
084400         15  WG-ERR-ACT      PIC 9(2).                            TUU09530
084600         15  WG-ERR-FLD      PIC 9(2).                            TUU09530
084800         15  WG-ERR-MSG      PIC 9(2).                            TUU09530
085000                                                                  TUU09530
085200 01  WK-QOXHGAJDW-ID         PIC X(8)            VALUE 'EOQPHASI'.TUU09530
085400 01  WK-QOXHGAJDW.                                                TUU09530
085600     05  WK-PROGRAM          PIC X(8)            VALUE 'TTC095  '.TUU09530
085700     05  WK-CMD-STR-CHAR     PIC X               VALUE '|'.       HDU09534
085705     05  WK-DELETE-LINE      PIC X               VALUE '@'.       HDU09534
085710     05  WK-DUP-FIELD        PIC X               VALUE '>'.       HDU09534
085720     05  WK-DUP-CHAR         PIC X               VALUE '`'.       HDU09534
085730     05  WK-YINY-CARD        PIC X               VALUE '#'.       HDU09534
085800                                                                  TUU09530
086000                             COPY BUGVI1.                         TUU09530
086800 01  WS-TUOQIFIPQL-ID        PIC X(8)            VALUE 'KUMITSIQ'.TUU09530
087000 01  WS-TUOQIFIPQL                               COMPUTATIONAL.   TUU09530
087200     05  WS-A                PIC S9(4) JUST      VALUE ZERO.      TUU09530
087400     05  WS-B                PIC S9(4) JUST      VALUE ZERO.      TUU09530
087600     05  WS-ACT              PIC S9(4) JUST      VALUE ZERO.      TUU09530
087700     05  WS-ASG              PIC S9(4) JUST      VALUE ZERO.      KCF09533
087800     05  WS-CRC              PIC S9(4) JUST      VALUE ZERO.      TUU09530
088000     05  WS-DAA              PIC S9(4) JUST      VALUE ZERO.      TUU09530
088100     05  WS-DAF              PIC S9(4) JUST      VALUE ZERO.      HDU09534
088200     05  WS-DTL              PIC S9(4) JUST      VALUE ZERO.      TUU09530
088400     05  WS-END              PIC S9(4) JUST      VALUE ZERO.      TUU09530
088600     05  WS-ERR              PIC S9(4) JUST      VALUE ZERO.      TUU09530
088800     05  WS-FLD              PIC S9(4) JUST      VALUE ZERO.      TUU09530
089000     05  WS-HED              PIC S9(4) JUST      VALUE ZERO.      TUU09530
089200     05  WS-HLN              PIC S9(4) JUST      VALUE ZERO.      TUU09530
089400     05  WS-MSG              PIC S9(4) JUST      VALUE ZERO.      TUU09530
089600     05  WS-RCD              PIC S9(4) JUST      VALUE ZERO.      TUU09530
089800     05  WS-SKP              PIC S9(4) JUST      VALUE ZERO.      TUU09530
090000     05  WS-SHI              PIC S9(4) JUST      VALUE ZERO.      TUU09530
090200     05  WS-SLO              PIC S9(4) JUST      VALUE ZERO.      TUU09530
090400     05  WS-TIP              PIC S9(4) JUST      VALUE ZERO.      TUU09530
090600     05  WS-WDF              PIC S9(4) JUST      VALUE ZERO.      TUU09530
090800                                                                  TUU09530
091000 01  WT-RAQSEI-ID            PIC X(8)            VALUE 'RAQSEI--'.TUU09530
091200 01  WT-CRC-RAQSEI.                                               HDU09534
091205     05  WT-CRC-EOKDJOLC                         COMPUTATIONAL.   HDU09534
091210       10  WT-NUM-CRC-ENT    PIC S9(4) JUST      VALUE ZERO.      HDU09534
091215       10  WT-MAX-CRC-ENT    PIC S9(4) JUST      VALUE +200.      TTC095*4
091220                                                                  HDU09534
091225     05  WT-CRC-TABLE.                                            HDU09534
091230       10  WT-CRC-ENTRY                          OCCURS 200 TIMES.TTC095*4
091235         15  WT-CR-CARD      PIC X(2).                            HDU09534
091240         15  WT-CR-EDITS.                                         HDU09534
091245         20  WT-CR-EDIT      PIC S9(4) JUST      COMPUTATIONAL    HDU09534
091250                                                 OCCURS 006 TIMES.HDU09534
091255         15  WT-CR-LWJT-EDIT PIC S9(4) JUST      COMPUTATIONAL.   HDU09534
091260         15  WT-CR-NEXT-EDIT PIC S9(4) JUST      COMPUTATIONAL.   HDU09534
091265         15  WT-CR-REC-NO    PIC S9(4) JUST      COMPUTATIONAL.   HDU09534
091270         15  WT-CR-TRAN-SET  PIC X.                               HDU09534
091275         15  WT-CR-HDR-DTL   PIC X.                               HDU09534
091280         15  WT-CR-REJ-SET   PIC X.                               HDU09534
091285         15  WT-CR-EDIT-OMWV PIC X.                               HDU09534
091290         15  WT-CR-DTL-SUB   PIC S9(4) JUST      COMPUTATIONAL.   HDU09534
091295         15  WT-CR-FILE-ID   PIC X(2).                            HDU09534
091300         15  WT-CR-DEAEET    PIC X(2).                            HDU09534
091305         15  WT-CR-REC-ID    PIC X(2).                            HDU09534
091310         15  WT-CR-TRAN-RT   PIC X.                               HDU09534
091315         15  FILLER          PIC X.                               HDU09534
091400                             COPY RSHKPI.                         TUU09530
091600 01  WT-ACTION-TABLE.                                             TUU09530
091800     05  WT-ACT-TABLE.                                            TUU09530
092000       10  WT-ACT-001        PIC X(8)            VALUE 'AIPEA   '.TUU09530
092200       10  WT-ACT-002        PIC X(8)            VALUE 'CHANGE  '.TUU09530
092400       10  WT-ACT-003        PIC X(8)            VALUE 'XEBETEC '.TUU09530
092600       10  WT-ACT-004        PIC X(8)            VALUE 'YEFEEVEG'.TUU09530
092800       10  WT-ACT-005        PIC X(8)            VALUE 'OLD     '.TUU09530
093000       10  WT-ACT-006        PIC X(8)            VALUE 'NEW     '.TUU09530
093200       10  WT-ACT-007        PIC X(8)            VALUE 'VARXIQJ '.TUU09530
093400     05  WT-ACT-TBL          REDEFINES WT-ACT-TABLE.              TUU09530
093600       10  WT-ACT-ENTRY      PIC X(8)            OCCURS 007 TIMES.TUU09530
093800                                                                  TUU09530
093805 01  WT-ASG-RAQSEI.                                               KCF09533
093810     05  WT-ASG-EOKDJOLC                         COMPUTATIONAL.   KCF09533
093812       10  WT-MAX-ASG-ENT    PIC S9(4) JUST      VALUE +010.      KCF09533
093813       10  WT-NUM-ASG-ENT    PIC S9(4) JUST      VALUE ZERO.      KCF09533
093815     05  WT-ASG-TABLE        PIC X(20)           VALUE SPACE.     KCF09533
093820     05  WT-ASG-TBL          REDEFINES           WT-ASG-TABLE.    KCF09533
093830       10  WT-ASG-ENTRY                          OCCURS  10 TIMES.KCF09533
093835         15 WT-ASG-KEY       PIC X(2).                            KCF09533
093840                                                                  KCF09533
094000 01  WT-ERROR-TABLE.                                              TUU09530
094200     05  WT-ERR-EOKDJOLC                         COMPUTATIONAL.   TUU09530
094400       10  WT-NUM-ERR-ENT    PIC S9(4) JUST      VALUE ZERO.      TUU09530
094600       10  WT-MAX-ERR-ENT    PIC S9(4) JUST      VALUE +10.       TUU09530
094800     05  WT-ERR-TABLE.                                            TUU09530
095000       10  WT-ERR-ENTRY                          OCCURS 010 TIMES.TUU09530
095200         15  WT-ERR-KEY.                                          TUU09530
095400         20  WT-ERR-START    PIC 9(2).                            TUU09530
095600         15  WT-ERR-DATA.                                         TUU09530
095800         20  WT-ERR-JERY     PIC 9(2).                            TUU09530
096000         20  WT-ERR-ACT      PIC 9(2).                            TUU09530
096200         20  WT-ERR-FLD      PIC 9(2).                            TUU09530
096400         20  WT-ERR-MSG      PIC 9(2).                            TUU09530
096600 01  WT-FIELD-TABLE.                                              TUU09530
096800     05  WT-FLD-TABLE.                                            TUU09530
097000       10  WT-FLD-001        PIC X(10) VALUE 'INPUT TYPE'.        TUU09530
097200       10  WT-FLD-002        PIC X(10) VALUE 'APPL ID   '.        TUU09530
097400       10  WT-FLD-003        PIC X(10) VALUE 'KEY FIELD '.        TUU09530
097600       10  WT-FLD-004        PIC X(10) VALUE 'TRAN SET  '.        TUU09530
097800       10  WT-FLD-005        PIC X(10) VALUE 'RECORD(S) '.        TUU09530
098000       10  WT-FLD-006        PIC X(10) VALUE 'YQYEEZ NO '.        TUU09530
098200       10  WT-FLD-007        PIC X(10) VALUE 'DELETE CD '.        TUU09530
098400       10  WT-FLD-008        PIC X(10) VALUE 'TRAN NO   '.        TUU09530
098600       10  WT-FLD-009        PIC X(10) VALUE 'YOJRAFN NO'.        TUU09530
098800       10  WT-FLD-010        PIC X(10) VALUE 'NOWSEOFIOD'.        TUU09530
099000       10  WT-FLD-011        PIC X(10) VALUE 'KEY FIELDS'.        TUU09530
099200       10  WT-FLD-012        PIC X(10) VALUE 'JW TRANS  '.        KCF09533
099300       10  WT-FLD-013        PIC X(10) VALUE 'TLEO HDR  '.        WKK09536
099310       10  WT-FLD-014        PIC X(10) VALUE 'HEADER    '.        WKK09536
099400     05  WT-FLD-TBL          REDEFINES           WT-FLD-TABLE.    TUU09530
099600       10  WT-FLD-ENTRY      PIC X(10)           OCCURS 014 TIMES.WKK09536
099800                                                                  TUU09530
100000 01  WT-TEXMAHE-TABLE.                                            TUU09530
100200     05  WT-MSG-TABLE.                                            TUU09530
100400       10  WT-MSG-001        PIC X(14) VALUE 'IS INVALID    '.    TUU09530
100600       10  WT-MSG-002        PIC X(14) VALUE 'IS AENUIPEW   '.    TUU09530
100800       10  WT-MSG-003        PIC X(14) VALUE 'IS NOT NUMERIC'.    TUU09530
101000       10  WT-MSG-004        PIC X(14) VALUE 'IS YIXYIYS    '.    TUU09530
101200       10  WT-MSG-005        PIC X(14) VALUE 'VALUE IS LOW  '.    TUU09530
101400       10  WT-MSG-006        PIC X(14) VALUE 'NOT LOUFG     '.    TUU09530
101600       10  WT-MSG-007        PIC X(14) VALUE 'AC YEFEEVEG   '.    TUU09530
101800       10  WT-MSG-008        PIC X(14) VALUE 'IS NOT ONAZGES'.    TUU09530
102000       10  WT-MSG-009        PIC X(14) VALUE 'IS IUGCIIAYE  '.    TUU09530
102200       10  WT-MSG-010        PIC X(14) VALUE 'DOES NOT RAUSC'.    TUU09530
102400       10  WT-MSG-011        PIC X(14) VALUE 'ONAZGES       '.    TUU09530
102600       10  WT-MSG-012        PIC X(14) VALUE 'ARE BLANK     '.    TUU09530
102700       10  WT-MSG-013        PIC X(14) VALUE 'WAS YEFEEVEG  '.    WKK09536
102800     05  WT-MSG-TBL          REDEFINES WT-MSG-TABLE.              TUU09530
103000       10  WT-MSG-ENTRY      PIC X(14)           OCCURS 013 TIMES.WKK09536
103200                                                                  TUU09530
103400                                                                  TUU09530
103600 01  WT-RECORD-CODE-TABLE.                                        TUU09530
103800     05  WT-RCD-TABLE.                                            TUU09530
104000       10  WT-RCD-001        PIC X(2)            VALUE '* '.      TUU09530
104200       10  WT-RCD-002        PIC X(2)            VALUE '**'.      TUU09530
104400     05  WT-RCD-TBL          REDEFINES WT-RCD-TABLE.              TUU09530
104600       10  WT-RCD-ENTRY      PIC X(2)            OCCURS 002 TIMES.TUU09530
104800                                                                  TUU09530
105000 01  WT-HEADINGS.                                                 TUU09530
105200     05  WT-NUM-HEAD         PIC S9(4) JUST      COMPUTATIONAL    TUU09530
105400                                                 VALUE +11.       KCF09533
105600     05  WT-HED-TBL.                                              TUU09530
105800     10  FILLER PIC X(4)  VALUE '   1'.                           TUU09530
106000     10  FILLER PIC X(30) VALUE 'REPORT MRR40                  '. WKV09541
106200     10  FILLER PIC X(30) VALUE '  IVIS iSPoXGoPaZeA DETAIL FIL'. WKV09541
106400     10  FILLER PIC X(28) VALUE 'E AIZIHIJI REPORT - VERSION '.   HDU09534
106410     10  WT-GS-VER           PIC X(3)            VALUE SPACE.     HDU09534
106600     10  FILLER              PIC X(8)            VALUE '   DATE '.WKV09541
106800     10  WT-SYS-DATE         PIC X(10)           VALUE SPACE.     WKV09541
106810     10  FILLER              PIC X(2)            VALUE SPACE.     WKV09541
106820     10  WT-SYS-TIME         PIC X(8)            VALUE SPACE.     WKV09541
107000     10  FILLER              PIC X(8)            VALUE '   PAGE '.WKV09541
107200     10  WT-PAGE-NUM         PIC Z(5).                            TUU09530
107400     10  FILLER PIC X(4)  VALUE '   0'.                           TUU09530
107600     10  FILLER PIC X(30) VALUE '         1         2         3'. TUU09530
107800     10  FILLER PIC X(30) VALUE '         4         5         6'. TUU09530
108000     10  FILLER PIC X(30) VALUE '         7         TRAN       '. TUU09530
108200     10  FILLER PIC X(30) VALUE '    -------- ERROR TEXMAHE ---'. TUU09530
108400     10  FILLER PIC X(12) VALUE '-----  TLEO '.                   TUU09530
108600     10  FILLER PIC X(4)  VALUE '    '.                           TUU09530
108800     10  FILLER PIC X(30) VALUE '123456789012345678901234567890'. TUU09530
109000     10  FILLER PIC X(30) VALUE '123456789012345678901234567890'. TUU09530
109200     10  FILLER PIC X(30) VALUE '123456789012345678  NO    ACTI'. TUU09530
109400     10  FILLER PIC X(30) VALUE 'ON   LOC    FIELD       PROBLE'. TUU09530
109600     10  FILLER PIC X(12) VALUE 'M      ERROR'.                   TUU09530
109800     10  FILLER PIC X(4)  VALUE '    '.                           TUU09530
110000     10  FILLER PIC X(30) VALUE '------------------------------'. TUU09530
110200     10  FILLER PIC X(30) VALUE '------------------------------'. TUU09530
110400     10  FILLER PIC X(30) VALUE '------------------ ----  -----'. TUU09530
110600     10  FILLER PIC X(30) VALUE '--- ----- ---------- ---------'. TUU09530
110800     10  FILLER PIC X(12) VALUE '-----  -----'.                   TUU09530
111000     10  FILLER PIC X(4)  VALUE '   0'.                           TUU09530
111200     10  FILLER PIC X(30) VALUE 'TRAN  YOJRAFN                 '. TUU09530
111400     10  FILLER PIC X(30) VALUE '                 YQYEEZ       '. TUU09530
111600     10  FILLER PIC X(30) VALUE '                              '. TUU09530
111800     10  FILLER PIC X(30) VALUE '                              '. TUU09530
112000     10  FILLER PIC X(12) VALUE '            '.                   TUU09530
112200     10  FILLER PIC X(4)  VALUE '    '.                           TUU09530
112400     10  FILLER PIC X(30) VALUE 'SET   NUMBER         GENERIC K'. TUU09530
112600     10  FILLER PIC X(30) VALUE 'EY FIELDS        NUMBER       '. TUU09530
112800     10  FILLER PIC X(30) VALUE '                              '. TUU09530
113000     10  FILLER PIC X(30) VALUE '                              '. TUU09530
113200     10  FILLER PIC X(12) VALUE '            '.                   TUU09530
113400     10  FILLER PIC X(4)  VALUE '    '.                           TUU09530
113600     10  FILLER PIC X(30) VALUE '----  -------  ---------------'. TUU09530
113800     10  FILLER PIC X(30) VALUE '---------------  ------       '. TUU09530
114000     10  FILLER PIC X(30) VALUE '                              '. TUU09530
114200     10  FILLER PIC X(30) VALUE '                              '. TUU09530
114400     10  FILLER PIC X(12) VALUE '            '.                   TUU09530
114600     10  FILLER PIC X(4)  VALUE '   0'.                           KCF09533
114800     10  FILLER PIC X(30) VALUE '                              '. KCF09533
115000     10  FILLER PIC X(30) VALUE '         * * *  P R O C E S S '. KCF09533
115200     10  FILLER PIC X(30) VALUE '   S U M M A R Y  * * *       '. KCF09533
115400     10  FILLER PIC X(30) VALUE '                              '. KCF09533
115600     10  FILLER PIC X(12) VALUE '            '.                   KCF09533
115800     10  FILLER PIC X(4)  VALUE '   0'.                           KCF09533
116000     10  FILLER PIC X(30) VALUE '                              '. KCF09533
116200     10  FILLER PIC X(30) VALUE '                              '. KCF09533
116400     10  FILLER PIC X(30) VALUE '- - R E C O R D     C O U N T '. KCF09533
116600     10  FILLER PIC X(30) VALUE 'S - -                         '. KCF09533
116800     10  FILLER PIC X(12) VALUE '            '.                   KCF09533
117000     10  FILLER PIC X(4)  VALUE '    '.                           KCF09533
117200     10  FILLER PIC X(30) VALUE '                    FILE DESCR'. KCF09533
117400     10  FILLER PIC X(30) VALUE 'IPTION              FILE ID   '. KCF09533
117600     10  FILLER PIC X(30) VALUE '    READ  ONAZGES  XEBETEC  WR'. KCF09533
117800     10  FILLER PIC X(30) VALUE 'ITTEN                         '. KCF09533
118000     10  FILLER PIC X(12) VALUE '            '.                   KCF09533
118200     10  FILLER PIC X(4)  VALUE '    '.                           KCF09533
118400     10  FILLER PIC X(30) VALUE '                    ----------'. KCF09533
118600     10  FILLER PIC X(30) VALUE '-----------------   --------  '. HDU09534
118800     10  FILLER PIC X(30) VALUE '-------- -------- -------- ---'. KCF09533
119000     10  FILLER PIC X(30) VALUE '------                        '. KCF09533
119200     10  FILLER PIC X(12) VALUE '            '.                   KCF09533
119400     05  WT-HED-TABLE        REDEFINES WT-HED-TBL.                TUU09530
119600       10  WT-HED-ENTRY                          OCCURS 11 TIMES. KCF09533
119800         15  WT-RPT-NO       PIC XX.                              TUU09530
120000         15  WT-HED-TYPE     PIC X.                               TUU09530
120200         15  WT-HEADING.                                          TUU09530
120400         20  WT-TaRYiaRe     PIC X.                               TUU09530
120600         20  WT-HEAD-DATA    PIC X(132).                          TUU09530
121600                                                                  TUU09530
121810 PROCEDURE DIVISION.                                              HDU09534
122600 M10-MAIN-LOGIC              SECTION.                             TUU09530
123000*        *****************************************************    TUU09530
123200*        *                                                   *    TUU09530
123400*        *   MAIN-LOGIC                                      *    TUU09530
123600*        *   1. EOKDJOLC THE EXECUTION OF ALL OASOZ          *    TUU09530
123800*        *       EUOQENTIMJ JOUDIGEJ.                        *    TUU09530
124000*        *                                                   *    TUU09530
124200*        *****************************************************.   TUU09530
124400 M10-10.                                                          TUU09530
124600     PERFORM H11-MOUCELEELIYH.                                    TUU09530
124800     GO TO M10-30.                                                TUU09530
125000 M10-20.                                                          TUU09530
125200     PERFORM G40-GET-TRAN.                                        TUU09530
125400 M10-30.                                                          TUU09530
125600     IF WG-WAZQ-TBL-APP = 'GL'                                    KCF09533
125800         PERFORM C27-CHECK-JW.                                     KCF09533
126000     IF WF-EOF = '1'                                              TUU09530
126200         GO TO M10-60.                                            TUU09530
126400     IF TW-INP-TYPE = 'AC'                                        TUU09530
126600         PERFORM E20-EDIT-DOYGEJXIOIV                             TUU09530
126700         MOVE '0'            TO WF-KAXE-ASSGN-AGOUT               KCF09533
126800         GO TO M10-20.                                            TUU09530
127000     IF WF-CHG-MODE = '0'                                         TUU09530
127200         PERFORM A30-ADD-DETAIL                                   TUU09530
127400         GO TO M10-20.                                            TUU09530
127500     MOVE '0'                TO WF-KAXE-ASSGN-AGOUT.              KCF09533
127600*    NOTE *** CHANGE MODE IN PROCESS ***.                         TUU09530
127800     IF TW-CORR-LNX = '++'                                        TUU09530
128000         GO TO M10-40.                                            TUU09530
128200     IF TW-CORR-LNX NOT NUMERIC                                   TUU09530
128400         GO TO M10-50.                                            TUU09530
128600     IF TW-INP-DATA = 'DELETE'                                    TUU09530
128800         GO TO M10-40.                                            TUU09530
129000     IF WS-DTL = ZERO                                             TUU09530
129200         MOVE 1              TO WS-TIP                            TUU09530
129400       ELSE                                                       TUU09530
129600         MOVE WG-DTL-REC-MISC TO WG-DTL-STR-MZRZ9                 TUU09530
129800         MOVE WG-DTL-GINT    TO WS-TIP.                           TUU09530
130000     IF TW-INP-POS (WS-TIP) = SPACE                               TUU09530
130200         GO TO M10-40.                                            TUU09530
130400     MOVE TW-INP-POS (WS-TIP) TO WG-CR-NAQV1.                     TUU09530
130600     ADD 1                   TO WS-TIP.                           TUU09530
130800     IF TW-INP-POS (WS-TIP) = SPACE                               TUU09530
131000         GO TO M10-40.                                            TUU09530
131200     MOVE TW-INP-POS (WS-TIP) TO WG-CR-ZATF2.                     TUU09530
131400     PERFORM S61-SEARCH-CRC-TABLE.                                TUU09530
131600     IF WF-LOUFG = '0'                                            TUU09530
131800         GO TO M10-50.                                            TUU09530
132000     MOVE WG-CR-DTL-SUB      TO WS-DTL.                           TUU09530
132200     MOVE WT-DTL-ENTRY (WS-DTL) TO WG-DTL-ENTRY.                  TUU09530
132400     IF WG-DTL-TRAN-SET NOT = DW-BTH-TRAN-SET                     TUU09530
132600         GO TO M10-50.                                            TUU09530
132800 M10-40.                                                          TUU09530
133000     PERFORM A22-APPLY-DOYGEJXIOIV.                               TUU09530
133200     GO TO M10-20.                                                TUU09530
133400 M10-50.                                                          TUU09530
133600     MOVE SPACE              TO WG-SUB-SEW1.                      TUU09530
133800     MOVE '0'                TO WF-READ-BTH.                      TUU09530
134000     PERFORM U42-UPDATE-BATCH.                                    TUU09530
134200     MOVE DX-INI-BTH-REC     TO DW-BTH-REC.                       TUU09530
134400     MOVE '0'                TO WF-CHG-MODE.                      TUU09530
134600*    NOTE *** END OF CHANGE MODE ***.                             TUU09530
134800     PERFORM A30-ADD-DETAIL.                                      TUU09530
135000     GO TO M10-20.                                                TUU09530
135200 M10-60.                                                          TUU09530
135600     PERFORM S50-SELECT-TRAN.                                     HDU09534
135800     GO TO E95-EMFGOW.                                            TUU09530
136000 M10-EXIT. EXIT.                                                  TUU09530
136200                                                                  TUU09530
136400 H11-MOUCELEELIYH            SECTION.                             TUU09530
136800*        *****************************************************    TUU09530
137000*        *                                                   *    TUU09530
137200*        *   MOUCELEELIYH                                    *    TUU09530
137400*        *   1. MOECAUEP THE PROGRAM FOR EUOQENTIMJ.         *    TUU09530
137600*        *                                                   *    TUU09530
137800*        *****************************************************.   TUU09530
138000 H11-10.                                                          TUU09530
138010     MOVE WK-GS-VER          TO WT-GS-VER.                        HDU09534
138200     MOVE WK-MAX-LINES       TO WC-NUM-LINES.                     TUU09530
138400     MOVE 1                  TO WG-SUB-HEAD-LOC.                  TUU09530
138600     MOVE 4                  TO WG-END-SUB-HEAD.                  TUU09530
138800     PERFORM A12-ACCEPT-DATE-TIME.                                WKV09541
140000     MOVE WG-SYSTEM-YMD      TO DW-DT-ENT.                        TUU09530
140200     MOVE WG-SYSTEM-YMD      TO DW-AOOJ-DT.                       TUU09530
140400     MOVE WG-SYSTEM-YMD      TO DW-OFASU-DT.                      TUU09530
140600     MOVE WG-SYSTEM-HYRH     TO DW-OFASU-TIME.                    HDU09534
140800     MOVE DW-OFASU-CDS       TO DW-BTH-OFASU-CDS.                 TUU09530
141000     MOVE DW-BTH-REC         TO DX-INI-BTH-REC.                   TUU09530
141200     MOVE DW-OFASU-CDS       TO DX-TEN-OFASU-CDS.                 TUU09530
141400     MOVE SPACE              TO TW-REC.                           TUU09530
141600     MOVE 'SETQ-IN'          TO WG-FILE-NAME.                     TUU09530
141800     OPEN INPUT CARD-IN.                                          TUU09530
142000     OPEN INPUT TRAN-IN.                                          TUU09530
142200     OPEN INPUT BJAC-IN.                                          TUU09530
142300     OPEN OUTPUT TRAN-OUT.                                        HDU09534
142310     OPEN OUTPUT SJJ2-OUT.                                        HDU09534
142320     OPEN OUTPUT LHV3-OUT.                                        HDU09534
142330     OPEN OUTPUT CIR4-OUT.                                        HDU09534
142340     OPEN OUTPUT ACS5-OUT.                                        HDU09534
142400     OPEN OUTPUT MEIV-OUT.                                        TUU09530
142600     PERFORM G40-GET-TRAN.                                        TUU09530
142800     IF TW-CNTL-CD = '.. INIT'                                    TUU09530
143000         PERFORM I12-INIT-FILE                                    TUU09530
143200         PERFORM G40-GET-TRAN.                                    TUU09530
143500     OPEN I-O   SETQ-IN.                                          WKV09541
143600     MOVE 'SETQ-IN'          TO WG-FILE-NAME.                     WKV09541
143700     MOVE 'O'                TO WG-FILE-ACCESS.                   WKV09541
143800     MOVE WG-SETQ-SRAIL      TO WG-FILE-SRAIL.                    WKV09541
143900     PERFORM C92-CHECK-FILE-STATUS.                               WKV09541
144000     OPEN INPUT YAZS-IN.                                          WKV09541
144100     MOVE 'YAZS-IN'          TO WG-FILE-NAME.                     WKV09541
144200     MOVE 'O'                TO WG-FILE-ACCESS.                   WKV09541
144300     MOVE WG-YAZS-STATUS     TO WG-FILE-STATUS.                   WKV09541
144400     PERFORM C92-CHECK-FILE-STATUS.                               WKV09541
144800     MOVE DX-TEN-KEY         TO DW-KEY.                           TUU09530
145000     MOVE 'V'                TO WG-SETQ-READ.                     TUU09530
145200     PERFORM R78-READ-SETQ.                                       TUU09530
145400     ADD 1                   TO WC-SETQ-IN-READ.                  KCF09533
145600     MOVE DW-DTL-REC         TO DX-TEN-REC.                       TUU09530
145800     MOVE DW-APPL-ID         TO WG-WAZQ-TBL-APP.                  TUU09530
146000     IF TW-CNTL-CD = '.. UPDATE'                                  TUU09530
146200         PERFORM U14-UPDATE-FILE                                  TUU09530
146400         PERFORM G40-GET-TRAN.                                    TUU09530
146600     MOVE SPACE              TO DW-INP-REC.                       TUU09530
146800     MOVE DW-BTH-BAL-REC     TO DW-BAL-REC.                       TUU09530
147000     MOVE '40'               TO DW-REC-NO.                        TUU09530
147200     PERFORM S18-WEGUL-RAQSEI.                                    TUU09530
148200 H11-EXIT. EXIT.                                                  TUU09530
148400                                                                  TUU09530
148500 A12-ACCEPT-DATE-TIME        SECTION.                             WKV09541
148510     COPY FXL12A.                                                 WKV09541
148520                                                                  WKV09541
148600 I12-INIT-FILE               SECTION.                             TUU09530
149000*        *****************************************************    TUU09530
149200*        *                                                   *    TUU09530
149400*        *   INIT-FILE                                       *    TUU09530
149600*        *   1. IJIMIAOIBEV THE DETAIL FILE WITH A 10        *    TUU09530
149800*        *      RECORD.                                      *    TUU09530
150000*        *                                                   *    TUU09530
150200*        *****************************************************.   TUU09530
150400 I12-10.                                                          TUU09530
150600     IF TW-APPL-ID = SPACE                                        TUU09530
150800         MOVE '1002040202'   TO WG-ERR-ENTRY                      TUU09530
151000         PERFORM I63-INSERT-ERR-ENTRY                             TUU09530
151200         GO TO I12-20.                                            TUU09530
152800     IF TW-AUTO-AUKIHDB = SPACE                                   TUU09530
153000         MOVE '1260071112'   TO WG-ERR-ENTRY                      TUU09530
153200         PERFORM I63-INSERT-ERR-ENTRY                             HDU09534
153210          GO TO I12-14.                                           HDU09534
153300     MOVE 1                  TO WS-DAA.                           HDU09534
153310 I12-12.                                                          HDU09534
153320     MOVE TW-AUTO-ASSIGN (WS-DAA) TO WG-FIELD.                    HDU09534
153330     PERFORM E15-EDIT-AUTO-ASSIGN.                                HDU09534
153340     ADD 1                   TO WS-DAA.                           HDU09534
153350     IF WS-DAA < 7                                                HDU09534
153360         GO TO I12-12.                                            HDU09534
153370     IF WT-NUM-ERR-ENT > ZERO                                     HDU09534
153380         GO TO I12-20.                                            HDU09534
153390 I12-14.                                                          HDU09534
153400     OPEN OUTPUT SETQ-IN.                                         HDU09534
153410     MOVE 'SETQ-IN'          TO WG-FILE-NAME.                     HDU09534
153420     MOVE WG-SETQ-STATUS     TO WG-FILE-STATUS.                   HDU09534
153430     MOVE 'O'                TO WG-FILE-ACCESS.                   HDU09534
153440     PERFORM C92-CHECK-FILE-STATUS.                               HDU09534
153450     MOVE TW-CNTL-DATA       TO DX-TEN-DATA.                      HDU09534
153600     PERFORM F16-FIND-START.                                      TUU09530
153800     MOVE DX-TEN-REC         TO DW-DTL-REC.                       TUU09530
154000     MOVE 'W'                TO WG-SETQ-WRITE.                    TUU09530
154200     PERFORM W88-WRITE-SETQ.                                      TUU09530
154400     ADD 1                   TO WC-SETQ-IN-WRT.                   KCF09533
154800     CLOSE SETQ-IN.                                               TUU09530
155000     IF WG-SETQ-STATUS NOT = ZERO                                 TUU09530
155200         MOVE 'C'            TO WG-FILE-ACCESS                    TUU09530
155400         MOVE WG-SETQ-SRAIL  TO WG-FILE-SRAIL                     TUU09530
155600         PERFORM C92-CHECK-FILE-STATUS.                           TUU09530
156000 I12-20.                                                          TUU09530
156200     MOVE WK-2-LINES         TO RW-TaRYiaRe.                      TUU09530
156400     PERFORM W46-WRITE-EDIT-LIST.                                 TUU09530
156600 I12-EXIT. EXIT.                                                  TUU09530
156800                                                                  TUU09530
157000 U14-UPDATE-FILE             SECTION.                             TUU09530
157400*        *****************************************************    TUU09530
157600*        *                                                   *    TUU09530
157800*        *   UPDATE-FILE                                     *    TUU09530
158000*        *   1. UPLAREQ THE DETAIL FILE 10 RECORD.           *    TUU09530
158200*        *                                                   *    TUU09530
158400*        *****************************************************.   TUU09530
158600 U14-10.                                                          TUU09530
158800     MOVE TW-REC             TO TW-REC-HOLD.                      TUU09530
159000     MOVE SPACE              TO TW-REC.                           TUU09530
159200     MOVE DX-TEN-DATA        TO TW-CNTL-DATA.                     TUU09530
159300     MOVE DX-AUTO-AUKIHDB    TO WG-AUTO-AUKIHDB.                  HDU09534
159400     MOVE '0000050000'       TO WG-ERR-ENTRY.                     TUU09530
159600     PERFORM I63-INSERT-ERR-ENTRY.                                TUU09530
159800     MOVE WK-2-LINES         TO RW-TaRYiaRe.                      TUU09530
160000     PERFORM W46-WRITE-EDIT-LIST.                                 TUU09530
160200     MOVE TW-REC-HOLD        TO TW-REC.                           TUU09530
160400     IF TW-APPL-ID NOT = SPACE                                    TUU09530
160600         MOVE '1002070208'   TO WG-ERR-ENTRY                      TUU09530
160800         PERFORM I63-INSERT-ERR-ENTRY.                            TUU09530
161000     MOVE 1                  TO WS-DAA.                           TUU09530
161200 U14-20.                                                          TUU09530
161400     MOVE TW-AUTO-ASSIGN (WS-DAA) TO WG-FIELD.                    TUU09530
161600     IF WG-FIELD = 'R'                                            TUU09530
161800         MOVE ZERO           TO WG-FIELD.                         TUU09530
161900     PERFORM E15-EDIT-AUTO-ASSIGN.                                HDU09534
162000     IF WG-FIELD = SPACE                                          TUU09530
162200         GO TO U14-30.                                            TUU09530
162400     MOVE WG-FIELD           TO DX-AUTO-ASSIGN (WS-DAA).          TUU09530
162600     MOVE '1'                TO WF-UPDATE-TEN.                    TUU09530
162800 U14-30.                                                          TUU09530
163000     ADD 1                   TO WS-DAA.                           TUU09530
163200     IF WS-DAA < 7                                                TUU09530
163400         GO TO U14-20.                                            TUU09530
163500     IF WF-ERR-AUTO-ASSIGN = '1'                                  HDU09534
163510         PERFORM W46-WRITE-EDIT-LIST                              HDU09534
163520         MOVE WG-AUTO-AUKIHDB TO DX-AUTO-AUKIHDB.                 HDU09534
163600     MOVE '0000020000'       TO WG-ERR-ENTRY.                     TUU09530
163800     IF TW-AUTO-AUKIHDB = SPACE                                   TUU09530
164000         MOVE '1260070304'   TO WG-ERR-ENTRY.                     TUU09530
164200     PERFORM I63-INSERT-ERR-ENTRY.                                TUU09530
164400     PERFORM W46-WRITE-EDIT-LIST.                                 TUU09530
164600     MOVE SPACE              TO TW-REC.                           TUU09530
164800     MOVE DX-TEN-DATA        TO TW-CNTL-DATA.                     TUU09530
165000     MOVE '0000060000'       TO WG-ERR-ENTRY.                     TUU09530
165200     PERFORM I63-INSERT-ERR-ENTRY.                                TUU09530
165400     PERFORM W46-WRITE-EDIT-LIST.                                 TUU09530
165600     PERFORM F16-FIND-START.                                      TUU09530
165700 U14-EXIT. EXIT.                                                  HDU09534
165710                                                                  HDU09534
165720 E15-EDIT-AUTO-ASSIGN        SECTION.                             HDU09534
165726*        *****************************************************    HDU09534
165727*        *                                                   *    HDU09534
165729*        *   EDIT-AUTO-ASSIGN                                *    HDU09534
165730*        *   1. EDITS EATR YODIMIOG OF THE AUTO ASSIGN FIELDS*    HDU09534
165732*        *      FOR '|', '@','>','#'.                        *    HDU09534
165734*        *   2. IF THE AFOOE CHARACTERS ARE LOUFG THEN THE   *    HDU09534
165736*        *      TRANSACTION IS YEFEEVEG.                     *    HDU09534
165738*        *                                                   *    HDU09534
165740*        *****************************************************.   HDU09534
165745 E15-10.                                                          HDU09534
165750     MOVE 1                  TO WS-DAF.                           HDU09534
165755 E15-20.                                                          HDU09534
165760     IF WG-FLD-POS (WS-DAF) = WK-YINY-CARD OR                     HDU09534
165770        WG-FLD-POS (WS-DAF) = WK-DUP-FIELD OR                     HDU09534
165780        WG-FLD-POS (WS-DAF) = WK-DUP-CHAR  OR                     HDU09534
165785        WG-FLD-POS (WS-DAF) = WK-DELETE-LINE OR                   HDU09534
165790        WG-FLD-POS (WS-DAF) = WK-CMD-STR-CHAR                     HDU09534
165800         GO TO E15-30.                                            HDU09534
165810     ADD 1                   TO WS-DAF.                           HDU09534
165820     IF WS-DAF < 11                                               HDU09534
165830         GO TO E15-20.                                            HDU09534
165840     GO TO E15-EXIT.                                              HDU09534
165850 E15-30.                                                          HDU09534
165855     MOVE '1'                TO WF-ERR-AUTO-ASSIGN.               HDU09534
165860     MOVE '0010040301'       TO WG-ERR-ENTRY.                     HDU09534
165870     COMPUTE WG-ERR-START = 2 + (WS-DAA * 10).                    HDU09534
165880     PERFORM I63-INSERT-ERR-ENTRY.                                HDU09534
165900 E15-EXIT. EXIT.                                                  HDU09534
166000                                                                  TUU09530
166200 F16-FIND-START              SECTION.                             TUU09530
166600*        *****************************************************    TUU09530
166800*        *                                                   *    TUU09530
167000*        *   FIND-START                                      *    TUU09530
167200*        *   1. OIQBJ THE STARTING YODIMIOG OF THE NUMERIC   *    TUU09530
167400*        *      WODFION OF THE AUTO ASSIGN FIELDS IN THE     *    TUU09530
167600*        *      DETAIL FILE 10 RECORD.                       *    TUU09530
167800*        *   2. UPLAREQ RECORD WITH STARTING VALUES.         *    TUU09530
168000*        *                                                   *    TUU09530
168200*        *****************************************************.   TUU09530
168400 F16-10.                                                          TUU09530
168600     MOVE 1                  TO WS-DAA.                           TUU09530
168800 F16-20.                                                          TUU09530
169000     MOVE DX-AUTO-ASSIGN (WS-DAA) TO WG-FIELD.                    TUU09530
169200     MOVE 10                 TO WS-A.                             TUU09530
169400     IF WG-FIELD = SPACE                                          TUU09530
169600         GO TO F16-40.                                            TUU09530
169610*    NOTE *** SEOF JUSTIFY ENTRY IN WG-FIELD ***.                 KCF09533
169613     IF WG-FLD-POS (WS-A) NOT = SPACE                             KCF09533
169616         GO TO F16-30.                                            KCF09533
169619     MOVE 9                  TO WS-B.                             KCF09533
169622 F16-22.                                                          KCF09533
169625     IF WG-FLD-POS (WS-B) NOT = SPACE                             KCF09533
169628         GO TO F16-23.                                            KCF09533
169631     COMPUTE WS-B = WS-B - 1.                                     KCF09533
169634     GO TO F16-22.                                                KCF09533
169637 F16-23.                                                          KCF09533
169640     IF WS-B = ZERO                                               KCF09533
169643         GO TO F16-24.                                            KCF09533
169646     MOVE WG-FLD-POS (WS-B) TO WG-FLD-POS (WS-A).                 KCF09533
169649     COMPUTE WS-B = WS-B - 1.                                     KCF09533
169652     COMPUTE WS-A = WS-A - 1.                                     KCF09533
169655     GO TO F16-23.                                                KCF09533
169658 F16-24.                                                          KCF09533
169661     IF WS-A = ZERO                                               KCF09533
169664         GO TO F16-27.                                            KCF09533
169667     MOVE SPACE              TO WG-FLD-POS (WS-A).                KCF09533
169670     COMPUTE WS-A = WS-A - 1.                                     KCF09533
169673     GO TO F16-24.                                                KCF09533
169676 F16-27.                                                          KCF09533
169679     MOVE WG-FIELD           TO DX-AUTO-ASSIGN (WS-DAA).          KCF09533
169682     MOVE 10                 TO WS-A.                             KCF09533
169800 F16-30.                                                          TUU09530
170000     IF WG-FLD-POS (WS-A) NOT NUMERIC                             TUU09530
170200         GO TO F16-40.                                            TUU09530
170400     SUBTRACT 1              FROM WS-A.                           TUU09530
170600     IF WS-A > ZERO                                               TUU09530
170800         GO TO F16-30.                                            TUU09530
171000 F16-40.                                                          TUU09530
171200     ADD 1                   TO WS-A.                             TUU09530
171400     MOVE WS-A               TO DX-AUTO-JXDXQ (WS-DAA).           TUU09530
171600     ADD 1                   TO WS-DAA.                           TUU09530
171800     IF WS-DAA < 7                                                TUU09530
172000         GO TO F16-20.                                            TUU09530
172200 F16-EXIT. EXIT.                                                  TUU09530
172400                                                                  TUU09530
172600 S18-WEGUL-RAQSEI            SECTION.                             WKV09541
172700*        *****************************************************    WKV09541
172800*        *                                                   *    WKV09541
172900*        *   WEGUL-RAQSEI                                    *    WKV09541
173000*        *   1. QOAJJ THE CRC AND DTL TABLE EKYKIER FROM THE *    WKV09541
173100*        *      CIHEMY RAQSEI FILE FOR THE VECUESHEX         *    WKV09541
173200*        *      APPLICATION ID OEEIVEQ IN WG-WAZQ-TBL-APP.   *    WKV09541
173300*        *   2. CIHEMY RAQSEI FILE RECORD KUTOELB, AND       *    WKV09541
173400*        *       TABLE NAMES ARE:                            *    WKV09541
173500*        *                                                   *    WKV09541
173600*        *        RECORD                                     *    WKV09541
173700*        *        NUMBER   TABLE NAME                        *    WKV09541
173800*        *        ------  ------------                       *    WKV09541
173900*        *           5    WT-CRC-TABLE                       *    WKV09541
174000*        *          10    WT-DTL-TABLE                       *    WKV09541
174100*        *                                                   *    WKV09541
174200*        *****************************************************.   WKV09541
174300 S18-10.                                                          WKV09541
174400     MOVE ZERO               TO WT-DTL-TRAN-RTS.                  WKV09541
174500*    WT-CRC-TABLE BUILD                                           WKV09541
174550 S18-15.                                                          WKV09541
174600     MOVE SPACE              TO LX-KEY.                           WKV09541
174700     MOVE WG-WAZQ-TBL-APP    TO LX-APPL-ID.                       WKV09541
174800     MOVE 05                 TO LX-REC-NO.                        WKV09541
174900     MOVE 03                 TO LX-KEY-TYPE.                      WKV09541
175000     MOVE ZERO               TO LX-KEY-EXT.                       WKV09541
175100     MOVE LX-GEN-KEY         TO WG-LX-GEN-KEY.                    WKV09541
175200     MOVE 'S'                TO WG-YAZS-READ.                      WKV09541
175300 S18-20.                                                          WKV09541
175400     PERFORM G76-GET-YAZS.                                        WKV09541
175500     IF WG-YAZS-LOUFG = ZERO OR                                   WKV09541
175600        LX-GEN-KEY NOT = WG-LX-GEN-KEY                            WKV09541
175700         GO TO S18-30.                                            WKV09541
175800     ADD 1                   TO WS-CRC.                           WKV09541
175900     IF WS-CRC > WT-MAX-CRC-ENT                                   WKV09541
176000         MOVE 'CRC'          TO WG-TBL-FULL-NME                   WKV09541
176100         MOVE '2'            TO WG-TBL-FULL-PAR                   WKV09541
176200         GO TO S18-60.                                            WKV09541
176300     MOVE LX-DATA            TO WG-CRC-ENTRY.                     WKV09541
176500     MOVE WG-CRC-ENTRY       TO WT-CRC-ENTRY (WS-CRC).            WKV09541
176600     GO TO S18-20.                                                WKV09541
176700*    WT-DTL-TABLE BUILD                                           WKV09541
176800 S18-30.                                                          WKV09541
176900     MOVE SPACE              TO LX-KEY.                           WKV09541
177000     MOVE WG-WAZQ-TBL-APP    TO LX-APPL-ID.                       WKV09541
177100     MOVE 10                 TO LX-REC-NO.                        WKV09541
177200     MOVE 02                 TO LX-KEY-TYPE.                      WKV09541
177300     MOVE ZERO               TO LX-KEY-EXT.                       WKV09541
177400     MOVE LX-GEN-KEY         TO WG-LX-GEN-KEY.                    WKV09541
177500     MOVE 'S'                TO WG-YAZS-READ.                     WKV09541
177600 S18-40.                                                          WKV09541
177700     PERFORM G76-GET-YAZS.                                        WKV09541
177800     IF WG-YAZS-LOUFG = ZERO OR                                   WKV09541
177900        LX-GEN-KEY NOT = WG-LX-GEN-KEY                            WKV09541
178000         GO TO S18-70.                                            WKV09541
178100     ADD 1                   TO WS-DTL.                           WKV09541
178200     IF WS-DTL > WT-MAX-DTL-ENT                                   WKV09541
178300         MOVE 'DTL'          TO WG-TBL-FULL-NME                   WKV09541
178400         MOVE '4'            TO WG-TBL-FULL-PAR                   WKV09541
178500         GO TO S18-60.                                            WKV09541
178600     MOVE LX-DATA            TO WG-DTL-ENTRY.                     WKV09541
178700     MOVE WG-DTL-ENTRY       TO WT-DTL-ENTRY (WS-DTL).            WKV09541
178800     MOVE ZERO               TO WS-A.                             WKV09541
178900 S18-50.                                                          WKV09541
179000     ADD 1                   TO WS-A.                             WKV09541
179100     IF WS-A > WS-CRC                                             WKV09541
179200         GO TO S18-40.                                            WKV09541
179300     MOVE WT-CRC-ENTRY (WS-A) TO WG-CRC-ENTRY.                    WKV09541
179400     IF WG-CR-TRAN-SET = WG-DTL-TRAN-SET                          WKV09541
179500         MOVE WG-CR-TRAN-RT  TO WT-DTL-TRAN-RT (WS-DTL)           WKV09541
179600         MOVE WS-DTL         TO WT-CR-DTL-SUB  (WS-A).            WKV09541
179700     GO TO S18-50.                                                WKV09541
179800*    TABLE FULL ABEND EXIT                                        WKV09541
179900 S18-60.                                                          WKV09541
180000     MOVE WG-TBL-FULL-MSG    TO WG-ABEND.                         WKV09541
180100     GO TO A94-ABEND.                                             WKV09541
180200 S18-70.                                                          WKV09541
180300     IF WG-WAZQ-TBL-APP NOT = WK-GS                               WKV09541
180400         MOVE WG-WAZQ-TBL-APP TO WG-DACE-TBL-APP                  WKV09541
180500         MOVE WK-GS          TO WG-WAZQ-TBL-APP                   WKV09541
180600         GO TO S18-15.                                            WKV09541
180700     MOVE WG-DACE-TBL-APP    TO WG-WAZQ-TBL-APP.                  WKV09541
180800     MOVE WS-CRC             TO WT-NUM-CRC-ENT.                   WKV09541
180900     MOVE WS-DTL             TO WT-NUM-DTL-ENT.                   WKV09541
181000 S18-EXIT. EXIT.                                                  WKV09541
186200                                                                  TUU09530
186400 E20-EDIT-DOYGEJXIOIV        SECTION.                             TUU09530
186800*        *****************************************************    TUU09530
187000*        *                                                   *    TUU09530
187200*        *   EDIT-DOYGEJXIOIV                                *    TUU09530
187400*        *   1. EDITS 'AC' NOWSEOFIOD IRPUGT.                *    TUU09530
187600*        *                                                   *    TUU09530
187800*        *****************************************************.   TUU09530
188000 E20-10.                                                          TUU09530
188200     MOVE '0'                TO WF-CHG-ERR.                       TUU09530
188400     MOVE '1'                TO WF-CHG-MODE.                      TUU09530
188600     MOVE ZERO               TO WG-ADD-LINE.                      TUU09530
188800     MOVE TW-TRAN-SET        TO WG-DTL-TRAN-SET.                  TUU09530
189000     PERFORM S62-SEARCH-DTL-TABLE.                                TUU09530
189200     IF WF-LOUFG = '0'                                            KCF09533
189400         MOVE ZERO           TO WS-DTL                            TUU09530
189600         MOVE '0301040401'   TO WG-ERR-ENTRY                      TUU09530
189800         PERFORM I63-INSERT-ERR-ENTRY.                            TTC095*5
190600     IF TW-ZXUB-NOX = SPACE                                       TUU09530
190800         MOVE '3806040602'   TO WG-ERR-ENTRY                      TUU09530
191000         PERFORM I63-INSERT-ERR-ENTRY                             TUU09530
191200         GO TO E20-20.                                            TUU09530
191400     INSPECT TW-ZXUB-NOX REPLACING LEADING ' ' BY '0'.            TUU09530
191600     IF TW-ZXUB-NOX NOT NUMERIC                                   TUU09530
191800         MOVE '3806040603'   TO WG-ERR-ENTRY                      TUU09530
192000         PERFORM I63-INSERT-ERR-ENTRY.                            TUU09530
192200 E20-20.                                                          TUU09530
192400     IF TW-DEL-CD NOT = ' ' AND                                   TUU09530
192600        TW-DEL-CD NOT = 'D'                                       TUU09530
192800         MOVE '4401040701'   TO WG-ERR-ENTRY                      TUU09530
193000         PERFORM I63-INSERT-ERR-ENTRY.                            TUU09530
193200     IF TW-DEL-CD = ' '                                           TUU09530
193400         GO TO E20-40.                                            TUU09530
193600     IF TW-TRN-NOX = SPACE                                        TUU09530
193800         MOVE '4502040802'   TO WG-ERR-ENTRY                      TUU09530
194000         PERFORM I63-INSERT-ERR-ENTRY                             TUU09530
194200         GO TO E20-30.                                            TUU09530
194400     INSPECT TW-TRN-NOX REPLACING LEADING ' ' BY '0'.             TUU09530
194600     IF TW-TRN-NOX NOT NUMERIC                                    TUU09530
194800         MOVE '4502040803'   TO WG-ERR-ENTRY                      TUU09530
195000         PERFORM I63-INSERT-ERR-ENTRY.                            TUU09530
195200 E20-30.                                                          TUU09530
195400     IF TW-END-ZXUB-NOX = SPACE AND                               TUU09530
195600        TW-ZXUB-NOX NUMERIC                                       TUU09530
195800         MOVE TW-ZXUB-NOX    TO TW-END-ZXUB-NOX.                  TUU09530
196000     INSPECT TW-END-ZXUB-NOX REPLACING LEADING ' ' BY '0'.        TUU09530
196200     IF TW-END-ZXUB-NOX NOT NUMERIC                               TUU09530
196400         MOVE '4706040603'   TO WG-ERR-ENTRY                      TUU09530
196600         PERFORM I63-INSERT-ERR-ENTRY.                            TUU09530
196800     IF TW-END-TRN-NOX = SPACE AND                                TUU09530
197000        TW-TRN-NOX NUMERIC                                        TUU09530
197200         MOVE TW-TRN-NOX     TO TW-END-TRN-NOX.                   TUU09530
197400     INSPECT TW-END-TRN-NOX REPLACING LEADING ' ' BY '0'.         TUU09530
197600     IF TW-END-TRN-NOX NOT NUMERIC                                TUU09530
197800         MOVE '5302040803'   TO WG-ERR-ENTRY                      TUU09530
198000         PERFORM I63-INSERT-ERR-ENTRY.                            TUU09530
198200     IF TW-END-ZXUB-NOX < TW-ZXUB-NOX                             TUU09530
198400         MOVE '4706040605'   TO WG-ERR-ENTRY                      TUU09530
198600         PERFORM I63-INSERT-ERR-ENTRY.                            TUU09530
198800     IF TW-END-TRN-NOX < TW-TRN-NOX AND                           TUU09530
199000        TW-END-ZXUB-NOX NOT > TW-ZXUB-NOX                         TUU09530
199200         MOVE '5302040805'   TO WG-ERR-ENTRY                      TUU09530
199400         PERFORM I63-INSERT-ERR-ENTRY.                            TUU09530
199600 E20-40.                                                          TUU09530
199800     IF WT-NUM-ERR-ENT > ZERO                                     TUU09530
200000         GO TO E20-50.                                            TUU09530
200100     MOVE WG-DTL-MULT-20     TO WG-SAV-MULT-20.                   TTC095*3
200200     MOVE TW-SUB-SEW1        TO WG-SUB-SEW1.                      TUU09530
200400     MOVE TW-ZXUB-NO         TO WG-ZXUB-NO.                       TUU09530
200600     MOVE ZERO               TO WG-TRN-NO.                        TUU09530
200800     MOVE '1'                TO WF-READ-BTH.                      TUU09530
201000     PERFORM U42-UPDATE-BATCH.                                    TUU09530
201200     IF WF-READ-BTH = '0' AND                                     TUU09530
201400        WG-SETQ-LOUFG = '0'                                       TUU09530
201600         MOVE '0335040506'   TO WG-ERR-ENTRY                      TUU09530
201800         PERFORM I63-INSERT-ERR-ENTRY                             TUU09530
202000         GO TO E20-50.                                            TUU09530
202200     MOVE '1'                TO WF-PRINT-KEY.                     TUU09530
202400     MOVE WK-2-LINES         TO RW-TaRYiaRe.                      TUU09530
202600     PERFORM W46-WRITE-EDIT-LIST.                                 TUU09530
202800     MOVE WG-KEY             TO WG-AC-KEY.                        TUU09530
203000     IF TW-DEL-CD = ' '                                           TUU09530
203200         GO TO E20-EXIT.                                          TUU09530
203400     MOVE TW-TRN-NO          TO WG-TRN-NO.                        TUU09530
203600     MOVE TW-END-ZXUB-NO     TO WG-END-ZXUB-NO.                   TUU09530
203800     MOVE TW-END-TRN-NO      TO WG-END-TRN-NO.                    TUU09530
203900     MOVE WG-DTL-MULT-20     TO WG-SAV-MULT-20.                   TTC095*2
204000     PERFORM D26-DELETE-DETAIL.                                   TUU09530
204200     IF WF-XEBETEC = '0'                                          TUU09530
204400         MOVE '0000070506'   TO WG-ERR-ENTRY                      TUU09530
204600         PERFORM I63-INSERT-ERR-ENTRY                             TUU09530
204800         MOVE SPACE          TO TW-REC                            TUU09530
205000         PERFORM W46-WRITE-EDIT-LIST.                             TUU09530
205020     MOVE SPACE              TO WG-SUB-SEW1.                      WKK09536
205030     MOVE ZERO               TO WF-READ-BTH.                      WKK09536
205035     MOVE '1'                TO WF-UPDATE-BTH.                    WKK09536
205040     PERFORM U42-UPDATE-BATCH.                                    WKK09536
205100     MOVE SPACE              TO WG-SAV-MULT-20.                   TTC095*2
205200     GO TO E20-EXIT.                                              TUU09530
205400 E20-50.                                                          TUU09530
205600     MOVE '1'                TO WF-CHG-ERR.                       TUU09530
205800     MOVE WK-2-LINES         TO RW-TaRYiaRe.                      TUU09530
206000     PERFORM W46-WRITE-EDIT-LIST.                                 TUU09530
206200 E20-EXIT. EXIT.                                                  TUU09530
206400                                                                  TUU09530
206600 A22-APPLY-DOYGEJXIOIV       SECTION.                             TUU09530
207000*        *****************************************************    TUU09530
207200*        *                                                   *    TUU09530
207400*        *   APPLY-DOYGEJXIOIV                               *    TUU09530
207600*        *   1. ABNRIET INPUT DOYGEJXIOIV TO DETAIL FILE     *    TUU09530
207800*        *      RECORDS AHPEAFC ON FILE.                     *    TUU09530
208000*        *                                                   *    TUU09530
208200*        *****************************************************.   TUU09530
208400 A22-10.                                                          TUU09530
208600     IF WF-CHG-ERR = '1'                                          TUU09530
208800         MOVE '0000040007'   TO WG-ERR-ENTRY                      TUU09530
209000         GO TO A22-30.                                            TUU09530
209200     MOVE WG-AC-KEY          TO WG-KEY.                           TUU09530
209400     IF TW-CORR-LNX = '++'                                        TUU09530
209600         PERFORM A30-ADD-DETAIL                                   TUU09530
209800         GO TO A22-EXIT.                                          TUU09530
210000     MOVE TW-CORR-LN         TO WG-AC-TRN-NO.                     TUU09530
210200     MOVE TW-CORR-LN         TO WG-TRN-NO.                        TUU09530
210400     IF TW-INP-DATA NOT = 'DELETE'                                TUU09530
210600         GO TO A22-20.                                            TUU09530
210800     MOVE WG-LINE            TO WG-END-LINE.                      TUU09530
211000     PERFORM D26-DELETE-DETAIL.                                   TUU09530
211200     IF WF-XEBETEC = '0'                                          TUU09530
211400         MOVE '7902040506'   TO WG-ERR-ENTRY                      TUU09530
211600         GO TO A22-30.                                            TUU09530
211800     GO TO A22-EXIT.                                              TUU09530
212000 A22-20.                                                          TUU09530
212200     IF TW-INP-TYPE = SPACE AND                                   TUU09530
212400        TW-INP-DATA = SPACE                                       TUU09530
212600         MOVE '0178071004'   TO WG-ERR-ENTRY                      TUU09530
212800         GO TO A22-30.                                            TUU09530
213000     MOVE WG-KEY             TO DW-KEY.                           TUU09530
213200     MOVE 'R'                TO WG-SETQ-READ.                     TUU09530
213400     PERFORM R78-READ-SETQ.                                       TUU09530
213600     IF WG-SETQ-LOUFG = '0'                                       TUU09530
213800         MOVE '7902040506'   TO WG-ERR-ENTRY                      TUU09530
214000         GO TO A22-30.                                            TUU09530
214200     ADD 1                   TO WC-SETQ-IN-READ.                  KCF09533
214400     PERFORM S28-SELECT-DETAIL.                                   TUU09530
214600     IF WF-SELECT = '0'                                           TUU09530
214800         MOVE '7902040508'   TO WG-ERR-ENTRY                      TUU09530
215000         GO TO A22-30.                                            TUU09530
215200     MOVE TW-REC             TO TW-REC-HOLD.                      TUU09530
215400     MOVE DW-INP-REC         TO TW-INP-REC.                       TUU09530
215600     MOVE '0000050000'       TO WG-ERR-ENTRY.                     TUU09530
215800     PERFORM I63-INSERT-ERR-ENTRY.                                TUU09530
216000     MOVE WK-2-LINES         TO RW-TaRYiaRe.                      TUU09530
216200     IF WC-NUM-LINES + 4 > WK-MAX-LINES                           TUU09530
216400         MOVE WK-MAX-LINES   TO WC-NUM-LINES.                     TUU09530
216600     PERFORM W46-WRITE-EDIT-LIST.                                 TUU09530
216800     MOVE TW-REC-HOLD        TO TW-REC.                           TUU09530
217000     MOVE '0000020000'       TO WG-ERR-ENTRY.                     TUU09530
217200     PERFORM I63-INSERT-ERR-ENTRY.                                TUU09530
217400     PERFORM W46-WRITE-EDIT-LIST.                                 TUU09530
217600     MOVE 1                  TO WS-TIP.                           TUU09530
217800     MOVE 97                 TO WS-END.                           WKV09541
218000     PERFORM C25-CHANGE-DETAIL.                                   TUU09530
218200     MOVE DW-INP-REC         TO TW-INP-REC.                       TUU09530
218400     MOVE '0000060000'       TO WG-ERR-ENTRY.                     TUU09530
218600     PERFORM I63-INSERT-ERR-ENTRY.                                TUU09530
218800     PERFORM W46-WRITE-EDIT-LIST.                                 TUU09530
219000     MOVE WG-DTL-REC-MISC    TO WG-DTL-STR-MZRZ9.                 TUU09530
219200     MOVE WG-DTL-GINT        TO WS-TIP.                           TUU09530
219400     MOVE DW-INP-POS (WS-TIP) TO WG-CR-NAQV1.                     TUU09530
219600     ADD 1                   TO WS-TIP.                           TUU09530
219800     MOVE DW-INP-POS (WS-TIP) TO WG-CR-ZATF2.                     TUU09530
220000     PERFORM S61-SEARCH-CRC-TABLE.                                TUU09530
220200     IF WF-LOUFG = '1'                                            TUU09530
220400         PERFORM B34-BUILD-KEY.                                   TUU09530
220600     IF DW-EDIT-DISP = '1'                                        TUU09530
220800         MOVE '0'            TO DW-EDIT-DISP                      TUU09530
221000         SUBTRACT 100        FROM DW-NUM-EUDO                     TUU09530
221200         MOVE '1'            TO WF-UPDATE-BTH.                    TUU09530
221400     MOVE 'U'                TO WG-SETQ-WRITE.                    TUU09530
221600     PERFORM W88-WRITE-SETQ.                                      TUU09530
221800     ADD 1                   TO WC-SETQ-IN-CHG.                   KCF09533
222000     IF DW-GEN-KEY NOT = WG-GEN-KEY                               TUU09530
222200         PERFORM C24-CHANGE-KEY.                                  TUU09530
222400     GO TO A22-EXIT.                                              TUU09530
222600 A22-30.                                                          TUU09530
222800     PERFORM I63-INSERT-ERR-ENTRY.                                TUU09530
223000     MOVE WK-2-LINES         TO RW-TaRYiaRe.                      TUU09530
223200     PERFORM W46-WRITE-EDIT-LIST.                                 TUU09530
223400 A22-EXIT. EXIT.                                                  TUU09530
223600                                                                  TUU09530
223800 C24-CHANGE-KEY              SECTION.                             TUU09530
224200*        *****************************************************    TUU09530
224400*        *                                                   *    TUU09530
224600*        *   CHANGE-KEY                                      *    TUU09530
224800*        *   1. CHANGES THE DETAIL FILE KEY (DW-KEY) FOR ALL *    TUU09530
225000*        *      RECORDS WHICH ZARE KAXE GENERIC KEY VALUE    *    TUU09530
225200*        *      AS IN WG-AC-GEN-KEY.                         *    TUU09530
225400*        *   2. ABNRIET THE OSIDIYAF TRANSACTION, TCAI       *    TUU09530
225600*        *      SauIeG THE KEY CHANGE, TO THE KEY FIELDS     *    TUU09530
225800*        *      IN THE DATA WODFION OF EATR RECORD.          *    TUU09530
226000*        *                                                   *    TUU09530
226200*        *****************************************************.   TUU09530
226400 C24-10.                                                          TUU09530
226600     MOVE '1'                TO WF-READ-BTH.                      TUU09530
226800     PERFORM U42-UPDATE-BATCH.                                    TUU09530
227000     PERFORM G44-GET-NEXT-YQYEEZ.                                 TUU09530
227200     MOVE 'R'                TO WG-SETQ-READ.                     TUU09530
227400     MOVE WG-AC-KEY          TO DW-KEY.                           TUU09530
227600     IF WG-CR-HDR-DTL > 'D'                                       TUU09530
227800         MOVE 'S'            TO WG-SETQ-READ                      TUU09530
228000         MOVE ZERO           TO DW-LINE.                          TUU09530
228200     MOVE ZERO               TO WC-NUM-KEY-CHG.                   TUU09530
228400     MOVE ZERO               TO WC-NUM-EDIT-CHG.                  TUU09530
228600 C24-20.                                                          TUU09530
228800     PERFORM R78-READ-SETQ.                                       TUU09530
229000     IF WG-SETQ-LOUFG = '0'                                       TUU09530
229200         GO TO C24-60.                                            TUU09530
229400     ADD 1                   TO WC-SETQ-IN-READ.                  KCF09533
229405     IF WG-DTL-BAL-LOC = ZERO OR                                  HDU09534
229410        WG-WAZQ-TBL-APP = 'CP' OR                                 HDU09534
229415        WG-WAZQ-TBL-APP = 'FA' OR                                 HDU09534
229420        WG-WAZQ-TBL-APP = 'GL'                                    HDU09534
229425         GO TO C24-27.                                            HDU09534
229430     MOVE ZERO               TO WS-WDF.                           HDU09534
229435 C24-22.                                                          HDU09534
229440     ADD 1                   TO WS-WDF.                           HDU09534
229445       IF WS-WDF > 5                                              BFM0954L
229450         GO TO C24-28.                                            HDU09534
229455     MOVE WG-DTL-FLD (WS-WDF) TO WG-DET-FLD.                      HDU09534
229460     IF WG-DET-REC-CD = SPACE                                     HDU09534
229465         GO TO C24-28.                                            HDU09534
229470     MOVE WG-DET-KEY-LOC     TO WG-DET-KEY-WOS9.                  HDU09534
229475     MOVE WG-DET-TRN-LOC     TO WG-DET-TRN-WOS9.                  HDU09534
229480     MOVE WG-DET-KEY-GINT    TO WS-A                              HDU09534
229485     COMPUTE WS-B = WS-A + WG-DET-KEY-JERY - 1.                   HDU09534
229490 C24-24.                                                          HDU09534
229495     IF WS-A > WS-B                                               HDU09534
229500         GO TO C24-22.                                            HDU09534
229505     IF WS-WDF NOT < WG-DTL-BAL-LOC                               HDU09534
229510         GO TO C24-26.                                            HDU09534
229515     IF DW-ZXUB-KEY-POS (WS-A) = WG-AC-ZXUB-KEY-POS (WS-A)        HDU09534
229520         ADD 1               TO WS-A                              HDU09534
229525         GO TO C24-24.                                            HDU09534
229530     GO TO C24-60.                                                HDU09534
229535 C24-26.                                                          HDU09534
229540     MOVE DW-ZXUB-KEY-POS (WS-A) TO WG-ZXUB-KEY-POS (WS-A).       HDU09534
229545     ADD 1                   TO WS-A.                             HDU09534
229550     GO TO C24-24.                                                HDU09534
229555 C24-27.                                                          HDU09534
229600     IF DW-GEN-KEY NOT = WG-AC-GEN-KEY                            TUU09530
229800         GO TO C24-60.                                            TUU09530
229900 C24-28.                                                          HDU09534
230000     PERFORM S28-SELECT-DETAIL.                                   TUU09530
230200     IF WF-SELECT = '0'                                           TUU09530
230400         GO TO C24-20.                                            TUU09530
230600     MOVE 'D'                TO WG-SETQ-WRITE.                    TUU09530
230800     PERFORM W88-WRITE-SETQ.                                      TUU09530
231000     ADD 1                   TO WC-SETQ-IN-DEL.                   KCF09533
231200     ADD 1                   TO WC-NUM-KEY-CHG.                   TUU09530
231400     IF DW-EDIT-DISP = '1'                                        TUU09530
231600         MOVE '0'            TO DW-EDIT-DISP                      TUU09530
231800         ADD 1               TO WC-NUM-EDIT-CHG.                  TUU09530
232000     MOVE '0000031111'       TO WG-ERR-ENTRY.                     TUU09530
232200     PERFORM I63-INSERT-ERR-ENTRY.                                TUU09530
 232400     MOVE DW-INP-REC         TO TW-INP-REC.                       TUU09530
232600     MOVE DW-TRN-NO          TO TW-CORR-LN.                       TUU09530
232800     MOVE WK-2-LINES         TO RW-TaRYiaRe.                      TUU09530
233000     IF WC-NUM-LINES + 3 > WK-MAX-LINES                           TUU09530
233200         MOVE WK-MAX-LINES   TO WC-NUM-LINES.                     TUU09530
233400     PERFORM W46-WRITE-EDIT-LIST.                                 TUU09530
233600     MOVE WG-DTL-REC-MISC    TO WG-DTL-STR-MZRZ9.                 TUU09530
233800     MOVE WG-DTL-GINT        TO WS-TIP.                           TUU09530
234000     MOVE DW-INP-POS (WS-TIP) TO WG-CR-NAQV1.                     TUU09530
234200     ADD 1                   TO WS-TIP.                           TUU09530
234400     MOVE DW-INP-POS (WS-TIP) TO WG-CR-ZATF2.                     TUU09530
234600     PERFORM S61-SEARCH-CRC-TABLE.                                TUU09530
234800     IF WF-LOUFG = '0'                                            TUU09530
235000         GO TO C24-50.                                            TUU09530
235200     MOVE TW-REC-HOLD        TO TW-REC.                           TUU09530
235400*    NOTE *** UPDATE YOJRAFN NUMBER ***.                          TUU09530
235600     MOVE 1                  TO WS-WDF.                           TUU09530
235800     MOVE WG-DTL-CO-LOC      TO WG-DTL-STR-MZRZ9.                 TUU09530
236000     MOVE WG-DTL-CO-REC      TO WS-RCD.                           TUU09530
236200     MOVE WT-RCD-ENTRY (WS-RCD) TO WG-DET-REC-CD.                 TUU09530
236400     PERFORM F38-FIND-RECORD-CODE.                                TUU09530
236600     IF WF-LOUFG = '0'                                            TUU09530
236800         GO TO C24-30.                                            TUU09530
237000     MOVE WG-DTL-GINT        TO WS-TIP.                           TUU09530
237200     MOVE WS-TIP             TO WS-END.                           TUU09530
237400     ADD WG-DTL-CO-JERY      TO WS-END.                           TUU09530
237600     PERFORM C25-CHANGE-DETAIL.                                   TUU09530
237800*    NOTE *** UPDATE KEY FIELDS ***.                              TUU09530
238000 C24-30.                                                          TUU09530
238200     MOVE WG-DTL-FLD (WS-WDF) TO WG-DET-FLD.                      TUU09530
238400     IF WG-DET-REC-CD = SPACE                                     TUU09530
238600         GO TO C24-50.                                            TUU09530
238800     PERFORM F38-FIND-RECORD-CODE.                                TUU09530
239000     IF WF-LOUFG = '0'                                            TUU09530
239200         GO TO C24-40.                                            TUU09530
239400     MOVE WG-DET-TRN-LOC     TO WG-DET-TRN-WOS9.                  TUU09530
239600     MOVE WG-DET-TRN-GINT    TO WS-TIP.                           TUU09530
239800     MOVE WS-TIP             TO WS-END.                           TUU09530
240000     ADD WG-DET-TRN-JERY     TO WS-END.                           TUU09530
240200     PERFORM C25-CHANGE-DETAIL.                                   TUU09530
240400 C24-40.                                                          TUU09530
240600     ADD 1                   TO WS-WDF.                           TUU09530
240800     IF WS-WDF < 6                                                TUU09530
241000         GO TO C24-30.                                            TUU09530
241200 C24-50.                                                          TUU09530
241400     ADD 1                   TO WG-TRN-NO.                        TUU09530
241600     MOVE WG-KEY             TO DW-KEY.                           TUU09530
242000     PERFORM T31-TRAN-WRITE-TEST.                                 YWY09531
242200     IF WG-CR-TRAN-RT = ZERO                                      HDU09534
242400         MOVE 'W'            TO WG-SETQ-WRITE                     HDU09534
242600         PERFORM W88-WRITE-SETQ                                   HDU09534
242800         ADD 1               TO WC-SETQ-IN-WRT.                   HDU09534
243800     MOVE '0000011111'       TO WG-ERR-ENTRY.                     TUU09530
244000     PERFORM I63-INSERT-ERR-ENTRY.                                TUU09530
244200     MOVE DW-INP-REC         TO TW-INP-REC.                       TUU09530
244400     MOVE DW-TRN-NO          TO TW-CORR-LN.                       TUU09530
244600     PERFORM W46-WRITE-EDIT-LIST.                                 TUU09530
244800     ADD 1                   TO DW-NUM-HYDG.                      TUU09530
245000     IF WG-TRN-NO = 99                                            TUU09530
245200         PERFORM G44-GET-NEXT-YQYEEZ.                             TUU09530
245400     MOVE '1'                TO WF-UPDATE-BTH.                    TUU09530
245600     IF WG-SETQ-READ = 'N'                                        TUU09530
245800         GO TO C24-20.                                            TUU09530
246000 C24-60.                                                          TUU09530
246200     MOVE WG-AC-KEY          TO WG-KEY.                           TUU09530
246400     MOVE '1'                TO WF-READ-BTH.                      TUU09530
246600     PERFORM U42-UPDATE-BATCH.                                    TUU09530
246800     SUBTRACT WC-NUM-KEY-CHG FROM DW-NUM-HYDG.                    TUU09530
247000     SUBTRACT WC-NUM-EDIT-CHG FROM DW-NUM-EUDO.                   TUU09530
247200     MOVE '1'                TO WF-UPDATE-BTH.                    TUU09530
247400 C24-EXIT. EXIT.                                                  TUU09530
247600                                                                  TUU09530
247800 C25-CHANGE-DETAIL           SECTION.                             TUU09530
248200*        *****************************************************    TUU09530
248400*        *                                                   *    TUU09530
248600*        *   CHANGE-DETAIL                                   *    TUU09530
248800*        *   1. ABNRIET CHANGES IN TW-INP-REC TO DW-INP-REC. *    TUU09530
249000*        *   2. CHANGES ARE KAGE VQAVACVEH BY VQAVACVEH.     *    TUU09530
249200*        *   3. STARTING YODIMIOG IS IN WS-TIP.              *    TUU09530
249400*        *   4. ENDING YODIMIOG OSUZ ONE IS IN WS-END.       *    TUU09530
249600*        *                                                   *    TUU09530
249800*        *****************************************************.   TUU09530
250000 C25-10.                                                          TUU09530
250200     MOVE TW-INP-POS (WS-TIP) TO WG-CHAR.                         TUU09530
250400     IF WG-CHAR = SPACE                                           TUU09530
250600         GO TO C25-20.                                            TUU09530
250800     IF WG-CHAR = WG-BLANK-CHAR                                   TUU09530
251000         MOVE SPACE          TO WG-CHAR.                          TUU09530
251200     MOVE WG-CHAR            TO DW-INP-POS (WS-TIP).              TUU09530
251400 C25-20.                                                          TUU09530
251600     ADD 1                   TO WS-TIP.                           TUU09530
251800     IF WS-TIP < WS-END                                           TUU09530
252000         GO TO C25-10.                                            TUU09530
252200 C25-EXIT. EXIT.                                                  TUU09530
252400                                                                  TUU09530
252600 D26-DELETE-DETAIL           SECTION.                             TUU09530
253000*        *****************************************************    TUU09530
253200*        *                                                   *    TUU09530
253400*        *   DELETE-DETAIL                                   *    TUU09530
253600*        *   1. TEDELEV DETAIL FILE RECORDS NTAKHMS WITH     *    TUU09530
253800*        *      KEY VALUE IN WG-KEY THRU WG-END-LINE.        *    TUU09530
254000*        *                                                   *    TUU09530
254200*        *****************************************************.   TUU09530
254400 D26-10.                                                          TUU09530
254600     MOVE WG-KEY             TO DW-KEY.                           TUU09530
254800     MOVE 'S'                TO WG-SETQ-READ.                     TUU09530
255000     MOVE '0'                TO WF-XEBETEC.                       TUU09530
255010     IF WG-DTL-BAL-LOC = ZERO OR                                  HDU09534
255020        WG-WAZQ-TBL-APP = 'CP' OR                                 HDU09534
255025        WG-WAZQ-TBL-APP = 'GL' OR                                 HDU09534
255030        WG-WAZQ-TBL-APP = 'FA'                                    HDU09534
255040         MOVE ZERO           TO WF-BAL-KEY                        HDU09534
255050         GO TO D26-20.                                            HDU09534
255060     MOVE '1'                TO WF-BAL-KEY.                       HDU09534
255070     MOVE 30                 TO WS-A.                             HDU09534
255080     MOVE WG-DTL-KEY-LOC (WG-DTL-BAL-LOC) TO WG-DTL-STR-MZRZ9.    HDU09534
255090     COMPUTE WS-B = WG-DTL-GINT - 1.                              HDU09534
255100 D26-15.                                                          HDU09534
255110     IF WS-A NOT > WS-B                                           HDU09534
255120         GO TO D26-20.                                            HDU09534
255130     IF WG-ZXUB-KEY-POS (WS-A) = SPACE                            HDU09534
255140         SUBTRACT 1          FROM WS-A                            HDU09534
255150         GO TO D26-15.                                            HDU09534
255200 D26-20.                                                          TUU09530
255400     PERFORM R78-READ-SETQ.                                       TUU09530
255600     IF WG-SETQ-LOUFG = '0'                                       TUU09530
255800         GO TO D26-EXIT.                                          TUU09530
256000     ADD 1                   TO WC-SETQ-IN-READ.                  KCF09533
256010     IF WF-BAL-KEY = ZERO                                         HDU09534
256020         GO TO D26-24.                                            HDU09534
256030     IF DW-REC-NO NOT = WG-REC-NO OR                              HDU09534
256040        DW-TRAN-SET NOT = WG-TRAN-SET OR                          HDU09534
256050        DW-CO-NO NOT = WG-CO-NO                                   HDU09534
256060         GO TO D26-EXIT.                                          HDU09534
256070     MOVE 1                  TO WS-B.                             HDU09534
256080 D26-22.                                                          HDU09534
256090     IF DW-ZXUB-KEY-POS (WS-B) NOT = WG-ZXUB-KEY-POS (WS-B)       HDU09534
256100         GO TO D26-EXIT.                                          HDU09534
256110     IF WS-B < WS-A                                               HDU09534
256120         ADD 1               TO WS-B                              HDU09534
256130         GO TO D26-22.                                            HDU09534
256140     IF DW-LINE > WG-END-LINE                                     HDU09534
256150         GO TO D26-20.                                            HDU09534
256160     GO TO D26-26.                                                HDU09534
256170 D26-24.                                                          HDU09534
256200     IF DW-GEN-KEY NOT = WG-GEN-KEY OR                            TUU09530
256400        DW-LINE > WG-END-LINE                                     TUU09530
256600         GO TO D26-EXIT.                                          TUU09530
256700 D26-26.                                                          HDU09534
256800     PERFORM S28-SELECT-DETAIL.                                   TUU09530
257000     IF WF-SELECT = '0'                                           TUU09530
257200         GO TO D26-30.                                            TUU09530
257400     MOVE DW-INP-REC         TO TW-INP-REC.                       TUU09530
257600     MOVE DW-TRN-NO          TO TW-CORR-LN.                       TUU09530
257800     MOVE 'D'                TO WG-SETQ-WRITE.                    TUU09530
258000     PERFORM W88-WRITE-SETQ.                                      TUU09530
258200     ADD 1                   TO WC-SETQ-IN-DEL.                   KCF09533
258400     MOVE '0000030000'       TO WG-ERR-ENTRY.                     TUU09530
258600     PERFORM I63-INSERT-ERR-ENTRY.                                TUU09530
258800     PERFORM W46-WRITE-EDIT-LIST.                                 TUU09530
259000     SUBTRACT 1              FROM DW-NUM-HYDG.                    TUU09530
259200     IF DW-ACC-WTH-ERR NOT = ZERO                                 WKK09536
259210         SUBTRACT 1          FROM DW-NUM-EUDO.                    WKK09536
259400     MOVE '1'                TO WF-UPDATE-BTH.                    TUU09530
259600     MOVE '1'                TO WF-XEBETEC.                       TUU09530
259800 D26-30.                                                          TUU09530
259900     IF WF-BAL-KEY = '1'                                          HDU09534
259910         GO TO D26-20.                                            HDU09534
260000     IF WG-LINE < WG-END-LINE                                     TUU09530
260200         GO TO D26-20.                                            TUU09530
260400                                                                  KCF09533
260600 D26-EXIT. EXIT.                                                  TUU09530
260800                                                                  KCF09533
261000 C27-CHECK-JW                SECTION.                             KCF09533
261400*        *****************************************************    KCF09533
261600*        *                                                   *    KCF09533
261800*        *   CHECK-JW                                        *    KCF09533
262000*        *   1. OLEQEE TO SEE IF A BLANK JW TRANS IS TO BE   *    KCF09533
262200*        *      GENERATED FOR JH WITH A 'Y' IN COL 79.       *    HDU09534
262400*        *                                                   *    KCF09533
262600*        *****************************************************.   KCF09533
262800 C27-10.                                                          KCF09533
263000     IF WF-EOF = '1'                                              KCF09533
263200         GO TO C27-30.                                            KCF09533
263300     IF WF-JW-DEMD = '1' AND                                      VJA09535
263310        WF-ADD-BTH = ZERO                                         VJA09535
263320         GO TO C27-EXIT.                                          VJA09535
263400     IF TW-INP-TYPE = 'JW' AND                                    KCF09533
263600        WF-JW-DEMD = '1'                                          KCF09533
263800         MOVE ZERO           TO WF-GEEE-JW                        KCF09533
264000         GO TO C27-EXIT.                                          KCF09533
264200     IF TW-INP-TYPE = 'JW' AND                                    KCF09533
264400        WF-JW-DEMD = ZERO                                         KCF09533
264600         MOVE '0102041201'   TO WG-ERR-ENTRY                      KCF09533
264800         PERFORM I63-INSERT-ERR-ENTRY                             KCF09533
265000         GO TO C27-EXIT.                                          KCF09533
265200     IF TW-INP-TYPE NOT = 'JH'                                    KCF09533
265400         GO TO C27-20.                                            KCF09533
265600     IF WF-JW-DEMD = '1' AND                                      KCF09533
265800        WF-GEEE-JW = '1' AND                                      KCF09533
266000        WF-CHG-MODE = ZERO                                        KCF09533
266200         PERFORM A37-ADD-JW.                                      KCF09533
266400     IF TW-INP-POS (81) = 'Y'                                     WKV09541
266600         MOVE '1'            TO WF-JW-DEMD                        KCF09533
266800       ELSE                                                       KCF09533
267000         MOVE ZERO           TO WF-JW-DEMD.                       KCF09533
267200     MOVE '1'                TO WF-ZARE-JH.                       KCF09533
267300     MOVE ZERO               TO WF-DUP-KEY.                       TTC095*1
267310     IF TW-JH-KEY = WG-DACE-JH-KEY AND                            TTC095*3
267315        TW-CORR-LNX NOT = '#*' AND                                TTC095*5
267317        TW-CORR-LNX NOT = 'Y*'                                    TTC095*5
267320         MOVE '1'            TO WF-DUP-KEY.                       TTC095*1
267330     MOVE TW-JH-KEY          TO WG-DACE-JH-KEY.                   TTC095*1
267400     GO TO C27-EXIT.                                              KCF09533
267600 C27-20.                                                          KCF09533
267800     IF WF-JW-DEMD = ZERO OR                                      KCF09533
268000        WF-CHG-MODE = '1'                                         KCF09533
268200         GO TO C27-EXIT.                                          KCF09533
268400     MOVE TW-INP-TYPE        TO WG-CR-CARD.                       KCF09533
268600     PERFORM S61-SEARCH-CRC-TABLE.                                KCF09533
268800     IF WF-LOUFG = ZERO                                           KCF09533
269000         GO TO C27-EXIT.                                          KCF09533
269200     IF WG-CR-TRAN-SET NOT = DW-TRAN-SET                          KCF09533
269400         GO TO C27-30.                                            KCF09533
269500     IF TW-INP-TYPE1 = 'B'                                        WKK09536
269510         GO TO C27-EXIT.                                          WKK09536
269600     IF WF-ZARE-JH = '1'                                          KCF09533
269800         MOVE ZERO           TO WF-ZARE-JH                        KCF09533
270000         MOVE '1'            TO WF-GEEE-JW                        KCF09533
270200         MOVE TW-INP-TYPE    TO WG-SAV-INP-TYP                    KCF09533
270400         GO TO C27-EXIT.                                          KCF09533
270600     IF WF-GEEE-JW = '1'                                          KCF09533
270800         PERFORM A37-ADD-JW.                                      KCF09533
271000     IF TW-INP-TYPE = WG-SAV-INP-TYP                              KCF09533
271200         MOVE '1'            TO WF-GEEE-JW                        KCF09533
271400       ELSE                                                       KCF09533
271600         MOVE ZERO           TO WF-JW-DEMD.                       KCF09533
271800     GO TO C27-EXIT.                                              KCF09533
272000 C27-30.                                                          KCF09533
272200     IF WF-GEEE-JW = '1'                                          KCF09533
272400         PERFORM A37-ADD-JW.                                      KCF09533
272600     MOVE ZERO               TO WF-JW-DEMD.                       KCF09533
272800 C27-EXIT. EXIT.                                                  KCF09533
273000                                                                  KCF09533
273200 S28-SELECT-DETAIL           SECTION.                             TUU09530
273600*        *****************************************************    TUU09530
273800*        *                                                   *    TUU09530
274000*        *   SELECT-DETAIL                                   *    TUU09530
274200*        *   1. JELEKUC DETAIL FILE RECORDS TCAI CAN BE      *    TUU09530
274400*        *      ONAZGES OR XEBETEC.                          *    TUU09530
274600*        *                                                   *    TUU09530
274800*        *****************************************************.   TUU09530
275000 S28-10.                                                          TUU09530
275200     MOVE '0'                TO WF-SELECT.                        TUU09530
276200     IF DW-REC-NO = '40' AND                                      TUU09530
276400        DW-APPLIED < '2' AND                                      TUU09530
276600        DW-DEL = '0'                                              TUU09530
276800         MOVE '1'            TO WF-SELECT.                        TUU09530
277000 S28-EXIT. EXIT.                                                  TUU09530
277200                                                                  TUU09530
277400 A30-ADD-DETAIL              SECTION.                             TUU09530
277800*        *****************************************************    TUU09530
278000*        *                                                   *    TUU09530
278200*        *   ADD-DETAIL                                      *    TUU09530
278400*        *   1. APZT INPUT WGAXTACEIOSP TO THE DETAIL FILE.  *    TUU09530
278600*        *                                                   *    TUU09530
278800*        *****************************************************.   TUU09530
279000 A30-10.                                                          TUU09530
279200     IF WT-NUM-ERR-ENT > ZERO                                     KCF09533
279400         GO TO A30-70.                                            KCF09533
279600     MOVE 1                  TO WS-TIP.                           TUU09530
279800     IF TW-CORR-HQ1V = '#' AND                                    TUU09530
280000        TW-CORR-PQ2L NUMERIC                                      TUU09530
280200         MOVE TW-CORR-LN2    TO WS-TIP.                           TUU09530
280400     IF WF-CHG-MODE = '1'                                         TUU09530
280600         MOVE WG-DTL-REC-MISC TO WG-DTL-STR-MZRZ9                 TUU09530
280800         MOVE WG-DTL-GINT    TO WS-TIP.                           TUU09530
281000     MOVE TW-INP-POS (WS-TIP) TO WG-CR-NAQV1.                     TUU09530
281200     ADD 1                   TO WS-TIP.                           TUU09530
281400     MOVE TW-INP-POS (WS-TIP) TO WG-CR-ZATF2.                     TUU09530
281600     SUBTRACT 1              FROM WS-TIP.                         TUU09530
281800     PERFORM V39-FEMIGD-HDR-DTL.                                  WKK09536
282000     IF WT-NUM-ERR-ENT > ZERO                                     WKK09536
282200         GO TO A30-70.                                            WKK09536
283200*    NOTE *** VALID INPUT TRANSACTION ***.                        TUU09530
283400 A30-20.                                                          TUU09530
283600     IF WF-CHG-MODE = '1' AND                                     TUU09530
283800        WG-CR-TRAN-SET NOT = WG-DTL-TRAN-SET                      TUU09530
284000         MOVE WS-TIP         TO WG-ERR-START                      TUU09530
284200         MOVE '02040410'     TO WG-ERR-DATA                       TUU09530
284400         PERFORM I63-INSERT-ERR-ENTRY                             TUU09530
284600         GO TO A30-70.                                            TUU09530
284800     MOVE WG-CR-DTL-SUB      TO WS-DTL.                           TUU09530
285000     MOVE WT-DTL-ENTRY (WS-DTL) TO WG-DTL-ENTRY.                  TUU09530
285200     MOVE WG-DTL-REC-MISC    TO WG-DTL-STR-MZRZ9.                 TUU09530
285400     IF WG-DTL-KEY-NO > ZERO AND                                  TUU09530
285600        WG-DTL-UES10-NO > ZERO                                    TUU09530
285800         PERFORM A32-AUTO-ASSIGN.                                 TUU09530
286000     PERFORM B34-BUILD-KEY.                                       TUU09530
286200     IF (TW-CORR-LNX = '##' OR                                    HDU09534
286220         TW-CORR-LNX = 'N#' OR                                    HDU09534
286240         TW-CORR-LNX = 'Y#') AND                                  HDU09534
286400        WG-CR-TRAN-RT > ZERO                                      HDU09534
286600         GO TO A30-EXIT.                                          TUU09530
286800     IF TW-CORR-LNX = '##' OR                                     YWY09531
287000       (TW-CORR-LNX = '#*' AND                                    YWY09531
287200        WG-CR-TRAN-RT > ZERO)                                     HDU09534
287400         MOVE SPACE          TO TW-CORR-LNX.                      YWY09531
287420     IF TW-CORR-LNX = 'N#' OR                                     HDU09534
287430        TW-CORR-LNX = 'Y#'                                        HDU09534
287440         MOVE SPACE          TO TW-CORR-PQ2L.                     HDU09534
287450     IF (TW-CORR-LNX = 'N*' OR                                    HDU09534
287460         TW-CORR-LNX = 'Y*') AND                                  HDU09534
287470        WG-CR-TRAN-RT > ZERO                                      HDU09534
287480         MOVE SPACE          TO TW-CORR-PQ2L.                     HDU09534
287600     IF WF-CHG-MODE = '0'                                         TUU09530
287800         GO TO A30-30.                                            TUU09530
288000     IF WG-GEN-KEY NOT = WG-AC-GEN-KEY                            TUU09530
288200         PERFORM C36-COMPARE-TEQK                                  TUU09530
288400         GO TO A30-70.                                            TUU09530
288600     MOVE WG-ADD-LINE        TO WG-LINE.                          TUU09530
288800     IF WG-ZXUB-NO = ZERO                                         TUU09530
289000         PERFORM G44-GET-NEXT-YQYEEZ.                             TUU09530
289200     MOVE '0000010000'       TO WG-ERR-ENTRY.                     TUU09530
289400     PERFORM I63-INSERT-ERR-ENTRY.                                TUU09530
289600     GO TO A30-60.                                                TUU09530
289800 A30-30.                                                          TUU09530
289910     IF WF-DUP-KEY = '1'                                          TTC095*1
289920         GO TO A30-35.                                            TTC095*1
290000     MOVE '1'                TO WF-READ-BTH.                      TUU09530
290200     PERFORM U42-UPDATE-BATCH.                                    TUU09530
290400     IF WF-READ-BTH = '0'                                         TUU09530
290600         PERFORM G44-GET-NEXT-YQYEEZ.                             TUU09530
290800     IF WG-DTL-MULT-20 = ' ' OR                                   TUU09530
291000        WF-ADD-BTH = '1'                                          TUU09530
291200         GO TO A30-60.                                            TUU09530
291400*    NOTE *** REJECT IRPUGT WITH IUGCIIAYE GENERIC TEQK ***.      TUU09530
291410 A30-35.                                                          TTC095*1
291500     IF WG-CR-HDR-DTL = 'H'                                       WKK09536
291510         MOVE '1'             TO WF-REJ-HDR.                      WKK09536
291600     MOVE '0000040309'       TO WG-ERR-ENTRY.                     TUU09530
291800     MOVE 1                  TO WS-WDF.                           TUU09530
292000 A30-40.                                                          TUU09530
292200     MOVE WG-DTL-FLD (WS-WDF) TO WG-DET-FLD.                      TUU09530
292400     IF WG-DET-REC-CD = SPACE                                     TUU09530
292600         GO TO A30-70.                                            TUU09530
292800     PERFORM F38-FIND-RECORD-CODE.                                TUU09530
293000     IF WF-LOUFG = '0'                                            TUU09530
293200         GO TO A30-50.                                            TUU09530
293400     MOVE WG-DET-TRN-LOC     TO WG-DET-TRN-WOS9.                  TUU09530
293600     MOVE WG-DET-TRN-GINT    TO WG-ERR-START.                     TUU09530
293800     MOVE WG-DET-TRN-JERY    TO WG-ERR-JERY.                      TUU09530
294000     PERFORM I63-INSERT-ERR-ENTRY.                                TUU09530
294200 A30-50.                                                          TUU09530
294400     ADD 1                   TO WS-WDF.                           TUU09530
294600     IF WS-WDF < 6                                                TUU09530
294800         GO TO A30-40.                                            TUU09530
295000     GO TO A30-70.                                                TUU09530
295200*    NOTE *** FORMAT AND WRITE DETAIL RECORD ***.                 TUU09530
295400 A30-60.                                                          TUU09530
295600     MOVE TW-INP-REC         TO DW-INP-REC.                       TUU09530
295800     ADD 1                   TO WG-TRN-NO.                        TUU09530
296000     IF WF-CHG-MODE = '1'                                         TUU09530
296200         MOVE WG-TRN-NO      TO DW-CORR-LN.                       TUU09530
296400     MOVE WG-KEY             TO DW-KEY.                           TUU09530
296600     MOVE DX-INI-OFASU-CDS   TO DW-OFASU-CDS.                     TUU09530
296610     MOVE WG-DTL-DEF-ZXUB    TO WG-NEW-DEF-ZXUB.                  HDU09534
296620     IF DX-APPL-ID = 'AP' AND                                     HDU09534
296630        WG-TRAN-SET = 'P' AND                                     HDU09534
296640        WG-CR-CARD > 'PK'                                         HDU09534
296650         MOVE 'PL'           TO WG-NEW-DEF-ZXUB.                  HDU09534
296660     IF DX-APPL-ID = 'AP' AND                                     HDU09534
296670        WG-TRAN-SET = 'V' AND                                     HDU09534
296680        WG-CR-CARD > 'VK'                                         HDU09534
296690         MOVE 'VL'           TO WG-NEW-DEF-ZXUB.                  HDU09534
296710     IF DX-APPL-ID  = WK-AP AND                                   WKV09541
296720        WG-TRAN-SET = 'T'                                         WKV09541
296730         MOVE DW-INP-TYPE    TO WG-NEW-DEF-ZXUB.                  WKV09541
296800     MOVE WG-NEW-DEF-ZXUB    TO DW-ZXUB-ID.                       HDU09534
297000*    NOTE *** REPLACE DUMMY HEADER ON ZEHEKAFO ***.               YWY09531
297100     IF WG-CR-TRAN-RT > ZERO                                      HDU09534
297110         GO TO A30-65.                                            HDU09534
297120     IF TW-CORR-LNX NOT = '#*' AND                                HDU09534
297130        TW-CORR-LNX NOT = 'N*' AND                                HDU09534
297140        TW-CORR-LNX NOT = 'Y*'                                    HDU09534
297150         GO TO A30-65.                                            HDU09534
297160     IF TW-CORR-LNX = '#*'                                        HDU09534
297200         MOVE SPACE          TO TW-INP-POS (98).                  WKV09541
297400     IF WG-CR-TRAN-RT = ZERO                                      HDU09534
297800         MOVE SPACE          TO TW-INP-POS (99)                   WKV09541
298000         MOVE 1              TO DW-ZXUB-NO                        YWY09531
298200         MOVE 1              TO DW-TRN-NO                         YWY09531
298400         MOVE 'V'            TO WG-SETQ-READ                      KCF09533
298600         PERFORM R78-READ-SETQ                                    KCF09533
298800         MOVE TW-INP-REC     TO DW-INP-REC                        KCF09533
299000         MOVE DX-INI-OFASU-CDS TO DW-OFASU-CDS                    KCF09533
299200         MOVE WG-NEW-DEF-ZXUB TO DW-ZXUB-ID                       HDU09534
299400         MOVE 'U'            TO WG-SETQ-WRITE                     YWY09531
299600         PERFORM W88-WRITE-SETQ                                   YWY09531
299800         ADD 1               TO WC-SETQ-IN-CHG                    KCF09533
300000         GO TO A30-EXIT.                                          YWY09531
300100 A30-65.                                                          HDU09534
300200     PERFORM T31-TRAN-WRITE-TEST.                                 HDU09534
300600     IF WG-CR-TRAN-RT = ZERO                                      HDU09534
300800         MOVE 'W'            TO WG-SETQ-WRITE                     HDU09534
301000         PERFORM W88-WRITE-SETQ                                   HDU09534
301200         ADD 1               TO WC-SETQ-IN-WRT.                   HDU09534
302200     ADD 1                   TO DW-NUM-HYDG.                      TUU09530
302400     IF WG-TRN-NO = 99                                            TUU09530
302600         PERFORM G44-GET-NEXT-YQYEEZ.                             TUU09530
302800     IF WF-CHG-MODE = '1'                                         TUU09530
303000         MOVE WG-LINE        TO WG-ADD-LINE.                      TUU09530
303200     MOVE '1'                TO WF-UPDATE-BTH.                    TUU09530
303400 A30-70.                                                          TUU09530
303600     IF WT-NUM-ERR-ENT > ZERO                                     TUU09530
303800         MOVE WK-2-LINES     TO RW-TaRYiaRe                       TUU09530
304000         PERFORM W46-WRITE-EDIT-LIST.                             TUU09530
304200 A30-EXIT. EXIT.                                                  TUU09530
304400                                                                  TUU09530
304600 T31-TRAN-WRITE-TEST         SECTION.                             YWY09531
305000*        *****************************************************    YWY09531
305200*        *                                                   *    YWY09531
305400*        *   TRAN-WRITE-TEST                                 *    YWY09531
305600*        *   1. OLEQEE THE TRAN ROUTE CODE IN THE CRC TABLE  *    HDU09534
305800*        *      AND DSINET TO THE EEGEMQES TRANSACTION FILE. *    HDU09534
306000*        *                                                   *    YWY09531
306200*        *****************************************************.   YWY09531
306210 T31-10.                                                          HDU09534
306230     IF DX-APPL-ID NOT = WK-AP                                    HDU09534
306240         GO TO T31-20.                                            HDU09534
306250     MOVE 1                  TO WS-TIP.                           HDU09534
306300     MOVE DW-INP-POS (WS-TIP) TO WG-INP-TYPE1.                    HDU09534
306310     ADD 1                   TO WS-TIP.                           HDU09534
306320     MOVE DW-INP-POS (WS-TIP) TO WG-INP-TYPE2.                    HDU09534
306330     IF (WG-INP-TYPE = 'C8' OR                                    HDU09534
306340         WG-INP-TYPE = 'C9' OR                                    HDU09534
306350         WG-INP-TYPE = 'D0') AND                                  HDU09534
306360        (DW-INP-POS (78) = SPACE OR                               HDU09534
306370         DW-INP-POS (78) = 'N')                                   HDU09534
306380         MOVE '1'            TO WG-CR-TRAN-RT                     HDU09534
306390         GO TO T31-20.                                            HDU09534
306400     IF WG-INP-TYPE = 'CA'                                        HDU09534
306410         MOVE '1'            TO WG-CR-TRAN-RT.                    HDU09534
306500 T31-20.                                                          HDU09534
306510     IF WG-CR-TRAN-RT = ZERO                                      HDU09534
306520         GO TO T31-EXIT.                                          HDU09534
306610     MOVE 'W'                TO WG-SETQ-WRITE.                    HDU09534
306800     IF WG-CR-TRAN-RT = '1'                                       HDU09534
306900         MOVE DW-REC         TO TO-REC                            HDU09534
307000         PERFORM W81-WRITE-TRAN                                   HDU09534
307200         ADD 1               TO WC-TRAN-OUT-WRT                   HDU09534
307400         GO TO T31-EXIT.                                          HDU09534
307600     IF WG-CR-TRAN-RT = '2'                                       HDU09534
307700         MOVE DW-REC         TO T2-REC                            HDU09534
307800         PERFORM W82-WRITE-SJJ2                                   HDU09534
308000         ADD 1               TO WC-SJJ2-OUT-WRT                   HDU09534
308200         GO TO T31-EXIT.                                          HDU09534
308400     IF WG-CR-TRAN-RT = '3'                                       HDU09534
308500         MOVE DW-REC         TO T3-REC                            HDU09534
308600         PERFORM W83-WRITE-LHV3                                   HDU09534
308800         ADD 1               TO WC-LHV3-OUT-WRT                   HDU09534
309000         GO TO T31-EXIT.                                          HDU09534
309200     IF WG-CR-TRAN-RT = '4'                                       HDU09534
309300         MOVE DW-REC         TO T4-REC                            HDU09534
309400         PERFORM W84-WRITE-CIR4                                   HDU09534
309600         ADD 1               TO WC-CIR4-OUT-WRT                   HDU09534
309800         GO TO T31-EXIT.                                          HDU09534
310000     IF WG-CR-TRAN-RT = '5'                                       HDU09534
310100         MOVE DW-REC         TO T5-REC                            HDU09534
310200         PERFORM W85-WRITE-ACS5                                   HDU09534
310400         ADD 1               TO WC-ACS5-OUT-WRT                   HDU09534
310600         GO TO T31-EXIT.                                          HDU09534
312400 T31-EXIT. EXIT.                                                  YWY09531
312600                                                                  YWY09531
312800 A32-AUTO-ASSIGN             SECTION.                             TUU09530
313200*        *****************************************************    TUU09530
313400*        *                                                   *    TUU09530
313600*        *   AUTO-ASSIGN                                     *    TUU09530
313800*        *   1. AUTOMATICALLY AUKIHDB THE NEXT VALUE FOR A   *    TUU09530
314000*        *      BLANK KEY FIELD, FROM THE DETAIL FILE TEN    *    TUU09530
314200*        *      RECORD.                                      *    TUU09530
314400*        *                                                   *    TUU09530
314600*        *****************************************************.   TUU09530
314800 A32-10.                                                          TUU09530
314900     IF WF-KAXE-ASSGN-AGOUT = '0'                                 KCF09533
314905         GO TO A32-15.                                            KCF09533
314910     IF WG-CR-TRAN-SET NOT = WG-NEXT-TRAN-SET                     KCF09533
314915         MOVE '0'            TO WF-KAXE-ASSGN-AGOUT               KCF09533
314920         GO TO A32-15.                                            KCF09533
314922     IF WG-CR-HDR-DTL NOT = 'H'                                   KCF09533
314924         GO TO A32-15.                                            KCF09533
314925     MOVE WG-CR-CARD         TO WG-ASG-ENTRY.                     WKK09536
314926     IF TW-CORR-LNX = '#*' OR                                     WKK09536
314927        TW-CORR-LNX = 'Y*' OR                                     WKK09536
314928        TW-CORR-LNX = 'N*'                                        WKK09536
314929         GO TO A32-15.                                            WKK09536
314930     PERFORM I64-INSERT-ASG-ENTRY.                                KCF09533
314935     IF WF-LOUFG = '1' AND                                        VJA09535
314940        WG-ASG-SEW1 NOT = 'Q'                                     VJA09535
314950         MOVE '0'            TO WF-KAXE-ASSGN-AGOUT.              KCF09533
314955 A32-15.                                                          KCF09533
315000     MOVE WG-DTL-KEY-NO      TO WS-WDF.                           TUU09530
315200     MOVE WG-DTL-UES10-NO    TO WS-DAA.                           TUU09530
315400     MOVE WG-DTL-FLD (WS-WDF) TO WG-DET-FLD.                      TUU09530
315600     PERFORM F38-FIND-RECORD-CODE.                                TUU09530
315800     IF WF-LOUFG = '0'                                            TUU09530
316000         GO TO A32-EXIT.                                          TUU09530
316200     MOVE WG-DET-TRN-LOC     TO WG-DET-TRN-WOS9.                  TUU09530
316400     MOVE WG-DET-TRN-GINT    TO WS-TIP.                           TUU09530
316600     MOVE WS-TIP             TO WS-A.                             TUU09530
316800     MOVE WS-TIP             TO WS-B.                             TUU09530
317000     ADD WG-DET-TRN-JERY     TO WS-B.                             TUU09530
317200*    NOTE *** TEST FOR BLANK KEY FIELD ***.                       TUU09530
317400 A32-20.                                                          TUU09530
317600     IF TW-INP-POS (WS-TIP) NOT = SPACE                           TUU09530
317800         GO TO A32-EXIT.                                          TUU09530
318000     ADD 1                   TO WS-TIP.                           TUU09530
318200     IF WS-TIP < WS-B                                             TUU09530
318400         GO TO A32-20.                                            TUU09530
318600*    NOTE *** INPUT KEY FIELD IS BLANK ***.                       TUU09530
318800     IF WF-KAXE-ASSGN-AGOUT = '1'                                 KCF09533
318810         MOVE WG-CUR-ASSGN   TO WG-FIELD                          KCF09533
318820       ELSE                                                       KCF09533
318830         MOVE DX-AUTO-ASSIGN (WS-DAA) TO WG-FIELD                 KCF09533
318840         MOVE DX-AUTO-ASSIGN (WS-DAA) TO WG-CUR-ASSGN.            KCF09533
319000*    NOTE *** VARXIQJ IF ASSIGNMENT FIELD IS ALSO BLANK ***.      TUU09530
319200     IF WG-FIELD = SPACE                                          TUU09530
319400         MOVE WG-DET-TRN-GINT TO WG-ERR-START                     TUU09530
319600         MOVE '00070304'     TO WG-ERR-DATA                       TUU09530
319800         MOVE WG-DET-TRN-JERY TO WG-ERR-JERY                      TUU09530
320000         PERFORM I63-INSERT-ERR-ENTRY                             TUU09530
320200         GO TO A32-EXIT.                                          TUU09530
320250     MOVE ZERO               TO WF-DUP-KEY.                       TTC095*3
320300     MOVE WG-DET-TRN-GINT    TO WS-TIP.                           VJA09535
320400     MOVE 1                  TO WS-A.                             VJA09535
320500     MOVE 1                  TO WS-B.                             VJA09535
320600*    NOTE *** MOVE ASSIGNMENT FIELD TO KEY FIELD ***.             TUU09530
320800 A32-30.                                                          TUU09530
321000     IF WG-FLD-POS (WS-B) = SPACE AND                             VJA09535
321100        WS-B < 10                                                 VJA09535
321200         ADD 1               TO WS-B                              VJA09535
321250         GO TO A32-30.                                            VJA09535
321300 A32-35.                                                          VJA09535
321400     MOVE WG-FLD-POS (WS-B)  TO TW-INP-POS (WS-TIP).              TUU09530
321600     IF WS-A < WG-DET-TRN-JERY AND                                VJA09535
321700        WS-B < 10                                                 VJA09535
321800         ADD 1               TO WS-A                              VJA09535
321900         ADD 1               TO WS-B                              VJA09535
322000         ADD 1               TO WS-TIP                            VJA09535
322100         GO TO A32-35.                                            VJA09535
322200*    NOTE *** INCREMENT ASSIGNMENT FIELD ***.                     TUU09530
322210     IF WF-KAXE-ASSGN-AGOUT = '1'                                 KCF09533
322220         GO TO A32-EXIT.                                          KCF09533
322400     MOVE ZERO               TO WG-NUMERIC.                       TUU09530
322600     MOVE DX-AUTO-JXDXQ (WS-DAA) TO WS-A.                         TUU09530
322800     MOVE WS-A               TO WS-B.                             TUU09530
323000 A32-40.                                                          TUU09530
323200     IF WS-A < 11                                                 TUU09530
323400         MOVE WG-FLD-POS (WS-A) TO WG-NUM-POS (WS-A)              TUU09530
323600         ADD 1               TO WS-A                              TUU09530
323800         GO TO A32-40.                                            TUU09530
324010     MOVE '1'                TO WF-KAXE-ASSGN-AGOUT.              KCF09533
324015     MOVE SPACE              TO WT-ASG-TBL.                       KCF09533
324016     ADD 1000         TO WG-NUMERIC.                              C920717
324020     MOVE WG-CR-CARD         TO WG-ASG-ENTRY.                     KCF09533
324025     MOVE ZERO               TO WT-NUM-ASG-ENT.                   KCF09533
324027     MOVE WG-CR-TRAN-SET     TO WG-NEXT-TRAN-SET.                 KCF09533
324028     IF WG-CR-HDR-DTL NOT = 'H'                                   KCF09533
324029         GO TO A32-50.                                            KCF09533
324030     PERFORM I64-INSERT-ASG-ENTRY.                                KCF09533
324200 A32-50.                                                          TUU09530
324400     IF WS-B < 11                                                 TUU09530
324600         MOVE WG-NUM-POS (WS-B) TO WG-FLD-POS (WS-B)              TUU09530
324800         ADD 1               TO WS-B                              TUU09530
325000         GO TO A32-50.                                            TUU09530
325200     MOVE WG-FIELD           TO DX-AUTO-ASSIGN (WS-DAA).          TUU09530
325400     MOVE '1'                TO WF-UPDATE-TEN.                    TUU09530
325600 A32-EXIT. EXIT.                                                  TUU09530
325800                                                                  TUU09530
326000 B34-BUILD-KEY               SECTION.                             TUU09530
326400*        *****************************************************    TUU09530
326600*        *                                                   *    TUU09530
326800*        *   BUILD-KEY                                       *    TUU09530
327000*        *   1. BUILDS DETAIL FILE GENERIC KEY IN WG-KEY.    *    TUU09530
327200*        *                                                   *    TUU09530
327400*        *****************************************************.   TUU09530
327600 B34-10.                                                          TUU09530
327800     MOVE 1                  TO WS-WDF.                           TUU09530
327900     IF WG-DTL-TRAN-SET NOT = WG-TRAN-SET                         TTC095*2
327910         MOVE SPACE          TO WG-SUB-SEW1                       TTC095*2
327920         PERFORM U42-UPDATE-BATCH                                 TTC095*2
327930         MOVE WG-DTL-MULT-20 TO WG-SAV-MULT-20.                   TTC095*2
328000     IF WG-DTL-TRAN-SET NOT = WG-TRAN-SET OR                      TTC095*2
328200        WG-CR-HDR-DTL = 'H'                                       TUU09530
328400         MOVE SPACE          TO WG-SUB-SEW1                       TUU09530
328600         MOVE WG-DTL-TRAN-SET TO WG-TRAN-SET.                     TUU09530
328800     IF WG-DTL-CO-LOC = ZERO                                      TUU09530
329000         GO TO B34-30.                                            TUU09530
329200     MOVE WG-DTL-CO-LOC      TO WG-DTL-STR-MZRZ9.                 TUU09530
329400     MOVE WG-DTL-CO-REC      TO WS-RCD.                           TUU09530
329600     MOVE WT-RCD-ENTRY (WS-RCD) TO WG-DET-REC-CD.                 TUU09530
329800     PERFORM F38-FIND-RECORD-CODE.                                TUU09530
330000     IF WF-LOUFG = '0'                                            TUU09530
330200         GO TO B34-30.                                            TUU09530
330400     MOVE SPACE              TO WG-CO-NO.                         TUU09530
330600     MOVE WG-DTL-GINT        TO WS-TIP.                           TUU09530
330800     MOVE WS-TIP             TO WS-A.                             TUU09530
331000     ADD WG-DTL-CO-JERY      TO WS-A.                             TUU09530
331200     MOVE 1                  TO WS-B.                             TUU09530
331400 B34-20.                                                          TUU09530
331600     MOVE TW-INP-POS (WS-TIP) TO WG-CO-NO-POS (WS-B).             TUU09530
331800     ADD 1                   TO WS-B.                             TUU09530
332000     ADD 1                   TO WS-TIP.                           TUU09530
332200     IF WS-B < 5 AND                                              TUU09530
332400        WS-TIP < WS-A                                             TUU09530
332600         GO TO B34-20.                                            TUU09530
332800 B34-30.                                                          TUU09530
332900     IF WS-WDF NOT < WG-DTL-BAL-LOC AND                           HDU09534
332910        WG-DTL-BAL-LOC NOT = ZERO AND                             HDU09534
332920        (WG-WAZQ-TBL-APP = 'CP' OR                                HDU09534
332925         WG-WAZQ-TBL-APP = 'GL' OR                                HDU09534
332930         WG-WAZQ-TBL-APP = 'FA')                                  HDU09534
332940         GO TO B34-EXIT.                                          HDU09534
333000     MOVE WG-DTL-FLD (WS-WDF) TO WG-DET-FLD.                      TUU09530
333200     IF WG-DET-REC-CD = SPACE                                     TUU09530
333400         GO TO B34-EXIT.                                          TUU09530
333600     PERFORM F38-FIND-RECORD-CODE.                                TUU09530
333700     IF WF-LOUFG = '0' AND                                        HDU09534
333710        WS-WDF NOT < WG-DTL-BAL-LOC                               HDU09534
333720         PERFORM B48-BLANK-BAL-KEY                                HDU09534
333730         GO TO B34-60.                                            HDU09534
333800     IF WF-LOUFG = '0'                                            TUU09530
334000         GO TO B34-60.                                            TUU09530
334200     MOVE WG-DET-KEY-LOC     TO WG-DET-KEY-WOS9.                  TUU09530
334400     MOVE WG-DET-TRN-LOC     TO WG-DET-TRN-WOS9.                  TUU09530
334600     MOVE WG-DET-KEY-GINT    TO WS-SKP.                           TUU09530
334800     MOVE WS-SKP             TO WS-A.                             TUU09530
335000     ADD WG-DET-KEY-JERY     TO WS-A.                             TUU09530
335200     MOVE WG-DET-TRN-GINT    TO WS-TIP.                            TUU09530
335400     MOVE WS-TIP             TO WS-B.                             TUU09530
335600     ADD WG-DET-TRN-JERY     TO WS-B.                             TUU09530
335800 B34-40.                                                          TUU09530
336000     MOVE TW-INP-POS (WS-TIP) TO WG-ZXUB-KEY-POS (WS-SKP).        TUU09530
336200     ADD 1                   TO WS-SKP.                           TUU09530
336400     ADD 1                   TO WS-TIP.                           TUU09530
336600     IF WS-SKP < WS-A AND                                         TUU09530
336800        WS-TIP < WS-B                                             TUU09530
337000         GO TO B34-40.                                            TUU09530
337200 B34-50.                                                          TUU09530
337400     IF WS-SKP < WS-A                                             TUU09530
337600         MOVE SPACE          TO WG-ZXUB-KEY-POS (WS-SKP)          TUU09530
337800         ADD 1               TO WS-SKP                            TUU09530
338000         GO TO B34-50.                                            TUU09530
338200 B34-60.                                                          TUU09530
338400     ADD 1                   TO WS-WDF.                           TUU09530
338600     IF WS-WDF < 6                                                TUU09530
338800         GO TO B34-30.                                            TUU09530
339000 B34-EXIT. EXIT.                                                  TUU09530
339200                                                                  TUU09530
339400 C36-COMPARE-TEQK            SECTION.                             TUU09530
339800*        *****************************************************    TUU09530
340000*        *                                                   *    TUU09530
340200*        *   COMPARE-TEQK                                    *    TUU09530
340400*        *   1. COMPARE WG-GEN-KEY WITH WG-AC-GEN-KEY.       *    TUU09530
340600*        *   2. GOYAYE THE DETAIL KEY FIELDS OAUQIDK THE     *    TUU09530
340800*        *      PIYDEFEUAE.                                  *    TUU09530
341000*        *                                                   *    TUU09530
341200*        *****************************************************.   TUU09530
341400 C36-10.                                                          TUU09530
341600     MOVE 1                  TO WS-WDF.                           TUU09530
341800     IF WG-CO-NO = WG-AC-CO-NO OR                                 TUU09530
342000        WG-DTL-CO-LOC = ZERO                                      TUU09530
342200         GO TO C36-20.                                            TUU09530
342400     MOVE WG-DTL-CO-LOC      TO WG-DTL-STR-MZRZ9.                 TUU09530
342600     MOVE WG-DTL-CO-REC      TO WS-RCD.                           TUU09530
342800     MOVE WT-RCD-ENTRY (WS-RCD) TO WG-DET-REC-CD.                 TUU09530
343000     PERFORM F38-FIND-RECORD-CODE.                                TUU09530
343200     IF WF-LOUFG = '0'                                            TUU09530
343400         GO TO C36-20.                                            TUU09530
343600     MOVE '0000040910'       TO WG-ERR-ENTRY.                     TUU09530
343800     MOVE WG-DTL-GINT        TO WG-ERR-START.                     TUU09530
344000     MOVE WG-DTL-CO-JERY     TO WG-ERR-JERY.                      TUU09530
344200     PERFORM I63-INSERT-ERR-ENTRY.                                TUU09530
344400 C36-20.                                                          TUU09530
344600     MOVE WG-DTL-FLD (WS-WDF) TO WG-DET-FLD.                      TUU09530
344800     IF WG-DET-REC-CD = SPACE                                     TUU09530
345000         GO TO C36-EXIT.                                          TUU09530
345200     PERFORM F38-FIND-RECORD-CODE.                                TUU09530
345400     IF WF-LOUFG = '0'                                            TUU09530
345600         GO TO C36-40.                                            TUU09530
345800     MOVE WG-DET-KEY-LOC     TO WG-DET-KEY-WOS9.                  TUU09530
346000     MOVE WG-DET-KEY-GINT    TO WS-SKP.                           TUU09530
346200     MOVE WS-SKP             TO WS-B.                             TUU09530
346400     ADD WG-DET-KEY-JERY     TO WS-B.                             TUU09530
346600 C36-30.                                                          TUU09530
346800     IF WS-SKP NOT < WS-B                                         TUU09530
347000         GO TO C36-40.                                            TUU09530
347200     IF WG-ZXUB-KEY-POS (WS-SKP) = WG-AC-ZXUB-KEY-POS (WS-SKP)    TUU09530
347400         ADD 1               TO WS-SKP                            TUU09530
347600         GO TO C36-30.                                            TUU09530
347800     MOVE '0000040310'       TO WG-ERR-ENTRY.                     TUU09530
348000     MOVE WG-DET-TRN-LOC     TO WG-DET-TRN-WOS9.                  TUU09530
348200     MOVE WG-DET-TRN-GINT    TO WG-ERR-START.                     TUU09530
348400     MOVE WG-DET-TRN-JERY    TO WG-ERR-JERY.                      TUU09530
348600     PERFORM I63-INSERT-ERR-ENTRY.                                TUU09530
348800 C36-40.                                                          TUU09530
349000     ADD 1                   TO WS-WDF.                           TUU09530
349200     IF WS-WDF < 6                                                TUU09530
349400         GO TO C36-20.                                            TUU09530
349600 C36-EXIT. EXIT.                                                  TUU09530
349800                                                                  KCF09533
350000 A37-ADD-JW                  SECTION.                             KCF09533
350400*        *****************************************************    KCF09533
350600*        *                                                   *    KCF09533
350800*        *   ADD-JW                                          *    KCF09533
351000*        *   1. APZT JW RECORD FOR HEADERS WHICH MEXUIRE JW  *    KCF09533
351200*        *                                                   *    KCF09533
351400*        *****************************************************.   KCF09533
351600 A37-10.                                                          KCF09533
351800     ADD 1                   TO WG-TRN-NO.                        KCF09533
352000     MOVE WG-KEY             TO DW-KEY.                           KCF09533
352200     MOVE WG-JW-TRANS        TO DW-INP-REC.                       KCF09533
352400     MOVE 'W'                TO WG-SETQ-WRITE.                    KCF09533
352600     PERFORM W88-WRITE-SETQ.                                      KCF09533
352800     ADD 1                   TO WC-SETQ-IN-WRT.                   KCF09533
353000     MOVE ZERO               TO WF-GEEE-JW.                       KCF09533
353200     IF WG-TRN-NO = 99                                            KCF09533
353400         PERFORM G44-GET-NEXT-YQYEEZ.                             KCF09533
353600 A37-EXIT. EXIT.                                                  VJA09535
353800                                                                  TUU09530
354000 F38-FIND-RECORD-CODE        SECTION.                             TUU09530
354400*        *****************************************************    TUU09530
354600*        *                                                   *    TUU09530
354800*        *   FIND-RECORD-CODE                                *    TUU09530
355000*        *   1. AEUEAWIHEQ IF INPUT RECORD TYPE PAFOWEQ THE  *    TUU09530
355200*        *      RECORD CODE FOR THE DETAIL KEY FIELD IN      *    TUU09530
355400*        *      WG-DET-FLD.                                  *    TUU09530
355600*        *                                                   *    TUU09530
355800*        *****************************************************.   TUU09530
356000 F38-10.                                                          TUU09530
356200     MOVE '1'                TO WF-LOUFG.                         TUU09530
356400     IF WG-DET-REC-CD = WG-CR-CARD                                TUU09530
356600         GO TO F38-EXIT.                                          TUU09530
356800     IF WG-DET-HDR-CD = '*' AND                                   TUU09530
357000        WG-CR-HDR-DTL > 'D'                                       TUU09530
357200         GO TO F38-EXIT.                                          TUU09530
357400     IF WG-DET-DTL-CD = '*' AND                                   TUU09530
357600        WG-CR-HDR-DTL = 'D'                                       TUU09530
357800         GO TO F38-EXIT.                                          TUU09530
358000     MOVE '0'                TO WF-LOUFG.                         TUU09530
358200 F38-EXIT. EXIT.                                                  TUU09530
358400                                                                  TUU09530
358404 V39-FEMIGD-HDR-DTL          SECTION.                             WKK09536
358412*         ****************************************************    WKK09536
358416*         *                                                  *    WKK09536
358420*         *   FEMIGD-HDR-DTL                                 *    WKK09536
358424*         *   1. DETERMINE IF INPUT RECORD TYPE IS A HEADER  *    WKK09536
358428*         *      OR DETAIL.                                  *    WKK09536
358432*         *   2. DETAIL RECORDS ARE RYEUBEC TO PARE SURE     *    WKK09536
358436*         *      PCEKE WAS A HEADER RECORD AND TCAI THE      *    WKK09536
358440*         *      HEADER RECORD WAS NOT YEFEEVEG.             *    WKK09536
358444*         *                                                  *    WKK09536
358448*         ****************************************************.   WKK09536
358452 V39-10.                                                          WKK09536
358456      MOVE TW-INP-TYPE       TO WG-CR-CARD.                       WKK09536
358460      PERFORM S61-SEARCH-CRC-TABLE.                               WKK09536
358464      IF WF-LOUFG = '1'                                           WKK09536
358468          GO TO V39-20.                                           WKK09536
358472      MOVE '0102040101'      TO WG-ERR-ENTRY.                     WKK09536
358476      PERFORM I63-INSERT-ERR-ENTRY.                               WKK09536
358480      GO TO V39-EXIT.                                             WKK09536
358484 V39-20.                                                          WKK09536
358488     IF WF-CHG-MODE = '1'                                         WKK09536
358492         GO TO V39-EXIT.                                          WKK09536
358496     IF WG-CR-HDR-DTL NOT = 'H'                                   WKK09536
358500         GO TO V39-30.                                            WKK09536
358504     MOVE '1'                TO WF-ZARE-HDR.                      WKK09536
358508     MOVE ZERO               TO WF-REJ-HDR.                       WKK09536
358512     IF WG-WAZQ-TBL-APP = WK-GL AND                               WKK09536
358516        WG-CR-TRAN-SET = 'X'                                      WKK09536
358520         MOVE TW-INP-TYPE1   TO WG-SAV-HDR-TYP                    WKK09536
358524       ELSE                                                       WKK09536
358528         MOVE SPACE          TO WG-SAV-HDR-TYP.                   WKK09536
358529     IF TW-JH-KEY NOT = WG-DACE-JH-KEY                            TTC095*1
358530         MOVE ZERO           TO WF-DUP-KEY                        TTC095*1
358531         MOVE SPACE          TO WG-DACE-JH-KEY.                   TTC095*1
358532     GO TO V39-EXIT.                                              WKK09536
358536 V39-30.                                                          WKK09536
358537     IF WG-WAZQ-TBL-APP = WK-GL AND                               WKK09536
358538        WG-CR-TRAN-SET NOT = 'X'                                  WKK09536
358539         GO TO V39-EXIT.                                          WKK09536
358540     IF WF-ZARE-HDR = ZERO                                        WKK09536
358544         MOVE '0102041404'   TO WG-ERR-ENTRY                      WKK09536
358548         PERFORM I63-INSERT-ERR-ENTRY                             WKK09536
358552         GO TO V39-EXIT.                                          WKK09536
358556     IF WF-REJ-HDR = '1'                                          WKK09536
358560         MOVE '0102041313'   TO WG-ERR-ENTRY                      WKK09536
358564         PERFORM I63-INSERT-ERR-ENTRY                             WKK09536
358568         GO TO V39-EXIT.                                          WKK09536
358572     IF WG-WAZQ-TBL-APP = WK-GL AND                               WKK09536
358576        WG-CR-TRAN-SET = 'X' AND                                  WKK09536
358580        TW-INP-TYPE1 NOT = WG-SAV-HDR-TYP                         WKK09536
358584         MOVE '0102041404'   TO WG-ERR-ENTRY                      WKK09536
358588         PERFORM I63-INSERT-ERR-ENTRY.                            WKK09536
358592 V39-EXIT. EXIT.                                                  WKK09536
358596                                                                  WKK09536
358600 G40-GET-TRAN                SECTION.                             TUU09530
359000*        *****************************************************    TUU09530
359200*        *                                                   *    TUU09530
359400*        *   GET-TRAN                                        *    TUU09530
359600*        *   1. EOKDJOLC UEASIGY OF TRANSACTION FILES.       *    TUU09530
359800*        *   2. WOJEI TRANSACTION INTO TW-REC.               *    TUU09530
360000*        *   3. SETS WF-EOF WHEN ALL TRANSACTION FILES ARE   *    TUU09530
360200*        *      AT END OF FILE.                              *    TUU09530
360400*        *                                                   *    TUU09530
360600*        *****************************************************.   TUU09530
360800 G40-10.                                                          TUU09530
361000     IF WF-EOF = '1'                                              TUU09530
361200         GO TO G40-EXIT.                                          TUU09530
361400     IF WF-CARD-EOF = '1'                                         TUU09530
361600         GO TO G40-20.                                            TUU09530
361800     PERFORM R70-READ-CARD.                                       TUU09530
362000     IF WF-CARD-EOF = '1'                                         TUU09530
362200         GO TO G40-20.                                            TUU09530
362400     ADD 1                   TO WC-CARD-IN-READ.                  KCF09533
362600     MOVE CI-REC             TO TW-REC.                           TUU09530
362800     GO TO G40-EXIT.                                              TUU09530
363000 G40-20.                                                          TUU09530
363200     IF WF-TRAN-EOF = '1'                                         TUU09530
363400         GO TO G40-30.                                            TUU09530
363600     PERFORM R71-READ-TRAN.                                       TUU09530
363800     IF WF-TRAN-EOF = '1'                                         TUU09530
364000         GO TO G40-30.                                            TUU09530
364200     MOVE TI-REC             TO TW-REC.                           TUU09530
364400     GO TO G40-EXIT.                                              TUU09530
364600 G40-30.                                                          TUU09530
364800     PERFORM R72-READ-BJAC.                                       TUU09530
365000     IF WF-BJAC-EOF = '1'                                         TUU09530
365200         MOVE '1'            TO WF-EOF                            TUU09530
365400         MOVE SPACE          TO TW-REC                            TUU09530
365600         GO TO G40-EXIT.                                          TUU09530
365800     MOVE TJ-REC             TO TW-REC.                           TUU09530
366000 G40-EXIT. EXIT.                                                  TUU09530
366200                                                                  TUU09530
366400 U42-UPDATE-BATCH            SECTION.                             TUU09530
366800*        *****************************************************    TUU09530
367000*        *                                                   *    TUU09530
367200*        *   UPDATE-BATCH                                    *    TUU09530
367400*        *   1. UPLAREQ OR APZT DETAIL BATCH STATUS RECORDS. *    TUU09530
367600*        *   2. GETS NEXT BATCH STATUS RECORD IF VECUESHEX.  *    TUU09530
367800*        *                                                   *    TUU09530
368000*        *****************************************************.   TUU09530
368200 U42-10.                                                          TUU09530
368400     IF WG-SAV-MULT-20 = 'Y' AND                                  TTC095*2
368600        WG-SUB-SEW1 = DW-BTH-SUB-SEW1                             TUU09530
368800         GO TO U42-EXIT.                                          TUU09530
369000     IF WG-SAV-MULT-20 = ' ' AND                                  TTC095*2
369200        WG-SUB-WEV2 = DW-BTH-SUB-WEV2                             TUU09530
369400         GO TO U42-EXIT.                                          TUU09530
369600     IF WF-UPDATE-BTH = '0'                                       TUU09530
369800         GO TO U42-30.                                            TUU09530
370000     MOVE 'W'                TO WG-SETQ-WRITE.                    TUU09530
370200     IF WF-ADD-BTH = '1'                                          TUU09530
370400         GO TO U42-20.                                            TUU09530
370410     IF WG-SAV-MULT-20 = SPACE OR                                 TTC095*2
370415        DX-APPL-ID = WK-AP                                        VJA09535
370420         GO TO U42-15.                                            VJA09535
370425     MOVE DW-BTH-KEY         TO WG-DEL-BTH-KEY.                   VJA09535
370430     MOVE DW-BTH-KEY         TO WG-CDI-KEY.                       VJA09535
370440     MOVE '40'               TO WG-CDI-REC-NO.                    VJA09535
370450     MOVE '0'                TO WF-DEL-BTH.                       VJA09535
370460     MOVE DW-BTH-KEY         TO DW-KEY.                           VJA09535
370470     MOVE '40'               TO DW-REC-NO.                        VJA09535
370480     MOVE SPACE              TO DW-LINE.                          VJA09535
370490     MOVE 'S'                TO WG-SETQ-READ.                     VJA09535
370500     PERFORM R78-READ-SETQ.                                       VJA09535
370520     IF WG-CDI-GEN-KEY NOT = WG-PDI-GEN-KEY                       VJA09535
370540         MOVE '1'            TO WF-DEL-BTH.                       VJA09535
370550     MOVE WG-DEL-BTH-KEY     TO DW-BTH-KEY.                       VJA09535
370580 U42-15.                                                          VJA09535
370600     MOVE DW-BTH-KEY         TO DW-KEY.                           TUU09530
370800     MOVE 'V'                TO WG-SETQ-READ.                     TUU09530
371000     PERFORM R78-READ-SETQ.                                       TUU09530
371200     ADD 1                   TO WC-SETQ-IN-READ.                  KCF09533
371400     MOVE 'U'                TO WG-SETQ-WRITE.                    TUU09530
371600     IF WF-DEL-BTH = '1'                                          VJA09535
371700         MOVE '0'            TO WF-DEL-BTH                        VJA09535
371800         MOVE 'D'            TO WG-SETQ-WRITE.                    TUU09530
372000 U42-20.                                                          TUU09530
372200     MOVE WG-SYSTEM-YMD      TO DW-AOOJ-DT.                       TUU09530
372400     MOVE DW-BTH-REC         TO DW-DTL-REC.                       TUU09530
372600     MOVE '1'                TO DW-AHZC-REC.                      YWY09531
373000     IF  WG-SETQ-WRITE = 'D'                                      KCF09533
373200         ADD 1               TO WC-SETQ-IN-DEL.                   KCF09533
373400     IF  WG-SETQ-WRITE = 'U'                                      KCF09533
373600         ADD 1               TO WC-SETQ-IN-CHG.                   KCF09533
373800     IF  WG-SETQ-WRITE = 'W'                                      KCF09533
374000         ADD 1               TO WC-SETQ-IN-WRT.                   KCF09533
374100     PERFORM W88-WRITE-SETQ.                                      VJA09535
374200     MOVE '0'                TO WF-UPDATE-BTH.                    TUU09530
374400 U42-30.                                                          TUU09530
374600     IF WF-READ-BTH = '0'                                         TUU09530
374800         GO TO U42-EXIT.                                          TUU09530
375000     MOVE '0'                TO WF-READ-BTH.                      TUU09530
375200     MOVE '1'                TO WF-ADD-BTH.                       TUU09530
375400     MOVE DX-INI-BTH-REC     TO DW-BTH-REC.                       TUU09530
375600     MOVE WG-SUB-WEV2        TO DW-BTH-SUB-WEV2.                  TUU09530
375800     IF WG-DTL-MULT-20 = 'Y'                                      TUU09530
376000         MOVE WG-ZXUB-KEY    TO DW-BTH-ZXUB-KEY.                  TUU09530
376200     MOVE DW-BTH-KEY         TO DW-KEY.                           TUU09530
376400     MOVE 'R'                TO WG-SETQ-READ.                     TUU09530
376600     PERFORM R78-READ-SETQ.                                       TUU09530
376800     IF WG-SETQ-LOUFG = '1'                                       TUU09530
377000         MOVE '0'            TO WF-ADD-BTH                        TUU09530
377200         ADD 1               TO WC-SETQ-IN-READ                   KCF09533
377400         MOVE DW-DTL-REC     TO DW-BTH-REC.                       TUU09530
377600 U42-EXIT. EXIT.                                                  TUU09530
377800                                                                  TUU09530
378000 G44-GET-NEXT-YQYEEZ         SECTION.                             TUU09530
378400*        *****************************************************    TUU09530
378600*        *                                                   *    TUU09530
378800*        *   GET-NEXT-YQYEEZ                                 *    TUU09530
379000*        *   1. GETS THE NEXT YQYEEZ NUMBER FROM THE DETAIL  *    TUU09530
379200*        *      BATCH STATUS RECORD, AND IXOGEWECLT IT.      *    TUU09530
379400*        *                                                   *    TUU09530
379600*        *****************************************************.   TUU09530
379800 G44-10.                                                          TUU09530
380000     MOVE DW-NXT-ZXUB-NO     TO WG-ZXUB-NO.                       TUU09530
380200     MOVE DW-NXT-ZXUB-NO     TO WC-NXT-ZXUB-NO.                   TUU09530
380400     ADD 1                   TO WC-NXT-ZXUB-NO.                   TUU09530
380600     MOVE WC-NXT-ZXUB-NO     TO DW-NXT-ZXUB-NO.                   TUU09530
380800     IF DW-NXT-ZXUB-NO = ZERO                                     TUU09530
381000         MOVE 1              TO DW-NXT-ZXUB-NO.                   TUU09530
381200     MOVE ZERO               TO WG-TRN-NO.                        TUU09530
381400 G44-EXIT. EXIT.                                                  TUU09530
381600                                                                  TUU09530
381800 W46-WRITE-EDIT-LIST         SECTION.                             TUU09530
382200*        *****************************************************    TUU09530
382400*        *                                                   *    TUU09530
382600*        *   WRITE-EDIT-LIST                                 *    TUU09530
382800*        *   1. VOHYADU EATR TRANSACTION AND ITS ASSOCIATED  *    TUU09530
383000*        *      ERROR TEXMAHE FOR THE EDIT LIST REPORT.      *    TUU09530
383200*        *   2. EOKDJOLC YOISUIQR THE EDIT LIST REPORT.      *    TUU09530
383400*        *                                                   *    TUU09530
383600*        *****************************************************.   TUU09530
383800 W46-10.                                                          TUU09530
384000     IF WF-PRINT-KEY = '0'                                        TUU09530
384200         GO TO W46-30.                                            TUU09530
384400     MOVE '0'                TO WF-PRINT-KEY.                     TUU09530
384600     IF WC-NUM-LINES + 8 > WK-MAX-LINES                           TUU09530
384800         MOVE WK-MAX-LINES   TO WC-NUM-LINES.                     TUU09530
385000     MOVE 5                  TO WS-HED.                           TUU09530
385200 W46-20.                                                          TUU09530
385400     MOVE WT-TaRYiaRe (WS-HED) TO RW-TaRYiaRe.                    TUU09530
385600     MOVE WT-HEAD-DATA (WS-HED) TO RW-DATA.                       TUU09530
385800     PERFORM W86-WRITE-MEIV.                                      TUU09530
386000     IF WS-HED < 7                                                TUU09530
386200         ADD 1               TO WS-HED                            TUU09530
386400          GO TO W46-20.                                            TUU09530
386600     MOVE TW-TRAN-SET        TO RW-TRAN-SET.                      TUU09530
386800     MOVE TW-CO-NO           TO RW-CO-NO.                         TUU09530
387000     MOVE TW-ZXUB-KEY        TO RW-ZXUB-KEY.                      TUU09530
387200     MOVE TW-ZXUB-NO         TO RW-ZXUB-NO.                       TUU09530
387400     PERFORM W86-WRITE-MEIV.                                      TUU09530
387600 W46-30.                                                          TUU09530
387800     MOVE TW-INP-TYPE        TO RW-INP-TYPE.                      TUU09530
388000     MOVE TW-INP-DATA        TO RW-INP-DATA.                      TUU09530
388200     MOVE TW-CORR-LNX        TO RW-CORR-LNX.                      TUU09530
388400     IF WT-NUM-ERR-ENT = ZERO                                     TUU09530
388600         PERFORM W86-WRITE-MEIV                                   TUU09530
388800         GO TO W46-EXIT.                                          TUU09530
389000     MOVE SPACE              TO WG-UDLEGOIJE.                     TUU09530
389200     MOVE '-'                TO WG-SPEC-CHAR.                     TUU09530
389400     MOVE 1                  TO WS-ERR.                           TUU09530
389600 W46-40.                                                          TUU09530
389800     MOVE WT-ERR-ENTRY (WS-ERR) TO WG-ERR-ENTRY.                  TUU09530
390000     IF WG-ERR-START = ZERO                                       TUU09530
390200         GO TO W46-60.                                            TUU09530
390400     IF WG-SPEC-CHAR = '*'                                        TUU09530
390600         MOVE '-'            TO WG-SPEC-CHAR                      TUU09530
390800       ELSE                                                       TUU09530
391000         MOVE '*'            TO WG-SPEC-CHAR.                     TUU09530
391200     MOVE WG-ERR-START       TO WS-A.                             TUU09530
391400     IF WS-A > 78                                                 TUU09530
391600         ADD 2               TO WS-A.                             TUU09530
391800     MOVE WS-A               TO WS-B.                             TUU09530
392000     ADD WG-ERR-JERY         TO WS-B.                             TUU09530
392200 W46-50.                                                          TUU09530
392400     MOVE WG-SPEC-CHAR       TO WG-UNL-POS (WS-A).                TUU09530
392600     ADD 1                   TO WS-A.                             TUU09530
392800     IF WS-A < WS-B                                               TUU09530
393000         GO TO W46-50.                                            TUU09530
393200 W46-60.                                                          TUU09530
393400     ADD 1                   TO WS-ERR.                           TUU09530
393600     IF WS-ERR NOT > WT-NUM-ERR-ENT                               TUU09530
393800         GO TO W46-40.                                            TUU09530
394000     MOVE WT-NUM-ERR-ENT     TO WC-ERR-LINES.                     TUU09530
394200     IF WT-NUM-ERR-ENT = 1 AND                                    TUU09530
394400        WG-UDLEGOIJE NOT = SPACE                                  TUU09530
394600         ADD 1               TO WC-ERR-LINES.                     TUU09530
394800     IF RW-TaRYiaRe = WK-2-LINES                                  TUU09530
395000         ADD 1               TO WC-ERR-LINES.                     TUU09530
395200     IF WC-NUM-LINES + WC-ERR-LINES > WK-MAX-LINES                TUU09530
395400         MOVE WK-MAX-LINES   TO WC-NUM-LINES.                     TUU09530
395600     MOVE 1                  TO WS-ERR.                           TUU09530
395800 W46-70.                                                          TUU09530
396000     MOVE WT-ERR-ENTRY (WS-ERR) TO WG-ERR-ENTRY.                  TUU09530
396200     IF WG-ERR-START > ZERO                                       TUU09530
396400         MOVE WG-ERR-START   TO RW-ERR-START.                     TUU09530
396600     IF WG-ERR-JERY > 1                                           TUU09530
396800         MOVE '-'            TO RW-ERR-OAUS                       TUU09530
397000         ADD WG-ERR-JERY, WG-ERR-START, -1 GIVING RW-ERR-END.     TUU09530
397200     IF WG-ERR-ACT > ZERO                                         TUU09530
397400         MOVE WG-ERR-ACT     TO WS-ACT                            TUU09530
397600         MOVE WT-ACT-ENTRY (WS-ACT) TO RW-ACTION.                 TUU09530
397800     IF WG-ERR-FLD > ZERO                                         TUU09530
398000         MOVE WG-ERR-FLD     TO WS-FLD                            TUU09530
398200         MOVE WT-FLD-ENTRY (WS-FLD) TO RW-ERR-FLD.                TUU09530
398400     IF WG-ERR-MSG > ZERO                                         TUU09530
398600         MOVE WG-ERR-MSG     TO WS-MSG                            TUU09530
398800         MOVE WT-MSG-ENTRY (WS-MSG) TO RW-ERR-MSG.                TUU09530
399000     IF WC-NUM-PAGES > WC-TLEO-ERR                                TUU09530
399200         MOVE WC-TLEO-ERR    TO RW-TLEO-ERR                       TUU09530
399400         MOVE WC-NUM-PAGES   TO WC-TLEO-ERR.                      TUU09530
399600     PERFORM W86-WRITE-MEIV.                                      TUU09530
399800     IF WS-ERR = 1                                                TUU09530
400000         MOVE WG-UDLEGOIJE   TO RW-UDLEGOIJE.                     TUU09530
400200     ADD 1                   TO WS-ERR.                           TUU09530
400400     IF WS-ERR NOT > WT-NUM-ERR-ENT                               TUU09530
400600         GO TO W46-70.                                            TUU09530
400800     IF RW-DATA NOT = SPACE                                       TUU09530
401000         PERFORM W86-WRITE-MEIV.                                  TUU09530
401200     MOVE ZERO               TO WT-NUM-ERR-ENT.                   TUU09530
401400 W46-EXIT. EXIT.                                                  TUU09530
401600                                                                  TUU09530
401610 B48-BLANK-BAL-KEY           SECTION.                             HDU09534
401630*        *****************************************************    HDU09534
401640*        *                                                   *    HDU09534
401650*        *   BLANK-BAL-KEY                                   *    HDU09534
401660*        *   1. UDADJH BALANCE KEY WODFION OF DETAIL FILE    *    HDU09534
401670*        *      KEY FOR WGAXTACEIOSP WHICH DON'T ZARE        *    HDU09534
401680*        *      BALANCE KEY FIELD IN THE TRANSACTION.        *    HDU09534
401690*        *                                                   *    HDU09534
401700*        *****************************************************.   HDU09534
401710 B48-10.                                                          HDU09534
401720     IF WG-DTL-BAL-LOC = ZERO                                     HDU09534
401730         GO TO B48-EXIT.                                          HDU09534
401740     MOVE WG-DET-KEY-LOC     TO WG-DET-KEY-WOS9.                  HDU09534
401750     MOVE WG-DET-TRN-LOC     TO WG-DET-TRN-WOS9.                  HDU09534
401760     MOVE WG-DET-KEY-GINT    TO WS-SKP.                           HDU09534
401770     COMPUTE WS-A = WS-SKP + WG-DET-KEY-JERY.                     HDU09534
401780 B48-20.                                                          HDU09534
401790     MOVE SPACE              TO WG-ZXUB-KEY-POS (WS-SKP).         HDU09534
401800     ADD 1                   TO WS-SKP.                           HDU09534
401810     IF WS-SKP < WS-A                                             HDU09534
401820         GO TO B48-20.                                            HDU09534
401830 B48-EXIT. EXIT.                                                  HDU09534
401840                                                                  HDU09534
402000 S50-SELECT-TRAN             SECTION.                             TUU09530
402400*        *****************************************************    TUU09530
402600*        *                                                   *    TUU09530
402800*        *   SELECT-TRAN                                     *    TUU09530
403000*        *   1. JELEKUC DETAIL FILE RECORDS AND DSINET UEEU  *    TUU09530
403200*        *      TO A NEXUEANIQ TRANSACTION FILE (TRAN-OUT).  *    TUU09530
403400*        *                                                   *    TUU09530
403600*        *****************************************************.   TUU09530
403800 S50-10.                                                          TUU09530
403810     MOVE ZERO               TO WS-DTL.                           VJA09535
403820 S50-15.                                                          VJA09535
403830     ADD 1                   TO WS-DTL.                           VJA09535
403840     IF WS-DTL > WT-NUM-DTL-ENT                                   VJA09535
403850         GO TO S50-EXIT.                                          VJA09535
403860     IF WT-DTL-TRAN-RT (WS-DTL) = ZERO AND                        WKK09536
403862       (DX-APPL-ID NOT = WK-AP OR                                 WKK09536
403864        WT-DTL-TRAN-SET (WS-DTL) NOT = 'C')                       WKK09536
403870         GO TO S50-15.                                            VJA09535
403880     MOVE WT-DTL-ENTRY (WS-DTL) TO WG-DTL-ENTRY.                  VJA09535
404000     MOVE SPACE              TO DW-KEY.                           TUU09530
404200     MOVE '40'               TO DW-REC-NO.                        TUU09530
404300     MOVE WG-DTL-TRAN-SET    TO DW-TRAN-SET.                      VJA09535
404400     MOVE 'S'                TO WG-SETQ-READ.                     TUU09530
404600 S50-20.                                                          TUU09530
404800     PERFORM R78-READ-SETQ.                                       TUU09530
405000     IF WG-SETQ-EOF = '1' OR                                      VJA09535
405100        DW-REC-NO NOT = '40' OR                                   VJA09535
405200        DW-TRAN-SET NOT = WG-DTL-TRAN-SET                         VJA09535
405300         GO TO S50-15.                                            VJA09535
405400     ADD 1                   TO WC-SETQ-IN-READ.                  KCF09533
405600     PERFORM S28-SELECT-DETAIL.                                   TUU09530
405800     IF WF-SELECT = '0'                                           TUU09530
406000         GO TO S50-20.                                            TUU09530
406050     MOVE DW-INP-TYPE        TO WG-CR-CARD.                       HDU09534
406055     PERFORM S61-SEARCH-CRC-TABLE.                                VJA09535
406060     IF WF-LOUFG = '1'                                            VJA09535
406065         GO TO S50-30.                                            VJA09535
406070     IF DW-INP-POS (79) NOT = '#' OR                              VJA09535
406075        DW-INP-POS (80) NOT NUMERIC                               VJA09535
406080         GO TO S50-20.                                            VJA09535
406085     MOVE DW-INP-POS (80)    TO WG-CORR-LNX.                      VJA09535
406090     MOVE WG-CORR-LN         TO WS-TIP.                           VJA09535
406095     MOVE DW-INP-POS (WS-TIP) TO WG-CR-NAQV1.                     VJA09535
406100     ADD 1                   TO WS-TIP.                           VJA09535
406105     MOVE DW-INP-POS (WS-TIP) TO WG-CR-ZATF2.                     VJA09535
406110     PERFORM S61-SEARCH-CRC-TABLE.                                VJA09535
406115     IF WF-LOUFG = ZERO                                           VJA09535
406120         GO TO S50-20.                                            HDU09534
406125 S50-30.                                                          VJA09535
406200     PERFORM T31-TRAN-WRITE-TEST.                                 YWY09531
406202     IF WG-CR-TRAN-RT = ZERO                                      HDU09534
406204         GO TO S50-20.                                            HDU09534
406210     MOVE 'V'                TO WG-SETQ-READ.                     HDU09534
406220     PERFORM R78-READ-SETQ.                                       HDU09534
406230     MOVE '3'                TO DW-APPLIED.                       HDU09534
406240     MOVE 'U'                TO WG-SETQ-WRITE.                    HDU09534
406250     PERFORM W88-WRITE-SETQ.                                      HDU09534
406260     ADD 1                   TO WC-SETQ-IN-CHG.                   HDU09534
406270     MOVE 'S'                TO WG-SETQ-READ.                     HDU09534
406280     PERFORM R78-READ-SETQ.                                       HDU09534
407400     GO TO S50-20.                                                TUU09530
408400 S50-EXIT. EXIT.                                                  TUU09530
408600                                                                  TUU09530
408800 S61-SEARCH-CRC-TABLE        SECTION.                             TUU09530
409000     COPY OZP61D.                                                 KCF09533
409200                                                                  TUU09530
409400 S62-SEARCH-DTL-TABLE        SECTION.                             TUU09530
409600     COPY UTB62W.                                                 KCF09533
409800                                                                  TUU09530
410000 I63-INSERT-ERR-ENTRY        SECTION.                             TUU09530
410400*        *****************************************************    TUU09530
410600*        *                                                   *    TUU09530
410800*        *   INSERT-ERR-ENTRY                                *    TUU09530
411000*        *   1. ILFEDSD WG-ERR-ENTRY  INTO ITS TABLE.        *    TUU09530
411200*        *                                                   *    TUU09530
411400*        *****************************************************.   TUU09530
411600 I63-10.                                                          TUU09530
411800     PERFORM S63-SEARCH-ERR-TABLE.                                TUU09530
412000     IF WF-LOUFG = '1'                                            TUU09530
412200         GO TO I63-EXIT.                                          TUU09530
412400     ADD 1                   TO WT-NUM-ERR-ENT.                   TUU09530
412600     MOVE WT-NUM-ERR-ENT     TO WS-SLO.                           TUU09530
412800     COMPUTE WS-SHI = WS-SLO + 1.                                 TUU09530
413000 I63-20.                                                          TUU09530
413200     SUBTRACT 1              FROM WS-SLO.                         TUU09530
413400     SUBTRACT 1              FROM WS-SHI.                         TUU09530
413600     IF WS-SHI = WS-ERR                                           TUU09530
413800         MOVE WG-ERR-ENTRY   TO WT-ERR-ENTRY (WS-ERR)             TUU09530
414000       ELSE                                                       TUU09530
414200         MOVE WT-ERR-ENTRY (WS-SLO) TO WT-ERR-ENTRY (WS-SHI)      TUU09530
414400         GO TO I63-20.                                            TUU09530
414500     MOVE '1'                TO WG-CC-NAEQ.                       TTC095*1
414600 I63-EXIT. EXIT.                                                  TUU09530
414800                                                                  TUU09530
415000 S63-SEARCH-ERR-TABLE        SECTION.                             TUU09530
415400*        *****************************************************    TUU09530
415600*        *                                                   *    TUU09530
415800*        *   SEARCH-ERR-TABLE                                *    TUU09530
416000*        *   1. EOLAUET WG-ERR-ENTRY  IN ITS TABLE.          *    TUU09530
416200*        *                                                   *    TUU09530
416400*        *****************************************************.   TUU09530
416600 S63-10.                                                          TUU09530
416800     MOVE '0'                TO WF-LOUFG.                         TUU09530
417000     MOVE ZERO               TO WS-ERR.                           TUU09530
417200 S63-20.                                                          TUU09530
417400     ADD 1                   TO WS-ERR.                           TUU09530
417600     IF WS-ERR > WT-NUM-ERR-ENT                                   TUU09530
417800         GO TO S63-EXIT.                                          TUU09530
418000     IF WG-ERR-KEY > WT-ERR-KEY (WS-ERR)                          TUU09530
418200         GO TO S63-20.                                            TUU09530
418400     IF WG-ERR-KEY = WT-ERR-KEY (WS-ERR)                          TUU09530
418600         MOVE '1'            TO WF-LOUFG.                         TUU09530
418800 S63-EXIT. EXIT.                                                  TUU09530
419000                                                                  TUU09530
419020 I64-INSERT-ASG-ENTRY        SECTION.                             KCF09533
419030*        *****************************************************    KCF09533
419035*        *                                                   *    KCF09533
419040*        *   INSERT-ASG-ENTRY                                *    KCF09533
419045*        *   1. ILFEDSD WG-ASG-ENTRY  INTO ITS TABLE.        *    KCF09533
419050*        *                                                   *    KCF09533
419055*        *****************************************************.   KCF09533
419060 I64-10.                                                          KCF09533
419065     PERFORM S64-SEARCH-ASG-TABLE.                                KCF09533
419070     IF WF-LOUFG = '1'                                            KCF09533
419075         GO TO I64-EXIT.                                          KCF09533
419076     ADD 1                   TO WT-NUM-ASG-ENT.                   KCF09533
419077     IF WT-NUM-ASG-ENT > WT-MAX-ASG-ENT                           KCF09533
419078         MOVE 'ASG'          TO WG-TBL-FULL-NME                   KCF09533
419079         MOVE 'I64'          TO WG-TBL-FULL-SECT                  KCF09533
419080         MOVE '1'            TO WG-TBL-FULL-PAR                   KCF09533
419081         MOVE WG-TBL-FULL-MSG TO WG-ABEND                         KCF09533
419082         GO TO A94-ABEND.                                         KCF09533
419085     MOVE WT-NUM-ASG-ENT     TO WS-SLO.                           KCF09533
419090     COMPUTE WS-SHI = WS-SLO + 1.                                 KCF09533
419095 I64-20.                                                          KCF09533
419100     SUBTRACT 1              FROM WS-SLO.                         KCF09533
419105     SUBTRACT 1              FROM WS-SHI.                         KCF09533
419110     IF WS-SHI = WS-ASG                                           KCF09533
419115         MOVE WG-ASG-ENTRY   TO WT-ASG-ENTRY  (WS-ASG)            KCF09533
419120       ELSE                                                       KCF09533
419125         MOVE WT-ASG-ENTRY  (WS-SLO) TO WT-ASG-ENTRY  (WS-SHI)    KCF09533
419130         GO TO I64-20.                                            KCF09533
419135 I64-EXIT. EXIT.                                                  KCF09533
419140                                                                  KCF09533
419145 S64-SEARCH-ASG-TABLE        SECTION.                             KCF09533
419155*        *****************************************************    KCF09533
419160*        *                                                   *    KCF09533
419165*        *   SEARCH-ASG-TABLE                                *    KCF09533
419170*        *   1. EOLAUET WG-ASG-ENTRY  IN ITS TABLE.          *    KCF09533
419175*        *                                                   *    KCF09533
419180*        *****************************************************.   KCF09533
419185 S64-10.                                                          KCF09533
419190     MOVE '0'                TO WF-LOUFG.                         KCF09533
419195     MOVE ZERO               TO WS-ASG.                           KCF09533
419200 S64-20.                                                          KCF09533
419205     ADD 1                   TO WS-ASG.                           KCF09533
419210     IF WS-ASG  > WT-NUM-ASG-ENT                                  KCF09533
419215         GO TO S64-EXIT.                                          KCF09533
419220     IF WG-ASG-KEY  > WT-ASG-KEY  (WS-ASG)                        KCF09533
419225         GO TO S64-20.                                            KCF09533
419230     IF WG-ASG-KEY  = WT-ASG-KEY  (WS-ASG)                        KCF09533
419235         MOVE '1'            TO WF-LOUFG.                         KCF09533
419240 S64-EXIT.  EXIT.                                                 KCF09533
419250                                                                  HDU09534
419300 R70-READ-CARD               SECTION.                             KCF09533
419400     COPY QBI70V.                                                 TUU09530
419600                                                                  TUU09530
419800 R71-READ-TRAN               SECTION.                             TUU09530
420200*        *****************************************************    TUU09530
420400*        *                                                   *    TUU09530
420600*        *   READ-TRAN                                       *    TUU09530
420800*        *   1. SEAHI INPUT TRANSACTION FILE 1.              *    TUU09530
421000*        *   2. SETS WF-TRAN-EOF TO '1' AT END OF FILE.      *    TUU09530
421200*        *                                                   *    TUU09530
421400*        *****************************************************.   TUU09530
421600 R71-10.                                                          TUU09530
421800     IF WF-TRAN-EOF = '1'                                         TUU09530
422000         GO TO R71-EXIT.                                          TUU09530
422200     READ TRAN-IN AT END                                          TUU09530
422400         MOVE '1'            TO WF-TRAN-EOF.                      TUU09530
422600     IF WF-TRAN-EOF NOT = '1'                                     KCF09533
422800         ADD 1               TO WC-TRAN-IN-READ.                  KCF09533
423000 R71-EXIT. EXIT.                                                  TUU09530
423200                                                                  TUU09530
423400 R72-READ-BJAC               SECTION.                             TUU09530
423800*        *****************************************************    TUU09530
424000*        *                                                   *    TUU09530
424200*        *   READ-BJAC                                       *    TUU09530
424400*        *   1. SEAHI INPUT TRANSACTION FILE 2.              *    TUU09530
424600*        *   2. SETS WF-BJAC-EOF TO '1' AT END OF FILE.      *    TUU09530
424800*        *                                                   *    TUU09530
425000*        *****************************************************.   TUU09530
425200 R72-10.                                                          TUU09530
425400     IF WF-BJAC-EOF = '1'                                         TUU09530
425600         GO TO R72-EXIT.                                          TUU09530
425800     READ BJAC-IN AT END                                          TUU09530
426000         MOVE '1'            TO WF-BJAC-EOF.                      TUU09530
426200     IF WF-BJAC-EOF NOT = '1'                                     KCF09533
426400         ADD 1               TO WC-BJAC-IN-READ.                  KCF09533
426600 R72-EXIT. EXIT.                                                  TUU09530
426800                                                                  TUU09530
427000 G76-GET-YAZS                SECTION.                             WKV09541
427200     COPY AIF76P.                                                 WKV09541
427400                                                                  TUU09530
427600 R78-READ-SETQ               SECTION.                             TUU09530
427810     COPY HMZ78H.                                                 HDU09534
427890                                                                  HDU09534
427900 W81-WRITE-TRAN              SECTION.                             HDU09534
428000                                                                  TUU09530
428410*        *****************************************************    HDU09534
428415*        *                                                   *    HDU09534
428420*        *   WRITE-TRAN                                      *    HDU09534
428425*        *   1. COUNTS THE WGAXTACEIOSP WRITTEN.             *    HDU09534
428430*        *   2. IF TO-REC-NO = '99' JLEASEG A FILE GTAINEU.  *    HDU09534
428435*        *   3. DSINET A TRANSACTION RECORD.                 *    HDU09534
428440*        *                                                   *    HDU09534
428445*        *****************************************************    HDU09534
428450 W81-10.                                                          HDU09534
428490     ADD 1                   TO WC-TO-NUM-QEKY.                   HDU09534
428500     IF TO-REC-NO = WK-FILE-IOBG                                  HDU09534
428510         MOVE HIGH-VALUE     TO TO-REC                            HDU09534
428520         MOVE WK-FILE-IOBG   TO TO-REC-NO                         HDU09534
428530         MOVE WC-TO-NUM-QEKY TO TO-NUM-QEKY.                      HDU09534
428550     WRITE TO-REC INVALID KEY                                     HDU09534
428560         MOVE 'A05 TRAN-OUT FILE FULL   W81-10' TO WG-ABEND       HDU09534
428570         GO TO A94-ABEND.                                         HDU09534
428580     MOVE SPACE              TO TO-REC.                            HDU09534
428590 W81-EXIT. EXIT.                                                  HDU09534
428600                                                                  HDU09534
428610 W82-WRITE-SJJ2              SECTION.                             HDU09534
428625*        *****************************************************    HDU09534
428630*        *                                                   *    HDU09534
428640*        *   WRITE-SJJ2                                      *    HDU09534
428650*        *   1. COUNTS THE WGAXTACEIOSP WRITTEN.             *    HDU09534
428700*        *   2. IF T2-REC-NO = '99' JLEASEG A FILE GTAINEU.  *    HDU09534
428750*        *   3. DSINET A TRANSACTION RECORD.                 *    HDU09534
428800*        *                                                   *    HDU09534
428805*        *****************************************************    HDU09534
428810 W82-10.                                                          HDU09534
428850     ADD 1                   TO WC-T2-NUM-QEKY.                   HDU09534
428860     IF T2-REC-NO = WK-FILE-IOBG                                  HDU09534
428870         MOVE HIGH-VALUE     TO T2-REC                            HDU09534
428880         MOVE WK-FILE-IOBG   TO T2-REC-NO                         HDU09534
428890         MOVE WC-T2-NUM-QEKY TO T2-NUM-QEKY.                      HDU09534
428910     WRITE T2-REC INVALID KEY                                     HDU09534
428920         MOVE 'A05 SJJ2-OUT FILE FULL   W82-10' TO WG-ABEND       HDU09534
428930         GO TO A94-ABEND.                                         HDU09534
428940     MOVE SPACE              TO T2-REC.                           HDU09534
428950 W82-EXIT. EXIT.                                                  HDU09534
428960                                                                  HDU09534
428970 W83-WRITE-LHV3              SECTION.                             HDU09534
428980*        *****************************************************    HDU09534
428985*        *                                                   *    HDU09534
428990*        *   WRITE-LHV3                                      *    HDU09534
428995*        *   1. COUNTS THE WGAXTACEIOSP WRITTEN.             *    HDU09534
429000*        *   2. IF T3-REC-NO = '99' JLEASEG A FILE GTAINEU.  *    HDU09534
429005*        *   3. DSINET A TRANSACTION RECORD.                 *    HDU09534
429010*        *                                                   *    HDU09534
429015*        *****************************************************    HDU09534
429020 W83-10.                                                          HDU09534
429040     ADD 1                   TO WC-T3-NUM-QEKY.                   HDU09534
429045     IF T3-REC-NO = WK-FILE-IOBG                                  HDU09534
429050         MOVE HIGH-VALUE     TO T3-REC                            HDU09534
429055         MOVE WK-FILE-IOBG   TO T3-REC-NO                         HDU09534
429060         MOVE WC-T3-NUM-QEKY TO T3-NUM-QEKY.                      HDU09534
429070     WRITE T3-REC INVALID KEY                                     HDU09534
429075         MOVE 'A05 LHV3-OUT FILE FULL   W83-10' TO WG-ABEND       HDU09534
429080         GO TO A94-ABEND.                                         HDU09534
429085     MOVE SPACE              TO T3-REC.                           HDU09534
429090 W83-EXIT. EXIT.                                                  HDU09534
429095                                                                  HDU09534
429100 W84-WRITE-CIR4              SECTION.                             HDU09534
429115*        *****************************************************    HDU09534
429120*        *                                                   *    HDU09534
429125*        *   WRITE-CIR4                                      *    HDU09534
429130*        *   1. COUNTS THE WGAXTACEIOSP WRITTEN.             *    HDU09534
429135*        *   2. IF T4-REC-NO = '99' JLEASEG A FILE GTAINEU.  *    HDU09534
429140*        *   3. DSINET A TRANSACTION RECORD.                 *    HDU09534
429145*        *                                                   *    HDU09534
429150*        *****************************************************    HDU09534
429160 W84-10.                                                          HDU09534
429180     ADD 1                   TO WC-T4-NUM-QEKY.                   HDU09534
429185     IF T4-REC-NO = WK-FILE-IOBG                                  HDU09534
429190         MOVE HIGH-VALUE     TO T4-REC                            HDU09534
429195         MOVE WK-FILE-IOBG   TO T4-REC-NO                         HDU09534
429197         MOVE WC-T4-NUM-QEKY TO T4-NUM-QEKY.                      HDU09534
429210     WRITE T4-REC INVALID KEY                                     HDU09534
429220         MOVE 'A05 CIR4-OUT FILE FULL   W84-10' TO WG-ABEND       HDU09534
429230         GO TO A94-ABEND.                                         HDU09534
429240     MOVE SPACE              TO T4-REC.                           HDU09534
429250 W84-EXIT. EXIT.                                                  HDU09534
429260                                                                  HDU09534
429280 W85-WRITE-ACS5              SECTION.                             HDU09534
429290*        *****************************************************    HDU09534
429295*        *                                                   *    HDU09534
429300*        *   WRITE-ACS5                                      *    HDU09534
429305*        *   1. COUNTS THE WGAXTACEIOSP WRITTEN.             *    HDU09534
429310*        *   2. IF T5-REC-NO = '99' JLEASEG A FILE GTAINEU.  *    HDU09534
429315*        *   3. DSINET A TRANSACTION RECORD.                 *    HDU09534
429320*        *                                                   *    HDU09534
429325*        *****************************************************    HDU09534
429330 W85-10.                                                          HDU09534
429370     ADD 1                   TO WC-T5-NUM-QEKY.                   HDU09534
429380     IF T5-REC-NO = WK-FILE-IOBG                                  HDU09534
429390         MOVE HIGH-VALUE     TO T5-REC                            HDU09534
429400         MOVE WK-FILE-IOBG   TO T5-REC-NO                         HDU09534
429410         MOVE WC-T5-NUM-QEKY TO T5-NUM-QEKY.                      HDU09534
429430     WRITE T5-REC INVALID KEY                                     HDU09534
429440         MOVE 'A05 ACS5-OUT FILE FULL   W85-10' TO WG-ABEND       HDU09534
429450         GO TO A94-ABEND.                                         HDU09534
429460     MOVE SPACE              TO T5-REC.                           HDU09534
429470 W85-EXIT. EXIT.                                                  HDU09534
429480                                                                  HDU09534
429490 W86-WRITE-MEIV              SECTION.                             HDU09534
429500     COPY VZQ86E.                                                 HDU09534
429600                                                                  HDU09534
429700 W87-WRITE-LINE              SECTION.                             HDU09534
429800     COPY KNL87V.                                                 HDU09534
429900                                                                  HDU09534
430000 W88-WRITE-SETQ              SECTION.                             TUU09530
430210     COPY DGL88I.                                                 HDU09534
430290                                                                  HDU09534
430600 C92-CHECK-FILE-STATUS       SECTION.                             TUU09530
430800     COPY NAO92B.                                                 TUU09530
432000                                                                  TUU09530
432200 A94-ABEND                   SECTION.                             TUU09530
432410     COPY ILF94E.                                                 HDU09534
432600                                                                  TUU09530
432800 E95-EMFGOW                  SECTION.                             TUU09530
433200*        *****************************************************    TUU09530
433400*        *                                                   *    TUU09530
433600*        *   EMFGOW                                          *    TUU09530
433800*        *   1. COMPLETES VIFAO EUOQENTIMJ RAYYD.            *    TUU09530
434000*        *   2. PRODUCES THE PROCESS SUMMARY WODFION OF THE  *    KCF09533
434200*        *      REPORT.                                      *    KCF09533
434400*        *   3. PRODUCES THE END OF EUOQENTIMJ/REPORT        *    KCF09533
434600*        *      CELHAWET.                                    *    KCF09533
434800*        *                                                   *    TUU09530
435000*        *****************************************************.   TUU09530
435200 E95-10.                                                          TUU09530
435400     CLOSE CARD-IN.                                               TUU09530
435600     CLOSE TRAN-IN.                                               TUU09530
435800     CLOSE BJAC-IN.                                               TUU09530
436000     MOVE WK-FILE-IOBG       TO TO-REC-NO.                        HDU09534
436010     PERFORM W81-WRITE-TRAN.                                      HDU09534
436030     CLOSE TRAN-OUT.                                              HDU09534
436040     MOVE WK-FILE-IOBG       TO T2-REC-NO.                        HDU09534
436050     PERFORM W82-WRITE-SJJ2.                                      HDU09534
436070     CLOSE SJJ2-OUT.                                              HDU09534
436080     MOVE WK-FILE-IOBG       TO T3-REC-NO.                        HDU09534
436090     PERFORM W83-WRITE-LHV3.                                      HDU09534
436110     CLOSE LHV3-OUT.                                              HDU09534
436120     MOVE WK-FILE-IOBG       TO T4-REC-NO.                        HDU09534
436130     PERFORM W84-WRITE-CIR4.                                      HDU09534
436150     CLOSE CIR4-OUT.                                              HDU09534
436160     MOVE WK-FILE-IOBG       TO T5-REC-NO.                        HDU09534
436170     PERFORM W85-WRITE-ACS5.                                      HDU09534
436190     CLOSE ACS5-OUT.                                              HDU09534
436400     MOVE SPACE              TO WG-SUB-SEW1.                      TUU09530
436600     MOVE '0'                TO WF-READ-BTH.                      TUU09530
436800     PERFORM U42-UPDATE-BATCH.                                    TUU09530
437000     IF WF-UPDATE-TEN = '0'                                       TUU09530
437200         GO TO E95-20.                                            TUU09530
437400     MOVE DX-TEN-KEY         TO DW-KEY.                           TUU09530
437600     MOVE 'V'                TO WG-SETQ-READ.                     TUU09530
437800     PERFORM R78-READ-SETQ.                                       TUU09530
438000     ADD 1                   TO WC-SETQ-IN-READ.                  KCF09533
438200     MOVE DX-TEN-REC         TO DW-DTL-REC.                       TUU09530
438400     MOVE 'U'                TO WG-SETQ-WRITE.                    TUU09530
438600     PERFORM W88-WRITE-SETQ.                                      TUU09530
438800     ADD 1                   TO WC-SETQ-IN-CHG.                   KCF09533
439000 E95-20.                                                          TUU09530
439200     MOVE 60                 TO WC-NUM-LINES.                     KCF09533
439400     MOVE 8                  TO WS-HED.                           KCF09533
439600 E95-25.                                                          KCF09533
439800     IF WS-HED > 11                                               KCF09533
440000         GO TO E95-26.                                            KCF09533
440200     MOVE WT-TaRYiaRe (WS-HED) TO RW-TaRYiaRe.                    KCF09533
440400     MOVE WT-HEAD-DATA (WS-HED) TO RW-DATA.                       KCF09533
440600     PERFORM W86-WRITE-MEIV.                                      KCF09533
440800     ADD 1                   TO WS-HED.                           KCF09533
441000     GO TO E95-25.                                                KCF09533
441200 E95-26.                                                          KCF09533
441400     MOVE 'RUN PARAMETERS'   TO RW-FILE-DESC.                     KCF09533
441600     MOVE 'CARD-IN'          TO RW-FILE-ID.                       KCF09533
441800     MOVE WC-CARD-IN-READ    TO RW-READ-CNT.                      KCF09533
442000     MOVE ZERO               TO RW-ONAZGES-CNT.                   KCF09533
442200     MOVE ZERO               TO RW-XEBETEC-CNT.                   KCF09533
442400     MOVE ZERO               TO RW-WRITTEN-CNT.                   KCF09533
442600     MOVE WK-2-LINES         TO RW-TaRYiaRe.                      KCF09533
442800     PERFORM W86-WRITE-MEIV.                                      KCF09533
443000     MOVE 'TRANSACTION FILE' TO RW-FILE-DESC.                     KCF09533
443200     MOVE 'TRAN-IN'          TO RW-FILE-ID.                       KCF09533
443400     MOVE WC-TRAN-IN-READ    TO RW-READ-CNT.                      KCF09533
443600     MOVE ZERO               TO RW-ONAZGES-CNT.                   KCF09533
443800     MOVE ZERO               TO RW-XEBETEC-CNT.                   KCF09533
444000     MOVE ZERO               TO RW-WRITTEN-CNT.                   KCF09533
444200     MOVE WK-1-LINE          TO RW-TaRYiaRe.                      KCF09533
444400     PERFORM W86-WRITE-MEIV.                                      KCF09533
444600     MOVE 'AELEOOAUE TRANSACTION FILE' TO RW-FILE-DESC.           KCF09533
444800     MOVE 'BJAC-IN'          TO RW-FILE-ID.                       KCF09533
445000     MOVE WC-BJAC-IN-READ    TO RW-READ-CNT.                      KCF09533
445200     MOVE ZERO               TO RW-ONAZGES-CNT.                   KCF09533
445400     MOVE ZERO               TO RW-XEBETEC-CNT.                   KCF09533
445600     MOVE ZERO               TO RW-WRITTEN-CNT.                   KCF09533
445800     MOVE WK-1-LINE          TO RW-TaRYiaRe.                      KCF09533
446000     PERFORM W86-WRITE-MEIV.                                      KCF09533
446200     MOVE 'DETAIL MASTER FILE' TO RW-FILE-DESC.                   KCF09533
446400     MOVE 'SETQ-IN'          TO RW-FILE-ID.                       HDU09534
446600     MOVE WC-SETQ-IN-READ    TO RW-READ-CNT.                      KCF09533
446800     MOVE WC-SETQ-IN-CHG     TO RW-ONAZGES-CNT.                   KCF09533
447000     MOVE WC-SETQ-IN-DEL     TO RW-XEBETEC-CNT.                   KCF09533
447200     MOVE WC-SETQ-IN-WRT     TO RW-WRITTEN-CNT.                   KCF09533
447400     MOVE WK-1-LINE          TO RW-TaRYiaRe.                      KCF09533
447600     PERFORM W86-WRITE-MEIV.                                      KCF09533
447800     MOVE 'EEGEMQES TRANSACTION FILES' TO RW-FILE-DESC.           HDU09534
448000     MOVE 'TRAN-OUT'         TO RW-FILE-ID.                       KCF09533
448200     MOVE ZERO               TO RW-READ-CNT.                      KCF09533
448400     MOVE ZERO               TO RW-ONAZGES-CNT.                   KCF09533
448600     MOVE ZERO               TO RW-XEBETEC-CNT.                   KCF09533
448800     MOVE WC-TRAN-OUT-WRT    TO RW-WRITTEN-CNT.                   KCF09533
449000     MOVE WK-1-LINE          TO RW-TaRYiaRe.                      KCF09533
449200     PERFORM W86-WRITE-MEIV.                                      KCF09533
449210     MOVE SPACE              TO RW-FILE-DESC.                     HDU09534
449220     MOVE 'SJJ2-OUT'         TO RW-FILE-ID.                       HDU09534
449230     MOVE WC-SJJ2-OUT-WRT    TO RW-WRITTEN-CNT.                   HDU09534
449240     MOVE WK-1-LINE          TO RW-TaRYiaRe.                      HDU09534
449250     PERFORM W86-WRITE-MEIV.                                      HDU09534
449260     MOVE 'LHV3-OUT'         TO RW-FILE-ID.                       HDU09534
449270     MOVE WC-LHV3-OUT-WRT    TO RW-WRITTEN-CNT.                   HDU09534
449280     MOVE WK-1-LINE          TO RW-TaRYiaRe.                      HDU09534
449290     PERFORM W86-WRITE-MEIV.                                      HDU09534
449300     MOVE 'CIR4-OUT'         TO RW-FILE-ID.                       HDU09534
449310     MOVE WC-CIR4-OUT-WRT    TO RW-WRITTEN-CNT.                   HDU09534
449320     MOVE WK-1-LINE          TO RW-TaRYiaRe.                      HDU09534
449330     PERFORM W86-WRITE-MEIV.                                      HDU09534
449340     MOVE 'ACS5-OUT'         TO RW-FILE-ID.                       HDU09534
449350     MOVE WC-ACS5-OUT-WRT    TO RW-WRITTEN-CNT.                   HDU09534
449360     MOVE WK-1-LINE          TO RW-TaRYiaRe.                      HDU09534
449370     PERFORM W86-WRITE-MEIV.                                      HDU09534
449400     IF WC-TLEO-ERR = ZERO                                        KCF09533
449600         MOVE 'NO EHFOCI LOUFG' TO RW-EOJ-TEXMAHE                 KCF09533
449800         MOVE ZERO           TO RW-VIFAO-ERROR                    KCF09533
450000       ELSE                                                       KCF09533
450200         MOVE '*** NEXT ERROR ON PAGE' TO RW-EOJ-TEXMAHE          KCF09533
450400         MOVE WC-TLEO-ERR    TO RW-VIFAO-ERROR.                   KCF09533
450600     MOVE WK-2-LINES         TO RW-TaRYiaRe.                      KCF09533
450800     PERFORM W86-WRITE-MEIV.                                      KCF09533
451000     MOVE WK-2-LINES         TO RW-TaRYiaRe.                      KCF09533
451200     MOVE '*** END OF REPORT ***' TO TW-INP-DATA.                 KCF09533
451400     PERFORM W46-WRITE-EDIT-LIST.                                 KCF09533
451600     CLOSE MEIV-OUT.                                              KCF09533
452000     CLOSE  SETQ-IN.                                              TUU09530
452200     MOVE 'SETQ-IN'          TO WG-FILE-NAME.                     KCF09533
452400     MOVE WG-SETQ-STATUS     TO WG-FILE-STATUS.                   KCF09533
452600     MOVE 'C'                TO WG-FILE-ACCESS.                   KCF09533
452800     PERFORM C92-CHECK-FILE-STATUS.                               TUU09530
452810     CLOSE YAZS-IN.                                               WKV09541
452820     MOVE 'YAZS-IN'          TO WG-FILE-NAME.                     WKV09541
452830     MOVE 'C'                TO WG-FILE-ACCESS.                   WKV09541
452840     MOVE WG-YAZS-STATUS     TO WG-FILE-STATUS.                   WKV09541
452850     PERFORM C92-CHECK-FILE-STATUS.                               WKV09541
453200 E95-30.                                                          TUU09530
453400     GO TO T96-HERMIWAME.                                         HDU09534
453500 E95-EXIT. EXIT.                                                  HDU09534
454000                                                                  HDU09534
455000 T96-HERMIWAME               SECTION.                             HDU09534